{
    "post": {
        "id": "t3_1ixeabc",
        "category": "healthcare",
        "query": "(Pfizer OR PFE OR Moderna OR MRNA OR Johnson & Johnson OR JNJ OR Eli Lilly OR LLY OR AbbVie OR ABBV OR Amgen OR AMGN OR Gilead OR UnitedHealth OR UNH)",
        "subreddit": "stocks",
        "title": "Hims &amp; Hers shares tumble 18% as margin miss adds to concerns about GLP-1 business",
        "body": "Hims &amp; Hers Health shares plunged 18% in extended trading on Monday after investors looked past better-than-expected revenue and earnings and focused instead on the disappointing gross margin.\n\nHere’s how the company did:\n\n* **Earnings per share:** 11 cents vs. 10 cents expected by LSEG\n* **Revenue:** $481 million vs. $470 million expected by LSEG\n\nRevenue at the telehealth company increased 95% in the fourth quarter from $246.6 million during the same period last year, according to a release.\n\nHowever, the company’s gross margin, or the profit left after accounting for the cost of goods sold, was 77%, while analysts polled by StreetAccount were expecting 78.4%.\n\nIt’s the second big stock drop for Hims &amp; Hers in a matter of days. The shares tumbled 26% on Friday after the U.S. Food and Drug Administration announced that the shortage of semaglutide injection products has been resolved.\n\nIn May, Hims &amp; Hers started prescribing compounded semaglutide, the active ingredient in Novo Nordisk’s blockbuster GLP-1 medications Ozempic and Wegovy. The company was a breakout star within the digital health sector in 2024, in part because of the success of its popular new weight loss offering. The stock climbed about 200% for the year.\n\nCompounded drugs are custom-made alternatives to brand-name drugs designed to meet a specific patient’s needs, and compounders are allowed to produce them when brand-name treatments are in shortage. The FDA said Friday that it will start taking action against compounders for violations in the next 60 to 90 days.\n\nHims &amp; Hers also offers treatments for skin care, mental health, sexual health and hair care.\n\nExcluding its GLP-1 offerings, revenue increased 43% to $1.2 billion for the full year, “meeting our previous 2025 revenue target a year early,” CFO Yemi Okupe said in a release.\n\n“The success we are experiencing is a direct reflection of our improving ability to democratize access to high quality, personalized care across each of our specialties,” Okupe said.\n\nNet income climbed to $26.01 million, or 11 cents per share, from $1.25 million, or 1 cent per share, a year prior. The company reported adjusted earnings of $54.1 million, meeting analyst estimates, according to StreetAccount.\n\nFor the first quarter, Hims &amp; Hers expects to report revenue of $520 million to $540 million, while analysts were expecting $497 million. Adjusted earnings will be between $55 million to $65 million for the period, the company said. \n\nSource: [https://www.cnbc.com/2025/02/24/hims-hers-health-hims-q4-earnings-2024.html](https://www.cnbc.com/2025/02/24/hims-hers-health-hims-q4-earnings-2024.html)",
        "url": "https://www.reddit.com/r/stocks/comments/1ixeabc/hims_hers_shares_tumble_18_as_margin_miss_adds_to/",
        "upVotes": 221,
        "upVoteRatio": 0.98
    },
    "comments": [
        {
            "id": "t1_melgtd7",
            "username": "Gonewildonly12",
            "body": "Sold at $50 and was kicking myself as it got up to almost $70… now lower than my exit what a wild ride",
            "url": "https://www.reddit.com/r/stocks/comments/1ixeabc/hims_hers_shares_tumble_18_as_margin_miss_adds_to/melgtd7/",
            "upVotes": 78,
            "upVoteRatio": null
        },
        {
            "id": "t1_melirft",
            "username": "PraiseBogle",
            "body": "I wouldnt touch that company with a 6 foot pole. Its glp medication isnt FDA approved, theres huge risk there. ",
            "url": "https://www.reddit.com/r/stocks/comments/1ixeabc/hims_hers_shares_tumble_18_as_margin_miss_adds_to/melirft/",
            "upVotes": 30,
            "upVoteRatio": null
        },
        {
            "id": "t1_melk8s9",
            "username": "dabesdiabetic",
            "body": "Isn’t it no longer allowed to even sell it given GLP-1’s are no longer on the shortage list?",
            "url": "https://www.reddit.com/r/stocks/comments/1ixeabc/hims_hers_shares_tumble_18_as_margin_miss_adds_to/melk8s9/",
            "upVotes": 17,
            "upVoteRatio": null
        },
        {
            "id": "t1_meouykz",
            "username": "himynameis_",
            "body": "That's what I've heard as well",
            "url": "https://www.reddit.com/r/stocks/comments/1ixeabc/hims_hers_shares_tumble_18_as_margin_miss_adds_to/meouykz/",
            "upVotes": 1,
            "upVoteRatio": null
        }
    ]
}