{
    "post": {
        "id": "t3_1ixxkgs",
        "category": "healthcare",
        "query": "(Pfizer OR PFE OR Moderna OR MRNA OR Johnson & Johnson OR JNJ OR Eli Lilly OR LLY OR AbbVie OR ABBV OR Amgen OR AMGN OR Gilead OR UnitedHealth OR UNH)",
        "subreddit": "investing",
        "title": "Floor &amp; Decor: Growth Strategy Amid Economic Challenges",
        "body": "Floor &amp; Decor faces challenges in the housing market due to high mortgage rates, which limit turnover and new construction. Despite this, aging homes drive demand for renovations. The company competes against major retailers like Home Depot and Lowe's but aims for growth with new store openings while facing profitability pressures and a high stock valuation. In fiscal 2024, revenue increased slightly by 0.95% with profitability taking hits as well as EPS.\n\n\\*I DO NOT own any shares in FND &amp; regularly post about companies that may be of interest to the general community\n\n# Investment Thesis:\n\nFND had yet another challenging year with sales growth of just under 1%. Profitability has taken quite the hit in the past two fiscal years with net income decreasing from $298.2 million in 2022 to $205.87 million in 2024. There has been a 30.9% decline over the two-year period. Macroeconomic challenges continue, including declining consumer affordability.\n\nAdditionally, there is a slowdown in new home purchases and starts. [According to the National Association of Home Builders](https://www.nahb.org/news-and-economics/press-releases/2025/01/housing-starts-end-2024-on-an-up-note), total housing starts for 2024 were 1.36 million, a 3.9% decline from 1.42 million in 2023. These factors have collectively led to softer demand in the home improvement sector. This has had a major effect on FND’s bottom line and future outlook. If there is a turnaround in the flooring industry in the years ahead, Floor &amp; Decor will be a large beneficiary. It will experience increased demand and have the potential to gain market share.\n\n# Key Factors\n\n* **Promising Expansion Potential:** Floor &amp; Decor has set a lofty strategy to target over 500 locations in the long-term from the 251 current stores. By the end of fiscal 2024, FND operates in 38 states. The company plans to open an additional 25 new warehouse stores in fiscal 2025. To support its expansion initiatives, the company has allocated between $330 to $400 million in capital expenditures. Between $200 million to $245 million is designated directly for new store openings. This investment will not only fund the opening of new stores but also the construction of additional distribution centers near Seattle and Baltimore in 2025 and 2026. FND’s expansion strategy to increase their physical presence, investing in infrastructure, and enhancing customer service could help to continue growing their market share against formidable competitors like Home Depot, Lowe’s, and Builders Firstsource.\n* **Premium Valuation:** At the time of writing, FND trades with a P/E of 52.19 indicating a massive premium position. While this is nothing new as they have a five-year average P/E of 42.3, this is still a steep asking price to pay. Management has issued fiscal 2025 sales guidance between $4.74 billion to $4.9 billion representing growth between 6.3% and 9.9%. This outlook is seen as a positive development for sales. This is due to management’s expectation to see comparable sales being flat to 3%. Nonetheless, the valuation is excessively rich. The stock declining -14% in the past year is insufficient to justify confidence in future share price appreciation. Sure, the stock generally has maintained its premium label. This is despite tougher conditions and results. Still, the valuation remains too high to confidently buy at $94.27 per share even if they are a well ran company.\n* **Tariff Concerns &amp; Threats:** In fiscal 2024, 18% of FND’s products sold were produced in China. As uncertainty persists about future tariffs imposed, FND has taken steps to mitigate disruptions. These include negotiating lower costs from vendors, sourcing from different countries, and increasing retail costs due to inventory costs moving higher. With potential increased costs in the flooring industry, this could dampen consumer spending. It could also dampen housing market activity. Both are crucial for the growth of FND. The company’s performance is closely tied to the health of the housing market. A prolonged slowdown will lead to decreased demand as homeowners may delay renovation projects and new construction may decline as a whole.\n\n# Conclusion\n\nFloor &amp; Decor is a great company with an attractive runway for long-term expansion with a strong balance sheet. However, despite its robust fundamentals, the issue stems from the current valuation. If the stock was trading around a 20-25 P/E, we could confidently recommend a buy. This is despite the secular tailwinds in recent years that continue to suppress profitability and strong earnings growth. With a premium valuation, you should expect strong performance. That simply has not been the case in recent years. Take for example fiscal 2025 expectations, growth between 6.3% and 9.9% does not support a company trading with a P/E of over 50.\n\nValuation aside, FND still presents a compelling investment opportunity. It has a proven business model and strategic growth initiatives despite the current housing market constraints. They have continued to gain market share against major rivals and have shown a history of great performance. Growth is expected to be its highest in three fiscal years which is a sign that stress is easing. When and if industry factors improve substantially, look for FND to be one of the major beneficiaries of an improving industry.\n\n# Risk Factors:\n\n*  **Interest Rate &amp; Housing Market Sensitivity:** Floor &amp; Decor’s business heavily relies on the residential housing market which is influenced by mortgage rates, home sales, and refinancing activity. Rising interest rates make buying and refinancing homes more expensive reducing home sales and renovation activity. A slowdown in new construction reduced the demand for FND’s flooring materials particularly from professional contractors. If the Federal Reserve maintains high rates for an extended period, FND may experience a decline in revenue growth. This could also affect profitability.\n* **Increased Competition:** FND has a specialized advantage in the flooring space. This is due to their overall focus on providing extensive products and materials. Nonetheless, Home Depot and Lowe’s already sell similar items. They could increase their product offering to compete directly with Floor &amp; Decor. Both large companies have major pricing power due to their size and supplier relationships. If they decide to lower flooring prices or offer exclusive deals to contractors, FND could lose market share that they have gained slowly in recent years.",
        "url": "https://www.reddit.com/r/investing/comments/1ixxkgs/floor_decor_growth_strategy_amid_economic/",
        "upVotes": 1,
        "upVoteRatio": 0.67
    },
    "comments": []
}