{
    "post": {
        "id": "t3_1ixzpoh",
        "category": "tech1",
        "query": "(Apple OR AAPL OR Microsoft OR MSFT OR Google OR GOOG OR Alphabet OR GOOGL OR Tesla OR TSLA)",
        "subreddit": "wallstreetbets",
        "title": "A closer look at Microsoft news – buy the AI dip?",
        "body": "As is usual before NVDA earnings, FUD is being spread about the ‘AI trade.’ I find this situation again reminiscent of the DeepSeek panic which NVDA and other AI plays quickly rebounded from in about a week (see my previous [post](https://www.reddit.com/r/wallstreetbets/comments/1icdu1d/deepseek_training_cost_the_95_mil_difference/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) highlighting the blatant misunderstanding of renting GPUs for $5.6m vs. total cost of ownership for AI infrastructure in $100s of billions).\n\n**The FUD: ‘data center oversupply’**\n\nHeadlines have been coming out that Microsoft walking away from a “couple hundred MWs” of datacenter leases (note, this would likely represent &lt;5% of their overall estimated 5 GW installed capacity). Analysts are also insinuating this means there is a larger ‘oversupply’ and therefore AI capital expenditures will be slowing down.\n\n[The Register - Microsoft's drawback on datacenter investment may signal AI demand concerns](https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=newssearch&amp;cd=&amp;ved=2ahUKEwj8jtzHg9-LAxXol-4BHfCRJ4cQxfQBKAB6BAgPEAE&amp;url=https%3A%2F%2Fwww.theregister.com%2F2025%2F02%2F24%2Fdoes_microsoft_pull_back_on%2F&amp;usg=AOvVaw3nXfbntonLATxN5KnPWAzG&amp;opi=89978449)\n\n*“TD Investment bank claims software giant ditched 'at least' 5 land parcels due to potential 'oversupply'”*\n\n \n\n**The Critique: Dip Buying Opp?**\n\nFirst off, it is not clear if these MSFT leases are for high-performance compute (GPUs for AI workloads) or traditional non-AI cloud (for things like storage, where demand has been waning). For the sake of argument, let’s assume this was for AI compute.\n\n**Point 1** \\- Overall, Microsoft is not slowing down. After the TD report on Friday, Microsoft [reiterated they are not cutting their $80bil capital spending plan for this year](https://www.cnbc.com/2025/02/24/microsoft-reiterates-plan-to-invest-80-billion-in-ai-.html). So, as they are walking away from a couple hundred MWs of leased capacity, meanwhile they will be building several GWs.\n\n**Point 2** \\- In Q4, Microsoft missed cloud revenue targets. On the earnings call, CFO Amy hood noted shortfalls in Q4 performance was due to supply constraints, and the larger capex spend is expected to drive stronger Azure growth. In other words, the revenue miss was a *capacity problem*, not a *demand problem*. So why slow down now? Doesn’t add up.\n\n**Point 3** – Open AI is adding more compute capacity with other partners (Oracle and Softbank). This would represent a ***shift*** in capital spending from Microsoft to others, i.e. this does not indicate an oversupply.\n\n[Microsoft and OpenAI evolve partnership to drive the next phase of AI - The Official Microsoft Blog](https://blogs.microsoft.com/blog/2025/01/21/microsoft-and-openai-evolve-partnership-to-drive-the-next-phase-of-ai/)\n\n“Microsoft has **approved OpenAI’s ability to build additional capacity**, primarily for research and training of models.”\n\n[OpenAI Stargate Joint Venture Demystified | Microsoft Sore Loser, Does Softbank Have The Capital?, Texas GigaCampus, Winners &amp; Losers – SemiAnalysis](https://semianalysis.com/2025/01/23/openai-stargate-joint-venture-demystified/#microsoft-is-the-biggest-loser)\n\n“**Microsoft is largely left on the sidelines as OpenAI utilizes another infrastructure partner.** As Satya Nadella [stated](https://x.com/ns123abc/status/1882085592135237737?s=19), “all I know is, I’m good for my $80B.” Microsoft’s recent [blog post](https://blogs.microsoft.com/blog/2025/01/21/microsoft-and-openai-evolve-partnership-to-drive-the-next-phase-of-ai/) stated the facts of the partnership and how Microsoft has a ROFR, but the reality is this is incrementally negative for Microsoft long-term since they were **afraid to take on the risk of this investment.** “\n\n“**Microsoft is shifting some of the capital intensity of its AI initiatives on to Oracle**, but we don’t think this short-term benefit outweighs the long-run potential harm of losing the revenue and control over OpenAI.”\n\n**AI continues advancements:**\n\nAnthropic’s [Claude 3.7](https://aws.amazon.com/blogs/aws/anthropics-claude-3-7-sonnet-the-first-hybrid-reasoning-model-is-now-available-in-amazon-bedrock/) was released Monday and is quickly approaching professional human-level coding abilities (70% on SWE bench, which measures agentic coding ability vs. 80% avg. score for a human professional). Open AI’s ChatGPT 4.5 is rumored to be released in the coming weeks as well. These are/will be tangible results in the advancement of these models towards agentic use with addressable markets in the trillions (think remote ‘drop-in’ AI coworker). Further, continued investment in U.S. AI infrastructure will be of paramount importance to national security (maintaining AI supremacy over China).  \n\n**TLDR:** I see this as a dip buying opportunity on AI names &amp; energy. Overreaction from MSFT news. (NVDA, TSM, VRT\\*\\*, AVGO, MRVL, ANET, CIEN, NBIS, APLD, VST, OKLO, ET, KMI)\n\n\\*\\*See UBS 11:27 AM ET, 02/25/2025 note on Vertiv: “Our conclusion is the recent sell-off is way overdone, as it implies &gt;30% reduction in data center capacity growth vs. what was priced in just 30 days ago.\"\n\n  \nDisclaimer: Not financial advice, blah, blah, blah.  I'm probably just a delusional perma-bull.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1ixzpoh/a_closer_look_at_microsoft_news_buy_the_ai_dip/",
        "upVotes": 30,
        "upVoteRatio": 0.82
    },
    "comments": []
}