{
    "post": {
        "id": "t3_1ixt56v",
        "category": "finance2",
        "query": "(BlackRock OR BLK OR Visa OR V OR Mastercard OR MA OR American Express OR AXP OR Charles Schwab OR SCHW OR Berkshire Hathaway OR BRK.A OR BRK.B)",
        "subreddit": "stocks",
        "title": "On Market Timing",
        "body": "You cannot time the market, but there are times when it is due for a crash. At those times you definitely don’t want to buy on the dips, and you want to sell a bit more on the rips. Major market declines can happen really fast (think of the flash crash), but major declines like 2000 and 2008 give you notice that they’re coming. **Crashes occur when a majority of investors are just wrong about something big.** If you want to make money on stocks over the long run, it’s good to see the crashes coming. I’m pretty sure that one is coming now. I'm a successful investor with 30 years in equities. Let me review my experience in the dot com crash and the 2008 financial crisis.\n\nI started investing significantly in 1996, when I got a better paying job. It was fun. You could identify new technologies and hold on for meteoric rise. I made a lot on IOM and AFFX. But it was clear that the market did not actually understand the internet. A company could double its market capitalization by getting a web site and renaming itself a dot com. Valuations reflected the mistaken idea that doing exactly the same business online was somehow going to be much more profitable. I remember realizing that I owned stocks that were worth far more than the underlying value of the company, but kept going up. I developed a rule (sell a third every time it triples) to get my money back while continuing to profit from the insanity. When things started to turn south, it didn’t take a genius to get out. When the bleeding stopped, I was early to get back in, looking for stocks that found support (low volume on down days) during the crash. Among the stocks I bought in 2001, I’ve done the best with AAPL.\n\nThe other big bear market I went through was 2008. Again, the fall can be traced to something that the majority of investors had wrong. I remember talking to a mortgage broker in 2004. They were pushing balloon mortgages and other nonsense that allowed people to buy houses they could not afford. I asked about the terms, and realized that shit would hit the fan in 2007 or 2008. It was not hard to see. There were a lot of these mortgages. As a homeowner, I got cold calls inviting me to refinance my 30 year fixed with something that would have a lower rate for a few years before exploding. Again, the economy was headed in the wrong direction because the market somehow thought these were safe. I can’t claim to have seen the crash coming (I thought the damage would be limited to foolish homeowners), but leveraged collateralized mortgage obligations set financial markets up for a fall. My point is that, once again, the market fell because the market was just wrong about something, and eventually reality could no longer be ignored.\n\nWe’re here again. A lot of people think Trump/DOGE will be good for business. Taxes will be cut and government waste eliminated. They do not understand how the parts of government being eliminated are good for business. I’ll give you three examples. First, the Consumer Financial Protection Bureau has been eliminated, or at least crippled. The idea is that less regulation is a good thing. But without that protection, more consumers are going to be subject to scams, and the more sophisticated are not going to use services like X Money at all, because they are no longer safe. Second, there have been huge cuts to funding for science (NIH, USDA, NSF, etc.) with almost no attempt to identify what spending is actually wasteful. Innovation comes from science, so this will be very very bad for business over the long run. Third, DOGE cancelled legal contracts for government services with no warning. Even if you think that providing services to refugees is wasteful, it’s not fraudulent, and the American businesses who had those contracts were obviously hurt, as was trust in the government. \n\nIs it too late to avoid disaster? Maybe not, but I don’t see Donald Trump saying “oops” anytime soon.\n\nSo, we’re there again. The market will fall because the market is wrong about something big.  \nYou can’t time the market, but this is not the time to buy on the dips, and I’ve been selling.",
        "url": "https://www.reddit.com/r/stocks/comments/1ixt56v/on_market_timing/",
        "upVotes": 39,
        "upVoteRatio": 0.6
    },
    "comments": [
        {
            "id": "t1_mep2fkc",
            "username": "Jacobwitg",
            "body": "Introduction: “you cannot time the market”\n\nContent: “how I’m gonna time the market” \n\nThis is the most regarded thing I have ever seen. Also you cannot compare this to the dot.com bubble or 2008. Look at all the record earnings from all the large corporations. This is not a hot air ballon, it’s actually driven by growth and fundamentals.\n\nPersonally i am aggressively buying this dip. But who knows maybe I’m right, maybe I’m wrong. But when retail/dumb money is this bearish, it has historically been a good time to buy. I saw a survey the other day, retail has not been this bearish since October 2023.",
            "url": "https://www.reddit.com/r/stocks/comments/1ixt56v/on_market_timing/mep2fkc/",
            "upVotes": 193,
            "upVoteRatio": null
        }
    ]
}