{
    "post": {
        "id": "t3_1ixvmn7",
        "category": "healthcare",
        "query": "(Pfizer OR PFE OR Moderna OR MRNA OR Johnson & Johnson OR JNJ OR Eli Lilly OR LLY OR AbbVie OR ABBV OR Amgen OR AMGN OR Gilead OR UnitedHealth OR UNH)",
        "subreddit": "investing",
        "title": "The Bull Case for Xpeng ($XPEV)",
        "body": "**Why Xpeng stock ($XPEV) can 5x to hit US$100 (and beyond?) by end-2026**\n\nBelow is a condensed report, drop me a PM if you want to know more. Also, if China stocks are not your thing, either risk-, political-, personal-, or other-wise, kindly ignore. I was not paid or sponsored to write this and do not have glowing EV or AI credentials, but I have been diligently researching and studying the EV industry (including Xpeng) since 2020.\n\n**INTRODUCTION**\n\nXpeng is a Chinese EV maker headed by CEO He Xiaopeng, with dual listings in the USA and Hong Kong. Its current price as of today is around US$19.5 with a market capitalization of around US$18.6 billion.\n\nBut is it really just an automaker? I’d argue Xpeng is in fact a software company providing full-stack AI mobility solutions, and seems hugely underestimated by analysts and markets alike. Here’s why Xpeng could see large growth in the coming years, perhaps hitting US$100 by end-2026 (or \\~US$100 billion market cap), using a simple SWOT analysis.\n\n**STRENGTHS** \n\n1. **Product &amp; Design:** Xpeng’s cars have always had aesthetics in mind, with their latest P7+ and sub-brand MONA M03 sedans’ stylish looks, best-in-class comfort, and large space now huge bestsellers in China. Xpeng is now the 3rd best selling EV carmaker in China at the moment, behind BYD, Wuling, and Geely.\n2. **Affordability:** Xpeng cars are kept affordable while retaining many luxury and tech features, providing good value-for-money.\n3. **Cutting-edge Technology &amp; Features:** Outstanding Xpeng tech includes an in-house powertrain integrated with the vehicle chassis, plus outstanding autonomous driving capabilities and smart features.\n4. **Strong Leadership Team:** In 2023, CEO Xiaopeng and President Wang Fengying overhauled the management team, rooted out corruption, eradicated departmental inefficiencies, and shifted to a more user-centric focus. The CEO remains humble and fully committed to building the company to reach greater heights.\n5. **Strong Supply Chain, Marketing &amp; Branding Management:** After a tumultuous 2022 and 2023, Xpeng’s product, marketing, and supply chain teams are now all working harmoniously to swiftly ramp up production and deliver blockbuster hits one after another.\n6. **Financials:** The [CEO has recently hinted at a breakeven quarter this year](https://cnevpost.com/2025/02/07/xpeng-expects-break-even-single-quarter-2025/), which will be a pivotal turning point for the company and change in valuation metrics.\n\n**WEAKNESSES**\n\n1. **Low Brand Strength &amp; Perception:** Xpeng is slowly but surely growing its reputation in China and overseas, with stronger sales.\n2. **Intense Industry Competition &amp; Price Wars Creating Margin Erosion:** Might not necessarily be a weakness since competition breeds innovation and efficiency (see Deepseek). Moreover, Xpeng has several cost advantages, such as Gigapresses and joint raw materials purchases with partner Volkswagen.\n\n**OPPORTUNITIES** \n\n1. **Strong 2025 Pipeline:** 2025 official target deliveries is 380–400,000. However looking at their strong pipeline, especially for L3 autonomous driving, I am forecasting 450–500,000 deliveries for this year, with a possibility of attaining 800,000+ EV deliveries for 2026.\n2. **Autonomous Driving (AD) &amp; Self Driving Cars:** Xpeng is a strong contender for this race, with the CEO declaring in January 2025 they will achieve Quasi-L3 AD by mid-2025 and Full L3 AD by end of 2025.\n3. **Flying Cars:** Xpeng’s Land Aircraft Carrier (modular van and flying eVTOL module) will start deliveries in 2026 (no, this is not a wild going-by-faith projection, the [factory is currently under construction with target completion in 3Q 2025](https://cnevpost.com/2024/10/27/xpeng-aeroht-flying-car-base-breaks-ground/)). Their entry will shake up the low-altitude economy due to its mass production capabilities, cost advantages, and synergies with EV production and technology. But don't expect this business to have a huge impact on the stock by itself.\n4. **Humanoid Robots:** Xpeng’s bipedal, all-purpose Iron Robots have already been deployed in Xpeng’s factories and stores, and are expected to enter trial commercial use in the second half of 2025, meaning commercial use may come in 2026, including **talking and moving like humans.** Much potential in this enormous space for Xpeng, which has several differences in its robot tech from its peers (with the CEO just saying he is confident [Xpeng will deploy one of the earliest mass-produced L3 robots in China](https://m.weibo.cn/status/5137890441693096)).\n5. **AI Car Chips:** Xpeng will mass-produce their potentially game-changing Turing AI chip in mid-2025 (3x the computing power of industry standard Nvidia's Drive Orin-X), where it will set off a chain motion of new product launches. Possible to be adopted by other automakers too. Angus McKenzie from Motortrend has speculated that if Xpeng’s Turing Chip lives up to its full potential, it could be a [Deepseek moment for the car industry](https://www.motortrend.com/news/xpeng-develops-ai-chip-deepseek-moment/). \n6. **Robocars &amp; Robotaxis:** The final step in autonomous driving (L4/L5 AD), and with endless possibilities: From transportation to food delivery to mobile convenience stores to F&amp;B to ecommerce deliveries. Coupled with Iron Robot can achieve wonders in any industry.\n7. **Global Expansion:** Xpeng car sales are accelerating around the world, with a targeted presence in 60 countries by end of 2025, compared to 30 as of end 2024.\n8. **Increasing Partnerships &amp; Institutional Investors:** Existing partnerships and investments by Volkswagen may deepen, and institutional investors (domestic or foreign) may start to invest in Xpeng as it becomes recognized worldwide.\n\n**THREATS** \n\n1. **Competition:** There is always intense **price competition** in the EV sector, whether in China or overseas. However, Xpeng is in a sweet spot of value for money and product, and will continue to attract customers in the entry-level range. **Competition in autonomous driving** is fierce, and there’s a chance another car company unlocks L3 and L4 before Xpeng. However, Xpeng will get there eventually too, and it has other prospects, plus it can always catch up and outshine with its robocar offerings. Some may also be worried that **copycats** will mimic Xpeng’s popular car models bolt for bolt, but it’s not so simple as Xpeng has built up a decade’s worth of proprietary innovation and expertise in building cutting-edge EVs. And will continue to do so.\n2. **Loss of Innovation:** Xpeng depends heavily on its tech innovation to stand out. Loss of key men may cause a brain drain and loss of technological edge. Xpeng is tackling this by recruiting the best and brightest, and heavily invested in R&amp;D.\n3. **Geopolitical Tensions:** I believe a **major war is very unlikely** under the current Trump administration. But increasing friction between USA and China may spark another call for **delisting of China ADRs**, which if comes to pass will create volatility in the stock prices, but I feel Xpeng’s stock will eventually recover and push higher as the company performs well (will have small forex risk though). USA may also decide to **tighten EV chip restrictions** on China automakers, but that will not affect Xpeng as it transitions to its own Turing Chip for all its products in mid-2025 (may turn out to be a boon instead as competitors falter).\n4. **Global or Domestic Economic Softness:** Any economic slowdown in China or the rest of the world will have a mixed effect on Xpeng’s position as an affordable, mass market, smart EV brand. A slowdown could actually spur more consumers to go for bang-for-their-buck cars, and Xpeng fits the bill perfectly.\n\n**SUMMARY**\n\nDo you want to own a company that can potentially change the world? Xpeng could turn out to be the **Tesla of China, Figure AI of China, Archer Aviation of China, Nvidia of Cars: All rolled into one!**\n\nThe risk reward looks tremendously positive. And the worst case I can see right now is the stock goes sideways due to inexplicable stagnation in its domestic and overseas EV car business, PLUS all its other exciting prospects — Autonomous Driving, Flying Cars, AI Chips, Robots, Robocars — fall flat.\n\nBUT, in a good scenario (not necessarily the best case even), if one or two of Xpeng’s businesses blast off? A review of each and my estimated valuations (now and end-2026, with estimated annual sales):\n\n1. **EV Cars (Semi-AD)** — Current (**L2 AD**, 300K annual sales): US$18 Billion | End 2026 (**L3 AD**, 800K-1M sales + huge/growing orderbook): US$50–60 Billion *(Benchmarked against BYD &amp; Li Auto valuation)*\n2. **Flying Cars** — Current (3K orderbook): US$1 Billion | End 2026 (10K sales + 10–30K orderbook, depends on type): US$5–20 Billion *(*[*Benchmarked against Archer Aviation valuation*](https://investors.archer.com/news/news-details/2024/Archer-Announces-Third-Quarter-2024-Results-Demonstrating-Manufacturing-Certification-and-Commercial-Launch-Momentum/default.aspx)*)*\n3. **Robots** — Current: Nil | End 2026 (5–10K sales + 10–100K orderbook): US$5–60 Billion *(Wildcard, Enormous potential,* [*Benchmarked against Figure AI valuation*](https://www.bloomberg.com/news/articles/2025-02-14/robotics-startup-figure-ai-in-talks-for-new-funding-at-39-5-billion-valuation)*)*\n4. **AI Chips** — Current: Nil | End 2026 (0–20K orderbook + partnerships): US$2–20 Billion *(Big wildcard at the moment)*\n5. **Robocars (Full-AD)** — Current: Nil | End 2026 (10–50K orderbook + partnerships): US$5–40 Billion *(Enormous potential,* [*Benchmarked against Waymo &amp; Tesla valuation*](https://www.barrons.com/articles/alphabet-waymo-stock-tesla-robotaxis-29a57e01) *with big haircut)*\n\nIs this so ridiculous? Bear in mind Tesla’s sky high valuation for its future autonomous driving, robot, and robocar plays. Now Xpeng is valued at a mere 1.8% of Tesla. A major product breakthrough can trigger a sharp bull run for Xpeng, cause short-sellers to stay away, and maybe turn it into a meme stock. Just my 2 cents. Peace out.",
        "url": "https://www.reddit.com/r/investing/comments/1ixvmn7/the_bull_case_for_xpeng_xpev/",
        "upVotes": 1,
        "upVoteRatio": 0.67
    },
    "comments": []
}