{
    "post": {
        "id": "t3_1ixfbwx",
        "category": "finance1",
        "query": "(JPMorgan OR JPM OR Goldman Sachs OR GS OR Morgan Stanley OR MS OR Bank of America OR BAC OR Citigroup OR C OR Wells Fargo OR WFC)",
        "subreddit": "investing",
        "title": "An Investment Warning Story",
        "body": "For your \"entertainment\" :)\n\nThe year was 2002. A good friend's cousin joined a startup called \"What's For Free Technologies\" (WFFT). They were developing a website that people would visit to received free promotional items. Behind the scenes, they were securing agreements with big names in retailing and polishing up the website, soon to be released. The stock was regularly trading between $6-$10 and would ride these predictable waves. I started trading on paper and, with an initial $1000 investment, had made tens of thousands of dollars buying low and selling high.\n\nI got some valuable information 3rd hand from the cousin that worked there - the company seemed to have had great success in securing deals, they hired an extra 50 programmers/employees for the website and everyone had just started to relocate into a huge, swanky commercial space. Morale was at an all time high. The website launch was in 1 month. I convinced my wife that investing now was the best move. I sunk in $1000 real dollars (which, at the time, was every penny we had saved).\n\nCut to the website launch day and I take the day off work to monitor my investment! Given that the stock (currently sitting predictably at $6) would rise to $10 without fail BEFORE the website launch, I had decided not to be greedy and would sell above $10 the very moment it seemed that it might be peaking. I would not hold out of greed. I was going to cut and run. My gut told me it might hit $14-$15.\n\nSite launches. Stock briefly rises to $7 then back to $6. A hour goes by with little movement. Confusing, why aren't people excited about the release? Stock makes another surge to $7 before slowly settling to $6. It slowly drops to $5 reverses back to $6. I'm checking every 5 minutes. I can't understand, the stock has never acted this way. I called my friend who tells me that his buddy and the WFFT workers are all excitedly buying stock from their offices. He assures me, don't worry, this thing is gonna skyrocket! I'm excited again.\n\nI watched as the stock slowly slid to $4 over the next hour or so. I call my friend back. He says his cousin (who works for WFFT) says there is some disappointment over the quality of the website but not to worry, the deals and partnerships are amazing. He said the management group has left the facility, he assumes to drum up some business, reminding investors that the cosmetics of the site will be improved but the value is there. The employees have food and champagne on ice, waiting for the stock to jump. The air, he says, is electric.\n\nI watch as the stock goes $4 to $3 to $2...to under a dollar in less than 10 minutes. I'm stunned. I don't believe it. I call my friend. His cousin is raging. They got an email from the management group saying everyone is being laid off until further notice. I lost my investment.\n\nPost mortem: the owners of the company propped up the share price by selling a lie. They didn't have many good partnerships and the website design sucked. They sold all their shares at one of the peaks and the price tumbled as confidence was eroded. At the end of the day, the company didn't have a valuable service, they knew it for many many months as they hyped up and sold shares, ultimately cashing out and tanking the stock and shuttering the company. Even with a person on the inside, you can get burned. I've never speculated on a stock since.",
        "url": "https://www.reddit.com/r/investing/comments/1ixfbwx/an_investment_warning_story/",
        "upVotes": 87,
        "upVoteRatio": 0.83
    },
    "comments": [
        {
            "id": "t1_menhyos",
            "username": "Todderoni-1",
            "body": "Btw, a mod at r/stocks deleted this post because it described “illegal insider trading”. Did having the information that this company was hiring and that things were going well and staff was excited about the impending website launch (which was public knowledge) constitute insider trading?",
            "url": "https://www.reddit.com/r/investing/comments/1ixfbwx/an_investment_warning_story/menhyos/",
            "upVotes": 27,
            "upVoteRatio": null
        },
        {
            "id": "t1_menqrd6",
            "username": "grothsauce",
            "body": "They don’t prosecute bag holders 😂",
            "url": "https://www.reddit.com/r/investing/comments/1ixfbwx/an_investment_warning_story/menqrd6/",
            "upVotes": 27,
            "upVoteRatio": null
        },
        {
            "id": "t1_meols1q",
            "username": "RealDreams23",
            "body": "Lmfaooooooo",
            "url": "https://www.reddit.com/r/investing/comments/1ixfbwx/an_investment_warning_story/meols1q/",
            "upVotes": 4,
            "upVoteRatio": null
        },
        {
            "id": "t1_meoku8e",
            "username": "Appropriate_Scar_262",
            "body": "Trading on these supposed partnerships that didn't exist that weren't public knowledge would be insider trading, yes.\n\nYou had no reason to think a random startup launching a website would have doubled in price upon making a website otherwise.\n\nThey burned people by getting them to invest off \"leaked\" info that wasn't real and left you no recourse to sue because you were using fake insider trading tips that they fed to people like your cousin.",
            "url": "https://www.reddit.com/r/investing/comments/1ixfbwx/an_investment_warning_story/meoku8e/",
            "upVotes": 13,
            "upVoteRatio": null
        }
    ]
}