{
    "post": {
        "id": "t3_1iyqk6a",
        "category": "finance1",
        "query": "(JPMorgan OR JPM OR Goldman Sachs OR GS OR Morgan Stanley OR MS OR Bank of America OR BAC OR Citigroup OR C OR Wells Fargo OR WFC)",
        "subreddit": "stocks",
        "title": "AST SpaceMobile Secures $43 Million Contract in Support of U.S. Space Development Agency Through Prime Contractor",
        "body": "  \n\n\n\n\n\n\n  \nMIDLAND, Texas--([BUSINESS WIRE](https://www.businesswire.com/))--[AST SpaceMobile, Inc.](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fast-science.com%2F&amp;esheet=54215199&amp;newsitemid=20250226892736&amp;lan=en-US&amp;anchor=AST+SpaceMobile%2C+Inc.&amp;index=1&amp;md5=5d3234b03385e00a47abae7c06f368e0&amp;_gl=1*1fxdpxg*_gcl_au*Nzk0OTE0MTcuMTc0MDU4NDQ3NQ..*_ga*MjA2MDUwNjIwMC4xNzQwNTg0NDc1*_ga_ZQWF70T3FK*MTc0MDU4NDQ3NC4xLjEuMTc0MDU4NDgwNS42MC4wLjA.) (“AST SpaceMobile”) (NASDAQ: ASTS), the company building the first and only space-based cellular broadband network accessible directly by everyday smartphones, designed for both commercial and government applications, today announced a new contract award in support of the United States Space Development Agency (SDA) through a prime contractor, with total expected revenue of $43 million.\n\nAs part of the U.S. Space Force, SDA will accelerate delivery of needed space-based capabilities to the joint warfighter to support terrestrial missions through development, fielding, and operation of the Proliferated Warfighter Space Architecture.\n\nThis contract follows successful testing on BlueWalker-3 in orbit under the previous contract announced in February 2024 and further demonstrates the unique capabilities of AST SpaceMobile's technology for specialized government applications. The company will utilize its next generation Block 2 BlueBird satellites, featuring the largest commercial phased array antennas ever deployed in low Earth orbit – spanning an unprecedented 2,400 square feet – setting a new standard for advanced connectivity and performance.\n\n“This second contract supporting the SDA underscores the confidence in AST SpaceMobile’s innovative technology and its potential to support critical government missions,” said Chris Ivory, Chief Commercial Officer and Head of Government Business of AST SpaceMobile. “We are deploying groundbreaking technology to create robust and resilient communications solutions and to enable new use cases for the U.S. government.\"\n\nAST SpaceMobile's technology, backed by 3,500 patent and patent-pending claims, offers unique dual-use advantages for both government and commercial customers. Its large, phased-array antennas and innovative architecture provides robust, resilient, and scalable solutions to address evolving mission needs.\n\n**About AST SpaceMobile**\n\nAST SpaceMobile is building the first and only global cellular broadband network in space to operate directly with standard, unmodified mobile devices based on our extensive IP and patent portfolio, and designed for both commercial and government applications. Our engineers and space scientists are on a mission to eliminate the connectivity gaps faced by today’s five billion mobile subscribers and finally bring broadband to the billions who remain unconnected.",
        "url": "https://www.reddit.com/r/stocks/comments/1iyqk6a/ast_spacemobile_secures_43_million_contract_in/",
        "upVotes": 69,
        "upVoteRatio": 0.94
    },
    "comments": [
        {
            "id": "t1_mewi1qg",
            "username": "SillyWoodpecker6508",
            "body": "ASTS is going to be the AT&amp;T of the 21st century",
            "url": "https://www.reddit.com/r/stocks/comments/1iyqk6a/ast_spacemobile_secures_43_million_contract_in/mewi1qg/",
            "upVotes": 26,
            "upVoteRatio": null
        },
        {
            "id": "t1_mex9639",
            "username": "lolman9990",
            "body": "All talk and talk ?",
            "url": "https://www.reddit.com/r/stocks/comments/1iyqk6a/ast_spacemobile_secures_43_million_contract_in/mex9639/",
            "upVotes": 2,
            "upVoteRatio": null
        },
        {
            "id": "t1_mexgons",
            "username": "SillyWoodpecker6508",
            "body": "Is this meant to be a pun?",
            "url": "https://www.reddit.com/r/stocks/comments/1iyqk6a/ast_spacemobile_secures_43_million_contract_in/mexgons/",
            "upVotes": 0,
            "upVoteRatio": null
        },
        {
            "id": "t1_mewlr21",
            "username": "M4tooshLoL",
            "body": "My favorite kind of Ass &amp; Tits.",
            "url": "https://www.reddit.com/r/stocks/comments/1iyqk6a/ast_spacemobile_secures_43_million_contract_in/mewlr21/",
            "upVotes": 8,
            "upVoteRatio": null
        }
    ]
}