{
    "post": {
        "id": "t3_1iy7vus",
        "category": "tech1",
        "query": "(Apple OR AAPL OR Microsoft OR MSFT OR Google OR GOOG OR Alphabet OR GOOGL OR Tesla OR TSLA)",
        "subreddit": "investing",
        "title": "How did you find the stock that hit it big?",
        "body": "Everyone's always talking about buying NVDIA at $2 and Apple at $5 etc. If you think back to the time you bought it, what was the mindset? Did you know it would be something big? What research steps/methods did you take to come across it? I’d be curious to hear about the mentality throughout the purchase, holding, and eventually selling. ",
        "url": "https://www.reddit.com/r/investing/comments/1iy7vus/how_did_you_find_the_stock_that_hit_it_big/",
        "upVotes": 58,
        "upVoteRatio": 0.69
    },
    "comments": [
        {
            "id": "t1_mesfq74",
            "username": "CarbonQuants",
            "body": "I run stock screeners to look for companies with market caps between $50M-$500M that have seen their stock decline more than 25% in the trailing 6 months. From there, I rule out companies that are iffy (lack transparency, susceptible to pump and dumps, inhibitable low volume) and run financial analyses on each of the remaining companies to see if their recent financials (typically past 2-3 quarters) justify the negative stock performance. If a given company has strong financials, a low P/E, I open a small position to lock in a low cost. If the stock starts turning around within a few weeks of when I come across it, I start building up my position. My last success with this was with GRRR. Entered the stock in July 2024 at $2.74 when the stock was down 52% from start of 2024, the stock fell a bit more, then started to gain and has been in the $20-30 range for the past few weeks.",
            "url": "https://www.reddit.com/r/investing/comments/1iy7vus/how_did_you_find_the_stock_that_hit_it_big/mesfq74/",
            "upVotes": 143,
            "upVoteRatio": null
        },
        {
            "id": "t1_mespjcm",
            "username": "jameshearttech",
            "body": "Great answer.",
            "url": "https://www.reddit.com/r/investing/comments/1iy7vus/how_did_you_find_the_stock_that_hit_it_big/mespjcm/",
            "upVotes": 17,
            "upVoteRatio": null
        },
        {
            "id": "t1_mesx0gz",
            "username": "bobross567898",
            "body": "I did the same thing. My biggest hit was DRUG, do to the fact that it lost 38% in the previous weeks and their was a lot of liquidity backing it up so I bought a few shares at 1.34$ and the rest is history. This is one of the best ideas to do if you have some Money and can risk it to gain more. My screener settings and ways of going about are a little different but this man has it down to the wire. Definitely would recommend following some sort of pattern like this. 👏",
            "url": "https://www.reddit.com/r/investing/comments/1iy7vus/how_did_you_find_the_stock_that_hit_it_big/mesx0gz/",
            "upVotes": 15,
            "upVoteRatio": null
        },
        {
            "id": "t1_mesxzwk",
            "username": "CarbonQuants",
            "body": "Super cool hearing this and I appreciate the kind comment. Looking at the chart for DRUG now.. wow! Here I thought my 1,140% gain on GRRR was pretty good, but over 2,400% in your case with DRUG, assuming you're still holding the stock, is incredible!",
            "url": "https://www.reddit.com/r/investing/comments/1iy7vus/how_did_you_find_the_stock_that_hit_it_big/mesxzwk/",
            "upVotes": 7,
            "upVoteRatio": null
        }
    ]
}