{
    "post": {
        "id": "t3_1iyb55q",
        "category": "tech2",
        "query": "(Nvidia OR NVDA OR Amazon OR AMZN OR Meta OR META OR Facebook OR OpenAI OR Intel OR INTC)",
        "subreddit": "investing",
        "title": "NVDA earnings expectations are way too high",
        "body": "Just saw on Bloomberg - NVDA is “cheapest in a while” because p/e is “30”. This market is still euphoric - I guarantee many analysts have not been phased by the deep seek news - after this news every single person should have become skeptical of using forward p/e or as mentioned on Bloomberg “p/e”. \n\nWhat is trailing p/e vs forward p/e?\n\np/e represents the multiple that investors pay for each $ of company earnings\n\nTrailing uses last years REAL earnings, for NVDA this is at ~50 (currently about +10 or more higher than all other stocks besides Tesla- which btw is still just a car company- check their income statement. \n\nForward uses PROJECTED EARNINGS - this is your 30 p/e and if you’re no skeptical about this after the deep seek news\n\nEUPHORIA\n",
        "url": "https://www.reddit.com/r/investing/comments/1iyb55q/nvda_earnings_expectations_are_way_too_high/",
        "upVotes": 32,
        "upVoteRatio": 0.73
    },
    "comments": [
        {
            "id": "t1_met0yj4",
            "username": "Excellent_Ability793",
            "body": "If NVDA underwhelms tomorrow the market will sell off in a big way",
            "url": "https://www.reddit.com/r/investing/comments/1iyb55q/nvda_earnings_expectations_are_way_too_high/met0yj4/",
            "upVotes": 59,
            "upVoteRatio": null
        },
        {
            "id": "t1_met62gl",
            "username": "xyzzy321",
            "body": "Everyone is expecting this so obviously NVDA will destroy earnings and will pop off +15%",
            "url": "https://www.reddit.com/r/investing/comments/1iyb55q/nvda_earnings_expectations_are_way_too_high/met62gl/",
            "upVotes": 37,
            "upVoteRatio": null
        },
        {
            "id": "t1_metfoba",
            "username": "testmonkeyalpha",
            "body": "I'm sure they'll beat consensus but their earnings guidance will be \"disappointing\" because it isn't completely unrealistic like the investors want resulting in a big sell off just like every other tech company this last quarter.",
            "url": "https://www.reddit.com/r/investing/comments/1iyb55q/nvda_earnings_expectations_are_way_too_high/metfoba/",
            "upVotes": 7,
            "upVoteRatio": null
        }
    ]
}