{
    "post": {
        "id": "t3_1iyqgfy",
        "category": "tech2",
        "query": "(Nvidia OR NVDA OR Amazon OR AMZN OR Meta OR META OR Facebook OR OpenAI OR Intel OR INTC)",
        "subreddit": "investing",
        "title": "Long Term Individual Stocks",
        "body": "Hi everyone, \nAnyone willing to share their opinion on good on more long term investment stock? Started investing with Robinhood a year ago &amp; have TSLA  at the moment which I’m still holding… I also have very few AAPL &amp; AMZN which I felt like I should’ve bought more.. bought in also NVDA dip. Please share thoughts if any. Thanks!",
        "url": "https://www.reddit.com/r/investing/comments/1iyqgfy/long_term_individual_stocks/",
        "upVotes": 1,
        "upVoteRatio": 0.57
    },
    "comments": [
        {
            "id": "t1_mewi3by",
            "username": "sovietdumpling",
            "body": "Amazon is a long term hold for sure. I would buy more. Not only is AWS growing but I also believe in there Amazon prime video business which is a huge business in itself when you compare it to Netflix. I also like how they’re expanding into self driving cars with zoox (not sure how this will play out) and I also strongly believe there in a great position with AI agents and actual use cases to AI.",
            "url": "https://www.reddit.com/r/investing/comments/1iyqgfy/long_term_individual_stocks/mewi3by/",
            "upVotes": 2,
            "upVoteRatio": null
        },
        {
            "id": "t1_mewnuwx",
            "username": "kronco",
            "body": "I hold an earlier generations version of those stocks in that I've held XOM, CAT, KMB since the late 80s. Looking at past 20 and 30 years only CAT beat the S&amp;P 500 (and basically tied it). I used this:\n\n [https://www.barchart.com/stocks/quotes/$SPX/interactive-chart](https://www.barchart.com/stocks/quotes/$SPX/interactive-chart)\n\n(I'm not sure how that tool accounts for dividend re-investment.)\n\nOver longer terms, I don't think you will beat an index. Maybe one stock might and others will under-perform.\n\n\\&gt;&gt; Started investing with Robinhood a year ago\n\nCurious what your definition of long term is? (Not trying to be glib, mine is decades.)",
            "url": "https://www.reddit.com/r/investing/comments/1iyqgfy/long_term_individual_stocks/mewnuwx/",
            "upVotes": 2,
            "upVoteRatio": null
        },
        {
            "id": "t1_mewk3u0",
            "username": "Moirailogist",
            "body": "Those are megacap stocks that have been researched by thousands of professionals and millions of ordinary investors. If the stock is certain to increase without risk, the price would have increased already -&gt; market efficiency hypothesis.",
            "url": "https://www.reddit.com/r/investing/comments/1iyqgfy/long_term_individual_stocks/mewk3u0/",
            "upVotes": 1,
            "upVoteRatio": null
        },
        {
            "id": "t1_mewnkri",
            "username": "favoritedeadrabbit",
            "body": "When targeting a stock for long term investment, if the only risk you can identify is \"nothing is certain\" then it's probably worth considering.",
            "url": "https://www.reddit.com/r/investing/comments/1iyqgfy/long_term_individual_stocks/mewnkri/",
            "upVotes": 1,
            "upVoteRatio": null
        }
    ]
}