{
    "post": {
        "id": "t3_1iy5new",
        "category": "tech1",
        "query": "(Apple OR AAPL OR Microsoft OR MSFT OR Google OR GOOG OR Alphabet OR GOOGL OR Tesla OR TSLA)",
        "subreddit": "stocks",
        "title": "Tesla sales in Europe down 45% in January",
        "body": "Tesla sales plummeted in Europe in January, suggesting waning demand for the US carmaker’s vehicles after its billionaire chief Elon Musk stepped up his high-profile interventions in the region’s politics.\n\nThe EV maker sold just 9,900 units in Europe last month, a decline of more than 45 per cent from the same period in 2024, according to data from the European Automobile Manufacturers’ Association. Its overall share of new car registrations fell to 1 per cent from 1.8 per cent over the same period.\n\nTesla’s falling market share comes after Musk’s unprecedented foray into EU politics, where he backed the far-right Alternative for Germany (AfD) ahead of the country’s elections, sparking a backlash on the continent. Musk has also railed against the EU, which he described in November as “undemocratic”.\n\nThe fall came even as European consumers purchased 166,000 battery EVs for the month, up 37 per cent from a year ago. Pure EV sales grew faster than those of all other types of vehicles, while sales of cars with petrol and diesel engines fell 20.5 per cent and 26.5 per cent, respectively.\n\nThe figures include the EU, UK and other markets including Norway, one of Europe’s biggest markets for EVs.\n\nEuropean sales by SAIC Motor, the Chinese state-backed carmaker that has expanded into the EU and partnered with Audi in China, rose 37 per cent to 23,000 vehicles in January, among the largest year-on-year increases in sales of any large manufacturer in the region.\n\nOverall new vehicle registrations on the continent fell by 2.1 per cent in January to 995,271.\n\nSource: https://www.ft.com/content/cdd0b5c8-2703-4fd4-9ebf-26087cac8523",
        "url": "https://www.reddit.com/r/stocks/comments/1iy5new/tesla_sales_in_europe_down_45_in_january/",
        "upVotes": 188,
        "upVoteRatio": 0.97
    },
    "comments": [
        {
            "id": "t1_merqg91",
            "username": "Drink_noS",
            "body": "Don't forget that 35 percent of their revenue last quarter was from Bitcoin gains. Bitcoin is down 20 percent since then.",
            "url": "https://www.reddit.com/r/stocks/comments/1iy5new/tesla_sales_in_europe_down_45_in_january/merqg91/",
            "upVotes": 83,
            "upVoteRatio": null
        },
        {
            "id": "t1_merrihm",
            "username": "DaddyVaradkar",
            "body": "**I guess elon will force trump to come up with speccial policy for more subsidiaries for EV or for federal gov to buy more EV which will pump the stock back up**\n\nAlso, Tesla is planning to launch in India this quarter so not sure how many sales will come from there. Stock is still open for speculation at this point I would say so hard to say bear or bull",
            "url": "https://www.reddit.com/r/stocks/comments/1iy5new/tesla_sales_in_europe_down_45_in_january/merrihm/",
            "upVotes": 12,
            "upVoteRatio": null
        },
        {
            "id": "t1_merswos",
            "username": "Drink_noS",
            "body": "He cares more about his own companies more then Tesla, SpaceX and xAI will always come first to Elon.",
            "url": "https://www.reddit.com/r/stocks/comments/1iy5new/tesla_sales_in_europe_down_45_in_january/merswos/",
            "upVotes": 3,
            "upVoteRatio": null
        },
        {
            "id": "t1_mert63u",
            "username": "DaddyVaradkar",
            "body": "Most of his debt is tied to stock valuation of Tesla, dont think he can afford for it to crash",
            "url": "https://www.reddit.com/r/stocks/comments/1iy5new/tesla_sales_in_europe_down_45_in_january/mert63u/",
            "upVotes": 2,
            "upVoteRatio": null
        }
    ]
}