{
    "post": {
        "id": "t3_1iyfh9d",
        "category": "finance2",
        "query": "(BlackRock OR BLK OR Visa OR V OR Mastercard OR MA OR American Express OR AXP OR Charles Schwab OR SCHW OR Berkshire Hathaway OR BRK.A OR BRK.B)",
        "subreddit": "investing",
        "title": "Here’s my theory on why everyone should be buying Bitcoin.",
        "body": "First off, I’m not saying to go all in and only buy bitcoin. Obviously you should have a diversified portfolio of stocks and ETFs too. But I’m going to argue why everyone should be buying bitcoin. Personally I just dollar cost average and buy the same amount every month and sometimes double it if there is a big drop.\n\nMy theory is based on the de-Americanization of the world and the probable removal of the dollar as the world reserve currency and the end of the petrodollar. Trump seems to be accelerating this process but the trends have been there for a while. It’s impossible for me to guess when this will happen but my theory is more based on the world being on that path.\n\nBRICS is clearly a big part of this. I think this is what could most likely lead to the end of the petrodollar. They seem interested in creating a competitor to the dollar and trading oil in a different currency would be a good way to start.\n\nI think we’ll start seeing a major reduction in the foreign appetite for US debt as the total rises. The other threat here is a devaluation of the dollar if the government decides to print more to pay the interest. That weakens the argument that the dollar should be the world reserve currency.\n\nBrentton Woods is dead officially since Nixon. So I feel like the contract struck is dead too. It’s just a matter of time until other countries call us out on this.\n\nI think when that really happens will be determined by the rate at which our military degrades. I think the real reason the world accepts the US financial domination of the dollar is that we enforce the ability to have international trade on the oceans.\n\nMost international trade happens by sea. 90% by volume and 70-80% by value. This is only possible because the US has been the police of the sea since World War 2. No other country had the financial and military capability. And our war build up meant that for the first time we could. That is the macro economic paradigm we have existed in for 85 years.\n\nThis is also becoming less and less true. The Cold War saw the USSR and now Russia begin to challenge the US in oceans. They obviously can’t dominate the US but they can compete. More recently China has made major advancements. One example is the massive amphibious ship they just unveiled. This means we are moving from a uni-polar world to a multi-polar world. This makes the removal of the dollar as world reserve currency possible.\n\nAfrica unifying under an African currency is also an interesting idea but I don’t know enough about it to comment. But if it did happen it would be a big deal and a major move in that direction.\n\nWhat does this mean for Bitcoin?\nI think this is where the idea of Bitcoin being digital gold comes in. Bitcoin is known by most people in the world now. We’re seeing institutional and some national recognition. So there is already some “belief in its value”. We’ve already seen it be valuable to some people. I think when the dollar is no longer the world reserve currency and this fake idea of being pegged to physical value in Fort Knox ceases to exist other countries will choose not to peg their currencies to gold again. I think leaders are addicted to floating currencies at this point. I think a lot of countries will eventually opt to peg their own digital current to bitcoin because it already “has value” in the minds of the public and probably will even by that point.\n\nI do think the price of bitcoin will need to stabilize to a degree for this to happen. But that’s a different subject. Mass adoption, regulation, and decreased mining could contribute.",
        "url": "https://www.reddit.com/r/investing/comments/1iyfh9d/heres_my_theory_on_why_everyone_should_be_buying/",
        "upVotes": 0,
        "upVoteRatio": 0.25
    },
    "comments": [
        {
            "id": "t1_meu2xy9",
            "username": "Vandermeerr",
            "body": "Every Bitcoin enthusiast just has to write out a fucking thesis to explain why it’s worth anything and everyone should buy it. \n\nIf it’s so fucking useful people would already be adopting it.  ",
            "url": "https://www.reddit.com/r/investing/comments/1iyfh9d/heres_my_theory_on_why_everyone_should_be_buying/meu2xy9/",
            "upVotes": 26,
            "upVoteRatio": null
        }
    ]
}