{
    "post": {
        "id": "t3_1iyztqs",
        "category": "tech2",
        "query": "(Nvidia OR NVDA OR Amazon OR AMZN OR Meta OR META OR Facebook OR OpenAI OR Intel OR INTC)",
        "subreddit": "investing",
        "title": "NVIDIA Announces Financial Results for Fourth Quarter and Fiscal 2025!",
        "body": "**NVIDIA Announces Financial Results for Fourth Quarter and Fiscal 2025**\n\n* [**NVDA Press Release**](https://macro.com/app/pdf/5ca3338c-745b-4bf4-8134-ef81f7efdb5c?pdf_page_number=1&amp;pdf_page_y=0)\n\n**Source Material:**\n\n* [**NVDA Form 10-K**](https://macro.com/app/pdf/2492022a-6d46-45d4-889b-f41c443f41f1?pdf_page_number=1&amp;pdf_page_y=0)\n* [**NVDA Form 8-K**](https://macro.com/app/pdf/ca8acfe9-1d9a-412d-8a61-e353358bf8f6?pdf_page_number=1&amp;pdf_page_y=0)\n\n**Key Takeaways:**\n\n* Q4 FY25 revenue reached $39.3 billion, reflecting a 78% increase year-over-year and a 12% rise sequentially. The surge in sales underscores the company’s strong execution across its AI-focused product lines and robust end-market demand.\n* Data Center revenue in Q4 grew to $35.6 billion, posting a 93% increase from the prior year and a 16% gain sequentially. The elevated demand stemmed from enterprise AI deployments, large language models, and strong uptake of NVIDIA’s accelerated computing platforms.\n* Full-year FY25 revenue soared to $130.5 billion, representing a 114% jump from the prior fiscal year. The broad-based strength spanned AI, gaming, professional visualization, and automotive markets, illustrating the company’s diversified growth drivers.\n* GAAP earnings per diluted share for Q4 stood at $0.89, an 82% year-over-year spike and a 14% increase quarter-over-quarter. Non-GAAP EPS also amounted to $0.89, up 71% from a year earlier, showcasing strong underlying profitability.\n* Gross margin on a GAAP basis was 73.0% in Q4, down from 76.0% in the prior year. The decline primarily resulted from higher production costs for advanced AI hardware, although overall margins remain structurally high due to premium pricing in data center solutions.\n* The breakthrough Blackwell architecture logged $11.0 billion in first-quarter revenue, marking the fastest ramp in the company’s history. Customer interest and initial orders indicate significant future opportunities in training and inference workloads tied to generative AI.\n* Gaming segment revenue came in at $2.5 billion during Q4, an 11% decrease year-over-year and a 22% drop sequentially. Supply constraints for certain products and a strategic emphasis on data center customers contributed to softer results.\n* Automotive revenue reached $570 million in Q4, climbing 103% year-over-year and 27% sequentially. Adoption of NVIDIA’s DRIVE platform and rising demand for AI-assisted driver features helped propel this segment’s growth.\n* Operating expenses on a GAAP basis rose to $4.7 billion in Q4, increasing 48% from the same period last year. Elevated R&amp;D outlays for new product development and expanded infrastructure to support high-performance computing drove the expense growth.\n* Inventory levels hit $10.1 billion, with days sales of inventory at 86. Purchase commitments and obligations for inventory and manufacturing capacity totaled $30.8 billion, reflecting management’s intent to secure supply for surging AI hardware orders.\n* Q4 cash, cash equivalents, and marketable securities stood at $43.2 billion, up from $26.0 billion a year earlier. The robust liquidity position supports ongoing R&amp;D initiatives, potential M&amp;A opportunities, and significant shareholder returns, which reached $34.5 billion in FY25.\n* Management projects Q1 FY26 revenue to be $43.0 billion plus or minus 2%, with GAAP and non-GAAP gross margins of 70.6% and 71.0%, respectively. The optimistic near-term outlook reflects continuing AI momentum, though potential supply-chain risks and intensifying competition may affect long-term valuations.\n\n**UPDATED NVDA DCF AND VALUATION MODEL WILL BE POSTED AT 8PM ET**",
        "url": "https://www.reddit.com/r/investing/comments/1iyztqs/nvidia_announces_financial_results_for_fourth/",
        "upVotes": 8,
        "upVoteRatio": 0.9
    },
    "comments": [
        {
            "id": "t1_meyt9f8",
            "username": "GongTzu",
            "body": "Nvidia have no time for gamers, the clients who made them 😅. Didn’t they post profit for each segment?",
            "url": "https://www.reddit.com/r/investing/comments/1iyztqs/nvidia_announces_financial_results_for_fourth/meyt9f8/",
            "upVotes": 3,
            "upVoteRatio": null
        }
    ]
}