{
    "post": {
        "id": "t3_1iyogaj",
        "category": "tech3",
        "query": "(AMD OR Advanced Micro Devices OR Qualcomm OR QCOM OR Cisco OR CSCO OR IBM OR Oracle OR ORCL OR Netflix)",
        "subreddit": "stocks",
        "title": "These are the stocks on my watchlist (02/26)",
        "body": "This is a daily watchlist for short-term trading: I might trade all/none of the stocks listed, and even stocks not listed!\n\nI am targeting potentially good candidates for short-term trading; I have no opinion on them as investments.\n\nThe potential of the stock moving today is what makes it interesting, everything else is secondary.\n\n**NVDA earnings today, will likely decide the fate of the immediate market. It reports at 4:20 ET today!**\n\nNews: [China Plans To Start Bank Capital Hike With At Least 55 Billion](https://www.bloomberg.com/news/articles/2025-02-26/china-plans-to-start-bank-capital-hike-with-at-least-55-billion)\n\n**Ticker:** [**NVDA (NVIDIA)**](https://finviz.com/quote.ashx?t=NVDA&amp;p=d)/[**AMD (Advanced Micro Devices)**](https://finviz.com/quote.ashx?t=AMD&amp;p=d)/All Semiconductor Stocks/SMH\n\n**Catalyst:** Some catalysts today: Deepseek cuts API pricing by 75%, NVDA is reporting earnings, ChatGPT is doing a limited rollout of ChatGPT 4.5, META considering $200B AI data center.\n\nNVDA reporting earnings is the main catalyst today and decides the immediate direction of the market.\n\n**Technicals:** Mainly interested in seeing if NVDA misses revenue (unlikely) or if they say anything significant due to new export controls which I talked about yesterday (strengthening of CHIPS Act export controls to China).\n\n**Catalyst/Sector Context:** NVDA leads in semis design, is a multi-billion dollar company, etc.\n\n**Risks:** I'm currently positioned defensively (sold calls against my position since I have a decent cost basis from back when DeepSeek news released, so overall will just sit on hands and get out of my position if the earnings are bad).\n\n**Related Tickers:** INTC, QCOM, ASML\n\n**Ticker:** [**TSLA (Tesla)**](https://finviz.com/quote.ashx?t=TSLA&amp;p=d)\n\n**Catalyst:** (Old news) New report shows demand is falling in Europe, with sales dropping a precipitous 45% in January.\n\n**Technicals:** Massive selloff since post-election highs- $300 was a significant level I was watching at the time and we exploded past that, so interested to see if we're able to hold above it.\n\n**Catalyst/Sector Context:** BYD is a major competitor to TSLA and will likely overtake them in the future, and Musk's political actions are seen as controversial in Europe.\n\n**Risks:** Musk.\n\n**Related Tickers:** BYD, and other auto stocks.\n\n**Ticker:** [**COIN (Coinbase)**](https://finviz.com/quote.ashx?t=COIN&amp;p=d)**/**[**HOOD (Robinhood)**](https://finviz.com/quote.ashx?t=HOOD&amp;p=d)**/**[**MSTR (MicroStrategy)**](https://finviz.com/quote.ashx?t=MSTR&amp;p=d)**/Other CC Stocks**\n\n**Catalyst:** The CC market is experiencing a selloff mainly due to proposed tariffs and the hack at Bybit, resulting in the loss of \\~$1.5 billion.\n\n**Technicals:** Not too interested in playing this long- still watching to see how we perform but the sell off has continued, waiting for a larger move still.\n\n**Catalyst/Sector Context:** Hacks increase fear of storing on centralized exchanges (like Coinbase), proposed tariffs affecting digital assets can lead to market volatility. Interestingly enough, ByBit was (theorized) to be hacked by North Korea.\n\n**Related Tickers:** MARA, RIOT\n\n**Ticker:** [**BABA (Alibaba)**](https://finviz.com/quote.ashx?t=BABA&amp;p=d)**/**[**FXI (iShares China Large-Cap ETF)**](https://finviz.com/quote.ashx?t=FXI&amp;p=d)**/Chinese Stocks**\n\n**Catalyst:** China plans to inject at least $55 billion into its largest banks in the coming months as part of a broader stimulus package, Yuan printer go brrrrr. This move is intended to supplement the core Tier 1 capital of China’s six largest state-owned banks. This is the first bank recapitalization since the global financial crisis. 10T yuan (\\~$1.4T) debt package to support local government financing and economic stability.\n\n**Technicals:** We've seen a decent upmove on a lot of Chinese stocks due to this, we'll see how the market reacts.\n\n**Catalyst/Sector Context:** China has been going through a spending crisis, and the government's decision to inject substantial capital into its major banks is a move to strengthen liquidity. This initiative aims to enhance the lending capacity of banks, support local government financing, and stabilize the broader economy. It's a (pre) bailout baby.\n\n**Risks:** This does signal that China sees economic weakness, such as lack of demand due to their real estate sector they've traditionally leaned on for consumer growth/investment. Is this a long term fix? Who knows, but it worked for the US!\n\n**Related Tickers:** JD, BIDU\n\n**Ticker: SMCI**\n\n**Catalyst:** They finally filed an hour before the deadline on the final day! Really cutting it close there lol. The company has faced allegations of accounting irregularities. These allegations, along with a failure to file specific financial forms have been a plague for the past year on the stock price. \n\n**Technicals:** We've seen a 20% move AH, so worth watching at open to see if we move further. Other than that, watching $50/$55 level. We'll see where it goes but worth noting that we've made a significant move back to pre-delisting threat prices already.\n\n**Catalyst/Sector Context:** Was at threat of delisting from the NASDAQ but now they're safe baby.\n\n**Risks:** People getting out, or the filing being rejected/advised to resubmit. The latter is a massive catalyst but low probability.\n\nEarnings: NVDA, CRM, SNOW, AI",
        "url": "https://www.reddit.com/r/stocks/comments/1iyogaj/these_are_the_stocks_on_my_watchlist_0226/",
        "upVotes": 29,
        "upVoteRatio": 0.81
    },
    "comments": [
        {
            "id": "t1_mew4mf6",
            "username": "Pea-Pod-4165",
            "body": "NVDA earnings will be the big decider today.",
            "url": "https://www.reddit.com/r/stocks/comments/1iyogaj/these_are_the_stocks_on_my_watchlist_0226/mew4mf6/",
            "upVotes": 5,
            "upVoteRatio": null
        }
    ]
}