{
    "post": {
        "id": "t3_1iy7k0k",
        "category": "tech3",
        "query": "(AMD OR Advanced Micro Devices OR Qualcomm OR QCOM OR Cisco OR CSCO OR IBM OR Oracle OR ORCL OR Netflix)",
        "subreddit": "stocks",
        "title": "Super Micro surges after filing delayed reports in time with SEC",
        "body": "Super Micro Computer (NASDAQ:SMCI) surged during post-market hours on Tuesday after the company filed its \"delinquent\" financial reports to the U.S. Securities and Exchange Commission just ahead of its deadline.\n\nShares for the storage, server and networking provider closed the trade day down 11.5% as uncertainty swirled whether it would file its audited annual report for fiscal 2024 and the first two quarters of fiscal 2025 by the February 25 deadline. If not, it faced a possible delisting from Nasdaq.\n\n\"Due to EY's (Ernst and Young LLP) stated concerns and subsequent resignation, we were unable to timely file our Annual Report and Quarterly Reports on Form 10-Q for the quarterly periods ended September 30, 2024 and December 31, 2024 (together the 'Delinquent Reports') as required under Nasdaq’s Listing Rule 5250,\" the filing reads. \"On December 6, 2024, Nasdaq granted us an exception to Nasdaq’s Listing Rule 5250, allowing us to file all the Delinquent Reports by February 25, 2025.\"\n\nIn Super Micro's 10-K filing, the company contends it does not agree with Ernst and Young's resignation or its reasons for doing so. Concerns about the company's financial statements cropped up in late August, when Hindenburg Research issued a report that it was short Super Micro's shares. A day later, Super Micro said it was delaying its annual 10-K filing.\n\n\"The Special Committee did not believe that the resignation of EY or the conclusions reached by EY were supported by the facts examined in the Review, the Special Committee's interim findings reported to EY on October 2, 2024, or the Special Committee's final findings,\" Super Micro reported.\n\nhttps://www.barrons.com/articles/smci-stock-super-micro-report-deadline-nasdaq-3775807f?siteid=yhoof2",
        "url": "https://www.reddit.com/r/stocks/comments/1iy7k0k/super_micro_surges_after_filing_delayed_reports/",
        "upVotes": 25,
        "upVoteRatio": 0.86
    },
    "comments": [
        {
            "id": "t1_mes7oa6",
            "username": "IntelligentPlate5051",
            "body": "How is this stock still allowed to trade?",
            "url": "https://www.reddit.com/r/stocks/comments/1iy7k0k/super_micro_surges_after_filing_delayed_reports/mes7oa6/",
            "upVotes": 16,
            "upVoteRatio": null
        },
        {
            "id": "t1_mes9mdk",
            "username": "any_hat",
            "body": "Significant cuts are being made to the SEC. Get ready to see a lot of companies getting away with fraud.",
            "url": "https://www.reddit.com/r/stocks/comments/1iy7k0k/super_micro_surges_after_filing_delayed_reports/mes9mdk/",
            "upVotes": 21,
            "upVoteRatio": null
        },
        {
            "id": "t1_mes9b04",
            "username": "LetsMoveHigher",
            "body": "Imagine insiders trading?  Look how many institutions pulled into this prior to the announcement...   \n\nU.S MARKETS ARE THE SCAM OF THE WORLD!\n\nWhat a shame",
            "url": "https://www.reddit.com/r/stocks/comments/1iy7k0k/super_micro_surges_after_filing_delayed_reports/mes9b04/",
            "upVotes": 6,
            "upVoteRatio": null
        },
        {
            "id": "t1_mesht8p",
            "username": "Guilty_Ad264",
            "body": "Retail pulled in as well, I know I did. CEO said he was confident they would file on time and I opted to believe him, as did many others",
            "url": "https://www.reddit.com/r/stocks/comments/1iy7k0k/super_micro_surges_after_filing_delayed_reports/mesht8p/",
            "upVotes": 5,
            "upVoteRatio": null
        }
    ]
}