{
    "post": {
        "id": "t3_1iy06sb",
        "category": "tech2",
        "query": "(Nvidia OR NVDA OR Amazon OR AMZN OR Meta OR META OR Facebook OR OpenAI OR Intel OR INTC)",
        "subreddit": "investing",
        "title": "Degiro Error Led To HMRC Investigation ( Rant )",
        "body": "So I'm just a regular guy, married with kids and back in 2021/22 I did a few trades buying and selling Amazon, Tesla etc ( few thousand ) and because of the currency conversion rates post COVID I sold and stopped investing, at least on Degiro.  \n\nWell today after coming home from work early to have some lunch in my little 3 bed home, HMRC turned up at my door claiming I owned tax on nearly a million pounds.  £876,300.41 to be exact.\n\nApparently Degiro contacted them to say I'd made overseas gains of that amount in 2022 and of course when HMRC found out they were on me like flies on 💩\n\nI now have to prove to them I didn't make that money all thanks to Degiro or risk losing my home. \n\nThis is more of a rant than anything, but be careful with any trading platform declaring your earnings to HMRC because you might end up like me being completely f'd over by their incompetence.  \n\nHas this happened to anyone else, it's the last thing I needed today..\n\n*Edit they said they've been sending letters but hadn't received a reply so it was escalated.  Just so other people are aware.  ",
        "url": "https://www.reddit.com/r/investing/comments/1iy06sb/degiro_error_led_to_hmrc_investigation_rant/",
        "upVotes": 2,
        "upVoteRatio": 0.67
    },
    "comments": [
        {
            "id": "t1_meqdvtj",
            "username": "Fair_Ad_7441",
            "body": "Would HMRC not send you a letter....",
            "url": "https://www.reddit.com/r/investing/comments/1iy06sb/degiro_error_led_to_hmrc_investigation_rant/meqdvtj/",
            "upVotes": 2,
            "upVoteRatio": null
        },
        {
            "id": "t1_meqeah4",
            "username": "Pleasant-Proposal-64",
            "body": "Apparently they had sent multiple letters and hadn't gotten a reply.  I've lived at this address 7 years and never got a letter about not paying tax, I pay my tax twice a year.",
            "url": "https://www.reddit.com/r/investing/comments/1iy06sb/degiro_error_led_to_hmrc_investigation_rant/meqeah4/",
            "upVotes": 1,
            "upVoteRatio": null
        }
    ]
}