{
    "post": {
        "id": "t3_1ixiugj",
        "category": "tech2",
        "query": "(Nvidia OR NVDA OR Amazon OR AMZN OR Meta OR META OR Facebook OR OpenAI OR Intel OR INTC)",
        "subreddit": "investing",
        "title": "What industries / companies will be durable in 20+ years?",
        "body": "I am a fan of the long term buy and hold strategy. If the markets high? I buy it. If there’s a dip? I buy even more.\n\nS&amp;P is great, and by being 50+% VOO and a mix of mag 7, I’ve had excellent returns since 2020. With that said, I’m a young investor (27m), and I’d like to plan more intelligently for the long term. \n\nWhat industries, or companies, do you all believe will be around and thriving 20-30+ years from now?\n\nFor me, I think the culture of “tech” companies will continue to be strong with their hyper efficiency, monopolistic power, and acquisitive nature. So amazon, google, meta and Microsoft, will continue to acquire competitors and dominate all aspects of American life for years to come imo, but there are also dominant monopoly-like players in Walmart and Costco which I also believe will continue to rise and do in the physical world what the tech giants can’t/won’t. In terms of “what we’ll always need” in food, water, shelter, I’m less familiar with players that have the same level of dominance and will last. \n\nI think energy is the crisis of our time, but I’m hesitant to bet on any individual company at this point. I’m not sure if others have insight, but I’d love to hear arguments not for what matters this year, but what will matter in the longest term.\n\nThanks in advance for any contributions.\n\n\n",
        "url": "https://www.reddit.com/r/investing/comments/1ixiugj/what_industries_companies_will_be_durable_in_20/",
        "upVotes": 52,
        "upVoteRatio": 0.85
    },
    "comments": [
        {
            "id": "t1_men43gx",
            "username": "nintendog-64",
            "body": "Unfortunately, I don’t see humans reducing consumption so garbage/waste disposal will be around forever. That’s why WM is a long term hold for me",
            "url": "https://www.reddit.com/r/investing/comments/1ixiugj/what_industries_companies_will_be_durable_in_20/men43gx/",
            "upVotes": 21,
            "upVoteRatio": null
        },
        {
            "id": "t1_meqowaq",
            "username": "HomerGymson",
            "body": "This would be a new pick for me, and I agree with the logic, thanks for the tip",
            "url": "https://www.reddit.com/r/investing/comments/1ixiugj/what_industries_companies_will_be_durable_in_20/meqowaq/",
            "upVotes": 3,
            "upVoteRatio": null
        },
        {
            "id": "t1_memmmaf",
            "username": "Florlawless",
            "body": "The most durable industries over the next 20–30 years will be tech (AI, cloud, semiconductors) with Microsoft, Google, Amazon, Meta, Nvidia leading, alongside Apple for consumer tech. Retail giants like Walmart and Costco will dominate physical commerce, while healthcare and biotech (UnitedHealth, Eli Lilly, Moderna) will thrive as populations age. Energy is a wildcard, but renewables (NextEra, Brookfield), electrification (Schneider Electric), and oil (Exxon, Chevron) will stay relevant. Defense and cybersecurity (Lockheed, Palantir, CrowdStrike) will grow due to global tensions, while water (American Water Works) and logistics (Prologis, Equinix) are essential. VOO remains a strong core, while QQQ offers tech growth, and SCHD/VIG provide dividend stability.\n\n\nEdit: The key is owning the disruptors and essentials, as they tend to consolidate power over time.",
            "url": "https://www.reddit.com/r/investing/comments/1ixiugj/what_industries_companies_will_be_durable_in_20/memmmaf/",
            "upVotes": 59,
            "upVoteRatio": null
        },
        {
            "id": "t1_meoji8w",
            "username": "BuzLightbeerOfBarCmd",
            "body": "Where did you get your crystal ball?",
            "url": "https://www.reddit.com/r/investing/comments/1ixiugj/what_industries_companies_will_be_durable_in_20/meoji8w/",
            "upVotes": 11,
            "upVoteRatio": null
        }
    ]
}