{
    "post": {
        "id": "t3_1iycoxa",
        "category": "tech1",
        "query": "(Apple OR AAPL OR Microsoft OR MSFT OR Google OR GOOG OR Alphabet OR GOOGL OR Tesla OR TSLA)",
        "subreddit": "stocks",
        "title": "Tesla’s market cap sinks below $1 trillion as stock slumps more than 8%",
        "body": "Tesla’s postelection pop has almost disappeared.\n\nShares of the electric vehicle maker plunged more than 8% on Tuesday, pushing the company’s market cap below $1 trillion and to its lowest since Nov. 7, which was two days after President Donald Trump’s election victory.\n\nThe stock has plummeted 25% to start the year, while the Nasdaq is down just 1.5%, and has slid more than 35% from its record close on Dec. 16. CEO Elon Musk has lost more than $100 billion in net worth over that stretch, though he is still the world’s richest person, with a fortune valued at about $380 billion.\n\nThe latest slide followed a report from Reuters on Monday that Tesla’s long-awaited upgrade to its partially automated driving systems left owners disappointed. Many users told the publication that Tesla’s “navigate on city streets” feature in China fell short of Musk’s promises for self-driving technology.\n\nOther EV makers in China, including BYD, offer their partially automated driving systems for free or a much lower cost. Xiaomi’s popular model SU7 includes the company’s equivalent technology as a standard option for free.\n\nThe report out of China added to anxiety among Tesla shareholders. Some of the concern has to do with the company’s performance and some is specific to Musk, who is spending much of his time in Washington, D.C., leading President Trump’s so-called Department of Government Efficiency, or DOGE.\n\nMusk, along with his team in Washington, has gained unparalleled access to government computer systems and taxpayer data, and the president has enabled the billionaire to lead mass firings of workers in agencies tasked with oversight of his companies, including Tesla.\n\nMusk’s extremist political rhetoric and activism has led opponents in various markets to organize protests, including at Tesla stores and service centers. Tesla’s stock dropped earlier this month on Trump’s announced plans for extensive tariffs on goods from Canada, Mexico and China, which came alongside a decline in Tesla vehicle registrations across Europe in January and February.\n\nFor the fourth quarter, Tesla reported earnings and sales that missed analysts’ estimates, with automotive revenue dropping 8% from a year earlier and operating income plummeting 23%. In the late January report, the company cited reduced average selling prices across its aging lineup of Model 3, Model Y, Model S and Model X vehicles as a major reason for the decline.\n\nAccording to the California New Car Dealers Association, Tesla sales dropped 11.6% in the fourth quarter of 2024 in the state, which had been Tesla’s biggest market domestically.\n\nTesla shares are now about 20% above where they were trading prior to Trump’s victory. Most of what remains of the rally is due to the stock’s 15% jump the day after the election. Musk was a major backer of Trump’s presidential effort, contributing $290 million to Republican candidates and causes in 2024, with most of that directed at returning Trump to the White House.\n\nSource: [https://www.cnbc.com/2025/02/25/teslas-market-cap-sinks-below-1-trillion-as-stock-falls-more-than-9percent.html](https://www.cnbc.com/2025/02/25/teslas-market-cap-sinks-below-1-trillion-as-stock-falls-more-than-9percent.html)",
        "url": "https://www.reddit.com/r/stocks/comments/1iycoxa/teslas_market_cap_sinks_below_1_trillion_as_stock/",
        "upVotes": 201,
        "upVoteRatio": 0.9
    },
    "comments": [
        {
            "id": "t1_metelft",
            "username": "Wizard_of_Rozz",
            "body": "Drive a wooden stake into the abomination",
            "url": "https://www.reddit.com/r/stocks/comments/1iycoxa/teslas_market_cap_sinks_below_1_trillion_as_stock/metelft/",
            "upVotes": 100,
            "upVoteRatio": null
        },
        {
            "id": "t1_metnvub",
            "username": "AccomplishedAngle2",
            "body": "Cast it into the fire",
            "url": "https://www.reddit.com/r/stocks/comments/1iycoxa/teslas_market_cap_sinks_below_1_trillion_as_stock/metnvub/",
            "upVotes": 1,
            "upVoteRatio": null
        },
        {
            "id": "t1_metgb6p",
            "username": "Educational-Tone2074",
            "body": "No one should buy cars from a nazi.",
            "url": "https://www.reddit.com/r/stocks/comments/1iycoxa/teslas_market_cap_sinks_below_1_trillion_as_stock/metgb6p/",
            "upVotes": 113,
            "upVoteRatio": null
        },
        {
            "id": "t1_meth5km",
            "username": "Narrow_Painting264",
            "body": "So no Volkswagen, BMW, or Mercedes.",
            "url": "https://www.reddit.com/r/stocks/comments/1iycoxa/teslas_market_cap_sinks_below_1_trillion_as_stock/meth5km/",
            "upVotes": -56,
            "upVoteRatio": null
        }
    ]
}