{
    "post": {
        "id": "t3_1iyyq9q",
        "category": "tech1",
        "query": "(Apple OR AAPL OR Microsoft OR MSFT OR Google OR GOOG OR Alphabet OR GOOGL OR Tesla OR TSLA)",
        "subreddit": "investing",
        "title": "Self managed traditional IRA account with many small positions",
        "body": "About a year ago, I took over my traditional IRA which had been professionally managed for a good while. It has a wide range of individual stocks like AAPL, AMD, AMZN, AVGO, AXP, BRKB, COST, CRM ... V, WBA, WMT (28 stocks and funds) for example, with share quantities ranging from 1 to 20+ for the individual stocks. Most, have really nice returns, but the quantity of each tends to be so small I question whether it would be wise to sell most and invest in a mix of SCHD, FXAIX, SCHG, FTEC, and FBGRX. I've already cleaned up a bunch of small quantity positions, but there are still a ton of them. I reinvested the proceeds into the funds above.\n\nWould it make sense to sell most of these remaining small positions and concentrate those funds in selected ETFs and MFs as mentioned above? I've pretty much settled other Roth and IRA accounts into a mix of S&amp;P 500, dividend ETFs, and growth funds. But this one account remains to be cleaned up and is worth around $135k-ish currently. \n\nI'm not generally a fan of bond funds, but do have about 6% in FXNAX. I've consolidated other stocks I sold into FXAIX and SCHD, about 27% and 29% respectively. And I put some in several growth funds too like FBGRX and FTEC, about 16% between them. So the remaining 20+ stocks comprise maybe 20-25% of the account. While I kinda like having BRKB, MSFT, NFLX, NVDA, META, etc., the share quantities are so low that I wonder if I would be better off selling them and reinvesting them in my core ETFs and MFs above. \n\nFor the record, our current income is from Social Security, RMDs, and my wife who will likely work for 6 to 8 more years. I've been retired for years. The majority of our funds are in different Roth and 403b Roth and 403b IRA accounts. The account in question above is a rollover from a job years ago.",
        "url": "https://www.reddit.com/r/investing/comments/1iyyq9q/self_managed_traditional_ira_account_with_many/",
        "upVotes": 1,
        "upVoteRatio": 1
    },
    "comments": [
        {
            "id": "t1_meyqczd",
            "username": "swooplordmcflex",
            "body": "Yes, that would be reasonable and recommended if you aren’t trying to closely follow news and info on a bunch of individual companies",
            "url": "https://www.reddit.com/r/investing/comments/1iyyq9q/self_managed_traditional_ira_account_with_many/meyqczd/",
            "upVotes": 1,
            "upVoteRatio": null
        },
        {
            "id": "t1_meyyfgq",
            "username": "speedlever",
            "body": "Thanks!",
            "url": "https://www.reddit.com/r/investing/comments/1iyyq9q/self_managed_traditional_ira_account_with_many/meyyfgq/",
            "upVotes": 1,
            "upVoteRatio": null
        }
    ]
}