{
    "headline": "Home Depot’s Q3 results top Wall Street as pullback in consumer spending eases a bit",
    "content": "Home Depot continued to deal with a pullback in spending from customers in its fiscal third quarter, but it was less severe than in the past, and its performance beat Wall Street’s expectations. The home improvement retailer also boosted its full-year revenue outlook. Revenue for the Atlanta-based company improved 6.6% to $40.22 billion in the quarter. That topped the $39.31 billion that analysts surveyed by FactSet predicted. Sales at stores open at least a year, a key gauge of a retailer’s health, slipped 1.3%. In the U.S., the figure fell 1.2%. Still, that’s a marked improvement from the second quarter, when sales at stores open at least a year declined 3.3% and dropped 3.6% in the U.S. Neil Saunders, managing director of GlobalData, was encouraged by some of the data. “Home Depot is still experiencing a modest revenue decline of 1.2% in its U.S. business. While this comes off the back of a decline in the prior year, it is the shallowest rate of decrease in two years and sends a positive signal that Home Depot may finally be reaching the bottom of its long sales slump and will soon pivot its core business back into growth,” he said in an emailed statement. Third-quarter customer transactions were nearly flat when compared with the prior-year period, while the amount shoppers spent declined slightly to $88.65 per average ticket from $89.36 a year earlier. Home improvement retailers like Home Depot have been dealing with homeowners putting off bigger projects due to higher rates and lingering concerns about inflation.  While mortgage rates have started to ease recently, the U.S. housing market has been in a sales slump dating back to 2022, when mortgage rates began to climb from pandemic-era lows. Last month the National Association of Realtors reported that existing home sales fell 1% in September, from August, to a seasonally adjusted annual rate of 3.84 million. That marked the second straight monthly decline and the slowest annual sales pace since October 2010 when the housing market was still in a deep slump following the late-2000s real estate crash. Home Depot Inc. earned $3.65 billion, or $3.67 per share, for the period ending Oct. 27. A year earlier, it earned $3.81 billion, or $3.81 per diluted share. Stripping out certain items, earnings were $3.78 per share. Wall Street was calling for $3.65 per share. “While macroeconomic uncertainty remains, our third-quarter performance exceeded our expectations,” Ted Decker, chair, president and CEO, said in a statement on Tuesday. “As weather normalized, we saw better engagement across seasonal goods and certain outdoor projects as well as incremental sales related to hurricane demand.” Home Depot now anticipates full-year revenue to rise about 4%. Its prior outlook was for revenue to be up 2.5% to 3.5%. The chain now foresees sales at stores open at least a year to be down about 2.5%. It previously forecast full-year sales at stores open at least a year would drop between 3% and 4% In addition, Home Depot predicts earnings per share will fall about 2% and adjusted earnings per share will decline approximately 1%. Its prior guidance was for earnings per share to fall between 2% and 4%. In premarket trading, Home Depot shares rose 2.5%."
}