{
    "headline": "Fed up with high prices? Here's where things stand with inflation",
    "content": "By the numbers, inflation in America continues in the same direction: Easing largely — but still sticky. Data out on Wednesday showed consumer prices last month increased 2.6% from a year ago. That was slightly higher than the 2.4% annual increase seen in September — but overall, inflation has still eased substantially from its peak in 2022. That should be good news, but it has been of little comfort to many Americans. That's because prices still remain substantially higher than they did before the pandemic — and that has left many voters frustrated, as the election this year made clear. Here's what to know about the state of inflation in America. Although inflation has eased, there are still things that hit the pocketbooks of many Americans. Housing is a big one. The index for housing costs — which broadly measures the rental market — continue to rise, as do some other essentials like medical care. But a few items saw price decreases, including gasoline prices. Prices may no longer be rising as much anymore — but they are still very high after months of increases. Those who said inflation was the most important factor in the election this year were almost twice as likely to support Donald J. Trump than Vice President Kamala Harris, according to a survey by the Associated Press . Counties with the most difficult housing markets showed the greatest median shifts toward Trump, according to an NBC News analysis . Loading... But it wasn't just Trump voters who are unhappy with high prices. Alex Spangler, 38, in Westminster, Colo., a suburb of Denver, voted for Harris though she's not impressed by either party. Spangler says she and her partner are struggling to save money because of how much they are paying for groceries and other necessities, which is leaving them with little cushion for emergencies. Spangler says even simple trips to the supermarket regularly cost her and her partner $20 to $50. \"We both make decent wages, but with the way that inflation has increased, it's like our dollar just doesn't go as far,\" says Spangler, who helps manage device launches for Boost Mobile. Spangler says she and her partner don't really buy \"anything extravagant\" or go out much because of how much they spend on groceries. \"Despite the fact that inflation has levelled out, the cost of goods rose and they've stayed there. So it still impacts our paychecks regularly,\" she says. And that has left Spangler disillusioned about the future. \"It's just honestly put a big damper on our prospects for the years to come,\" she says. On the campaign trail, Trump has promised to slash inflation and bring down prices. But many economists expect that inflation could go higher if Trump follows through on his economic policies. Trump has promised widespread tariffs which could lead to higher prices for consumers. Meanwhile his promises to cut taxes and deport undocumented immigrants could also help ignite more inflation. \"I think a lot of the policy proposals that have been touted, in general, point to a more inflationary direction,\" says Sarah House, a senior economist with Wells Fargo. Higher inflation could leave the Federal Reserve in a tough place . The Fed has started to cut interest rates since September in response to easing inflation — and economists still expect policy makers to continue cutting at its policy meeting next month. But the Fed may have to pause or reduce how much it cuts rates starting next year if Trump carries out his economic proposals and sparks more inflation. The leadership of the Fed is also in question. The term of the current Fed Chair Jerome Powell ends in 2026, and Trump could choose to replace him, given their antagonistic relationship during the president-elect's first term."
}