{
    "headline": "Dutch appeals court overturns landmark climate ruling against Shell",
    "content": "THE HAGUE, Netherlands — A Dutch appeals court on Tuesday overturned a landmark ruling that ordered energy company Shell to cut its carbon emissions by net 45% by 2030 compared to 2019 levels, while saying that \"protection against dangerous climate change is a human right.\"The decision was a defeat for the Dutch arm of Friends of the Earth and other environmental groups, which had hailed the original 2021 ruling as a victory for the climate. Tuesday's civil ruling can be appealed to the Dutch Supreme Court.\"This hurts,\" Friends of the Earth director in the Netherlands Donald Pols said. \"At the same time, we see that this case has ensured that major polluters are not immune and has further stimulated the debate about their responsibility in combating dangerous climate change. That is why we continue to tackle major polluters, such as Shell.\"Outside court, Pols said the fight against climate change \"is a marathon, not a sprint, and the race has just begun.\"The ruling upholding Shell's appeal came as a 12-day U.N. climate conference was entering its second day in Azerbaijan where countries are discussing how to fund cutting planet-warming emissions and adapt to ever-increasing weather extremes.It marked a stinging defeat for climate activists after several courtroom victories. A court in The Hague in 2015 ordered the government to cut emissions by at least 25% by the end of 2020 from benchmark 1990 levels. The Dutch Supreme Court upheld the ruling five years ago.Earlier this year, a U.N. tribunal on maritime law said that countries are legally required to reduce greenhouse gas pollution. The International Tribunal for the Law of the Sea found that carbon emissions qualify as marine pollution and said that countries must take steps to mitigate and adapt to their adverse effects.And in April, Europe's highest human rights court ruled that countries must better protect their people from the consequences of climate change.In December the top U.N. legal body, the International Court of Justice, is holding public hearings on climate change after the world body requested a nonbinding advisory opinion on \"the obligations of States in respect of climate change.\" Dozens of countries are set to present arguments at two weeks of hearings.In a written summary of Tuesday's ruling, the court said that Shell has a duty of care to limit its emissions, but it annulled the lower court's decision because it was \"unable to establish that the social standard of care entails an obligation for Shell to reduce its CO2 emissions by 45%, or some other percentage.\"There is currently insufficient consensus in climate science on a specific reduction percentage to which an individual company like Shell should adhere.\"Shell has emitted 36,528 million tons of carbon dioxide, or CO2, since 1854, which is 2.1% of global emissions, according to an April report by the Carbon Majors Database.Presiding Judge Carla Joustra said that Shell already has targets for climate-warming carbon emissions that are in line with demands of Friends of the Earth — both for what it directly produces and for emissions produced by energy the company purchase from others.The court then ruled that \"for Shell to reduce CO2 emissions caused by buyers of Shell products ... by a particular percentage would be ineffective in this case. Shell could meet that obligation by ceasing to trade in the fuels it purchases from third parties. Other companies would then take over that trade.\"Joustra said that, \"The court's final judgment is that Friends of the Earth's claims cannot be granted. The court therefore annuls the district court's judgment.\"Climate activists sitting outside on the courthouse steps hugged, and some appeared close to tears after the decision.\"To be honest I was just really disappointed,\" Neele Boelens said. \"I was almost crying. I was in there in the court and it was just like... At first it looked really good for us but then it just went down hill.\"Shell, meanwhile, welcomed the ruling.\"We are pleased with the court's decision, which we believe is the right one for the global energy transition, the Netherlands and our company,\" Shell plc Chief Executive Officer Wael Sawan said in a written statement. \"Our target to become a net-zero emissions energy business by 2050 remains at the heart of Shell's strategy and is transforming our business.\""
}