{
    "headline": "Why Canada could become the next nuclear energy 'superpower'",
    "content": "Uranium is making a comeback thanks to a renewed focus on nuclear energy as a climate crisis solution. Canada, rich with high-grade deposits, could become a nuclear “superpower”. But can its potential be realised? Leigh Curyer had been working in uranium mining for nearly two decades when he noticed a striking shift. In 2011, the Fukushima nuclear plant disaster in Japan badly damaged the world's view of nuclear power, and the price for the heavy metal - a critical component for nuclear fuel - cratered. But the last five years has seen a reversal, with the global price of uranium spiking by more than 200%one of this year's top-performing commodities. Mr Curyer, an Australian-born businessman, credits this to a changing attitude that began soon after Microsoft founder Bill Gates touted nuclear energy as “ideal for dealing with climate change” in 2018. Four years later, then- UK Prime Minister Boris Johnson pushed forward a policy of generating at least 25% of the country’s energy from nuclear. Shortly after, the European Union voted to declare nuclear energy climate-friendly. These events were “catalytic” for the uranium industry and a turning point for Mr Curyer's company NexGen, which is behind the largest in-development uranium mine in Canada. His phone began to ring with calls from investors worldwide - something that “had never happened in my previous 17 years in the industry”, he said. NexGen, whose project is located in Canada's remote, uranium-rich Athabasca Basin in northern Saskatchewan, is now worth nearly $4bn (£2.98bn), despite the fact that the mine won’t be commercially operational until at least 2028. If fully cleared by regulators, NexGen’s project alone could push Canada to become the world’s largest producer of uranium over the coming decade, knocking Kazakhstan out of the number one spot. Other companies have also rushed to Saskatchewan to capitalise on the boom, starting their own exploration projects in the region, while existing players re-opened dormant mines. With its rich resources, Canada’s mining companies see the country playing a major role in the future of nuclear energy, meeting a demand for uranium that is poised to rise after nearly two dozen countries committed in COP28 climate conference to tripling their nuclear energy output by 2050. Nuclear energy is often hailed for its low carbon emissions compared to other sources like natural gas or coal. The World Nuclear Association estimates that 10% of power generated worldwide comes from nuclear sources, while more than 50% is still generated by gas or coal. At this year's COP29, the focus has been on ramping up funding for nuclear projects in the wake of a recent UN report indicating that current policies and investments fall short of what is needed to slow global temperature rise. Canada’s role in supplying the commodity is made more urgent by Russia’s invasion of Ukraine, particularly for the US, which had relied heavily on Russian-supplied enriched uranium to fire up its commercial nuclear reactors. Mr Curyer believes his mine could prove to be “absolutely critical” to America’s nuclear energy future, as the US is now hunting for alternatives to Russia, including by ramping up exploration on its own soil. Uranium can be found around the world, though it is heavily present in Canada, Australia and Kazakhstan. But what makes Canada’s Athabasca Region unique is that its uranium is especially high grade, said Markus Piro, a professor of nuclear engineering at McMaster University. Canada has set strict rules for the sale of its uranium to other countries, Prof Piro said, and mandates it only be used for nuclear power generation. The country is also referred to as a “tier-one nuclear nation”, he said, due to its capability to produce nuclear fuel from the mining to the manufacturing stage. Once mined, uranium is milled to produce what is called calcined yellowcake, and then enriched, either at facilities in Canada or overseas, to create fuel for nuclear reactors. “We’ve got a one-stop shop here in Canada, not every nation’s like that,” Prof Piro said. Canada is currently the world’s second largest producer of uranium, accounting for roughly 13% of the total global output, according to the Canadian government. NexGen anticipates that once its mine is operational, it will boost that to 25%. Meanwhile, Cameco, which has been mining uranium in Saskatchewan since 1988 that supplies 30 nuclear reactors around the world, re-opened two of its mines in late 2022 to increase output. CEO Tim Gitzel told the BBC that he believes “Canada could be a nuclear superpower around the world”. But enthusiasm around nuclear energy is not without its critics. Some environmental groups worry nuclear projects are too costly and come with timelines that do not meet the urgency of the climate crisis. Data from the UK-based World Nuclear Association shows that 60 nuclear reactors are under construction across 16 countries, most of them in China, and a further 110 are in the planning stages. Some are expected to come online this year - others won’t be ready until at least the end of the decade. Meanwhile, more than 100 nuclear plants have been closed in the last two decades around the world, including New York State’s sole nuclear power plant, which was retired in 2021 due to high operating costs and environmental and safety concerns. Plants were also shuttered in Massachusetts, Pennsylvania, and Quebec, Canada. And not all of Canada is on board with the country’s uranium industry. British Columbia sits on its own supply of uranium but has not allowed any nuclear plants or uranium mines to operate in the province since 1980. Critics have also expressed concern about radioactive waste nuclear reactors leave behind for future generations. Others fear another Fukushima-scale disaster , where a tsunami disabled three reactors, causing the release of highly radioactive materials and forcing mass evacuations. “The risk is not zero, that is for sure” though t can be reduced, said Prof Piro. “Even though amongst the general public there are mixed feelings about it, the reality is that it has produced very safe, very reliable and affordable electricity worldwide.” The industry maintains the technology is both promising and viable. Mr Gitzel of Cameco said the industry has learned from past safety errors. “And the public is buying on,” he said. “I can tell you that we have in Canada great public support for nuclear power.” A 2023 Ipsos poll indicates that 55% of Canadians support nuclear energy. Still, past uranium booms in Canada have turned into dramatic busts. North of NexGen’s proposed mine stands Uranium City, once home to 2,500 residents in its mid-20th Century heyday. In 1982, a major local mining firm shuttered operations over high costs and a soft market for uranium. Now, Uranium City’s population is 91 people. But investors argue that there is a true global burgeoning demand for the commodity that poses a golden opportunity for Canada. NexGen anticipates that construction on its mine - which is awaiting clearance from Canada’s federal nuclear regulator - will begin early next year. Mr Gitzel says around 100 other companies are now actively exploring Saskatchewan for deposits. As to when it will be on the market remains unclear. Mr Gitzel cautioned that some companies have started explorations in the past that never reached production stage. The timeline to get mining projects approved in Canada can also be lengthy. “Building a mine is going to take five to 10 years, and so far, the only ones in operation are ours, so we will wait and see how it plays out,” he said. For Mr Curyer, it is crucial that his project and others are realised in the next four years, for both Canada and the world. “Otherwise, there is going to be a shortage in uranium, and that will subsequently impact power prices,” he said."
}