[
    {
        "url": "https://apnews.com/article/nyt-openai-copyright-lawsuit-chatgpt-cc19ef2cf3f23343738e892b60d6d7a6",
        "source": "ap_news",
        "headline": "Judge allows newspaper copyright lawsuit against OpenAI to proceed",
        "content": "NEW YORK (AP) — A federal judge has ruled that The New York Times and other newspapers can proceed with a copyright lawsuit against OpenAI and Microsoft seeking to end the practice of using their stories to train artificial intelligence chatbots. U.S. District Judge Sidney Stein of New York on Wednesday dismissed some of the claims made by media organizations but allowed the bulk of the case to continue, possibly to a jury trial. “We appreciate Judge Stein’s careful consideration of these issues,” New York Times attorney Ian Crosby said in a statement. “As the order indicates, all of our copyright claims will continue against Microsoft and Open AI for their widespread theft of millions of The Times’s works, and we look forward to continuing to pursue them.” The judge’s ruling also pleased Frank Pine, executive editor of MediaNews Group and Tribune Publishing, owners of some of the newspapers that are part of a consolidated lawsuit in a Manhattan court. “The claims the court has dismissed do not undermine the main thrust of our case, which is that these companies have stolen our work and violated our copyright in a way that fundamentally damages our business,” Pine said a statement. Stein didn’t explain the reasons for his ruling, saying that would come “expeditiously.” OpenAI said in a statement it welcomed “the court’s dismissal of many of these claims and look forward to making it clear that we build our AI models using publicly available data, in a manner grounded in fair use, and supportive of innovation.”  Microsoft declined to comment. The Times has said OpenAI and its business partner Microsoft have threatened its livelihood by effectively stealing billions of dollars worth of work by its journalists, in some cases spitting out Times’ material verbatim to people who seek answers from generative artificial intelligence like OpenAI’s ChatGPT. ————— The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "summary": "A federal judge has allowed a copyright lawsuit filed by The New York Times and other newspapers against OpenAI and Microsoft to proceed, alleging the unauthorized use of their stories to train AI chatbots. The judge dismissed some claims but permitted the majority of the case to move forward, potentially to a jury trial. OpenAI and Microsoft are accused of widespread theft of media works, with OpenAI defending its AI model training practices as fair use and innovation-focused.",
        "sentiment": {
            "company": "openai",
            "score": -0.5
        },
        "tags": [
            "microsoft",
            "openai"
        ],
        "timestamp": "2025-03-26 19:59:45",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-privacy-echo-7fb3c19fa7f664bde5c5be259f8b23ee",
        "source": "ap_news",
        "headline": "Amazon ends little-used privacy feature that let Echo users opt out of sending recordings to company",
        "content": "Amazon is ending a little-used privacy feature that let some users of its Echo smart speaker prevent their voice commands from going to the company’s cloud. Beginning on March 28, Amazon is ending the “Do Not Send Voice Recordings” option that kept audio from being sent to Amazon’s cloud and had it process locally on the device instead. In an email sent to customers who’d been using the option, Amazon said it made the decision to “no longer support this feature” as it expands Alexa’s capabilities with generative artificial intelligence features that rely on being processed in the cloud. While the change may sound alarming to some privacy-minded users, it was not widely used or available. It only worked on three devices: the 4th generation Echo Dot, the Echo Show 10 and the Echo Show 15 — and only for customers in the U.S. with devices set to English. Amazon said less than 0.03% of customers use it. People still have the option to prevent Alexa from saving voice recordings. Those who’d been using the “Do Not Send” feature as of March 28 will automatically be opted into the “Don’t save recordings” option, Amazon said. “The Alexa experience is designed to protect our customers’ privacy and keep their data secure, and that’s not changing. We’re focusing on the privacy tools and controls that our customers use most and work well with generative AI experiences that rely on the processing power of Amazon’s secure cloud,” Amazon said in a statement.",
        "summary": "Amazon is discontinuing a little-used privacy feature that allowed Echo users to prevent their voice recordings from being sent to Amazon's cloud. The feature, \"Do Not Send Voice Recordings,\" will be replaced with an option to not save recordings automatically. Amazon stated that this change is to support Alexa's generative artificial intelligence features that require cloud processing.",
        "sentiment": {
            "company": "amazon",
            "score": 0.2
        },
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-19 18:39:33",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/france-meta-artificial-intelligence-lawsuit-copyright-168b32059e70d0509b0a6ac407f37e8a",
        "source": "ap_news",
        "headline": "French publishers and authors sue Meta over copyright works used in AI training",
        "content": "French publishers and authors said Wednesday they’re taking Meta to court, accusing the social media company of using their works without permission to train its artificial intelligence model. Three trade groups said they were launching legal action against Meta in a Paris court over what they said was the company’s “massive use of copyrighted works without authorization” to train its generative AI model. The National Publishing Union, which represents book publishers, has noted that “numerous works” from its members are turning up in Meta’s data pool, the group’s president, Vincent Montagne, said in a joint statement. Meta didn’t respond to a request for comment. The company has rolled out generative-AI powered chatbot assistants to users of its Facebook, Instagram and WhatsApp platforms. Montagne accused Meta of “noncompliance with copyright and parasitism.” Another group, the National Union of Authors and Composers, which represents 700 writers, playwrights and composers, said the lawsuit was necessary to protect members from “AI which plunders their works and cultural heritage to train itself.” The union is also worried about AI that “produces ‘fake books’ which compete with real books,” the union’s president, Francois Peyrony, said. The third group involved in the lawsuit, the Societe des Gens de Lettres, represents authors. They all demand the “complete removal” of data directories Meta created without authorization to to train its AI model.  Under the European Union’s sweeping Artificial Intelligence Act, generative AI systems must comply with the 27-nation bloc’s copyright law and be transparent about the material they used for training. It’s the latest example of the clash between the creative and publishing industries and tech companies over data and copyright. British musicians released asilent albumlast month to protest the U.K. government’s proposed changes toartificial intelligencelaws thatartists fearwill erode their creative control. Media and technology company Thomson Reuters recently won a legal battle against a now-defunct legal research firm over the question offair usein AI-related copyright cases, while other cases involving visual artists, news organizations and others are still working through U.S. courts.",
        "summary": "French publishers and authors are suing Meta for allegedly using their copyrighted works without permission to train its AI model. Three trade groups are taking legal action in a Paris court, accusing Meta of massive unauthorized use of copyrighted works. The National Publishing Union and the National Union of Authors and Composers are concerned about Meta's generative AI model producing \"fake books\" that compete with real works. The lawsuit demands the complete removal of data directories created by Meta for AI training, citing noncompliance with copyright laws and parasitism.",
        "sentiment": {
            "company": "meta",
            "score": -0.8
        },
        "tags": [
            "meta"
        ],
        "timestamp": "2025-03-12 09:57:46",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/indycar-openai-ganassi-altman-7068d7785e20d8db37a7c8153b2caa20",
        "source": "ap_news",
        "headline": "Chip Ganassi Racing partners with OpenAI in first motorsports venture for AI company",
        "content": "ST. PETERSBURG, Fla. (AP) — Chip Ganassi Racing on Friday said it has partnered on a strategic research collaboration with OpenAI — a deal that makes the two-time reigning IndyCar championship winning team the first to bring in a partner from the artificial intelligence field. It is also OpenAI’s first collaboration in motorsports. “Racing has always been a proving ground for innovation, and we’re excited to explore how our AI technology can contribute alongside the incredible talent at Chip Ganassi Racing,” said Sam Altman, the CEO of OpenAI. “IndyCar is a sport where every detail counts, and we’re eager to see how advanced technology can support the team’s expertise in pushing performance forward.” Ganassi’s race teams plan to utilize OpenAI’s artificial intelligence technology to maximize performance on the racetrack and in the front office by using the company’s software engineering and research capabilities. Ganassi teams will work with OpenAI’s engineers. “Over the years, we have had the good fortune of partnering with some of the most iconic brands in the world, but I am not sure there is one that is more important right now than OpenAI,” Ganassi said. “Sam and his team have been amazing at helping us try to maximize the power of artificial intelligence to make us better both on and off the racetrack. We look forward to continuing to attack business and racing challenges with the folks at OpenAI, some of the smartest and most creative people around.” AP auto racing:https://apnews.com/hub/auto-racing",
        "summary": "Chip Ganassi Racing has partnered with OpenAI in a strategic research collaboration, marking OpenAI's first venture into motorsports. OpenAI's CEO, Sam Altman, expressed excitement about exploring how AI technology can enhance performance in IndyCar racing. Ganassi Racing plans to leverage OpenAI's artificial intelligence technology to improve performance both on the racetrack and in the front office.",
        "sentiment": {
            "company": "openai",
            "score": 0.8
        },
        "tags": [
            "openai"
        ],
        "timestamp": "2025-02-28 17:14:27",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/frank-founder-charlie-javice-trial-f9c0522873272274042d8869d659cb09",
        "source": "ap_news",
        "headline": "In closing remarks, prosecutor says Frank founder lied to JPMorgan Chase to secure $175 million deal",
        "content": "NEW YORK (AP) — The young chief executive of a startup thatclaimed to have helpedmillions of college students apply for financial aid deployed a “brazen fraud” to sell the company to JPMorgan Chase & Co. for $175 million, a prosecutor said Wednesday in a closing argument to a jury in New York. Charlie Javice, who appeared onForbes’ “30 Under 30” list in 2019, is accused of dramatically exaggerating the customer base of her company, which operated under the name Frank. She and another former top executive faceconspiracy and fraud charges. Javice’s lawyer, Jose Baez, urged the jury to acquit his 32-year-old client, calling the case against her “incredibly flawed.” He cited a lack of evidence. As he spoke, Javice smiled at times and turned her chair to face the jury. Frank was created to simplify filling out the Free Application for Federal Student Aid, a complex government form used by students to apply for financial aid for college or graduate school. Javice founded the company when she was in her mid-20s and was the subject of numerous media profiles that lauded her for building a system that would help financially needy students navigate a thicket of rules and eligibility requirements to get tuition aid. The company once seemed like a pioneer among businesses that cater to college-age students, who banks encourage to open checking or credit card accounts in the hopes they’ll become lifelong customers.  Access to Frank’s client list is one of the things JPMorgan Chase was after when it entered into talks to buy the company in 2021. At the time, Javice was claiming Frank had over 4.25 million clients. In reality, it had around 400,000, Assistant U.S. Attorney Nicholas Chiuchiolo told the jury. Citing emails, text messages and other evidence, Chiuchiolo said Javice repeatedly lied to JPMorgan in the summer of 2021 to secure a buyout that would earn her $45 million. When JPMorgan Chase sought to verify the client list, Javice first approached her company’s head of engineering, asking if he could produce “synthetic data” to show the company had over 4 million customers, the prosecutor said. But the employee refused, saying he “would not do anything illegal,” Chiuchiolo said. Javice eventually hired an outside data scientist for $105,000 to create a data set showing over 4.2 million students, prosecutors said. Javice did not testify during the five-week trial. The Miami Beach, Florida, resident wasarrested in April 2023and is free on bail. The jury was expected to begin deliberations Thursday.",
        "summary": "Prosecutors accused the CEO of startup Frank of committing fraud by exaggerating the company's customer base to secure a $175 million deal with JPMorgan Chase. The CEO, Charlie Javice, is facing conspiracy and fraud charges, with the prosecution claiming she misled JPMorgan about having over 4.25 million clients when the actual number was around 400,000. Javice's defense argued that the case against her is flawed due to a lack of evidence. JPMorgan Chase was interested in Frank for its client list, but the discrepancies in client numbers have raised concerns.",
        "sentiment": {
            "company": "jp_morgan",
            "score": -0.8
        },
        "tags": [
            "jp_morgan"
        ],
        "timestamp": "2025-03-26 17:41:26",
        "headline_tags": [
            "jp_morgan"
        ]
    },
    {
        "url": "https://apnews.com/article/tesla-sales-recall-trump-byd-b6f5da15be491d16e3020598e3ddf861",
        "source": "ap_news",
        "headline": "Tesla sales fall by 49% in Europe even as the electric vehicle market grows",
        "content": "FRANKFURT, Germany (AP) — European sales of Tesla electric vehicles tumbled 49% in the first two months of the year compared with a year earlier even as overall sales of EVs grew, according to the European Automobile Manufacturers’ Association. There have been complaints about an aging lineup of vehicles from Tesla and also a significant backlash against CEO Elon Musk and hisaffiliation with the Trump administrationin the U.S. In Europe, Musk’sendorsement of Germany’s far-rightAlternative for Germany party in last month’s national electiondrew broad condemnation. Tesla faces increasing competition from major automakers as they ramp up EV production, including China’s BYD. On Tuesday, BYDreported a record777.1 billion yuan ($107 billion) in revenue for 2024 as sales of its electric and hybrid vehicles jumped 40%. Earlier this month, BYD announced anultra fast EV charging systemthat it says is nearly as quick as a fill up at the gas pump. Tesla sales for January and February slumped to 19,046 from 37,311 in the same period in 2024. That comes against the background of a 28.4% increase in sales of all battery-electric cars in Europe. German politicians and opinion media sharply criticized Musk over his support for the AfD, while Tesla vehicles and dealerships have been thetarget of protesters in the U.S. and Europeover the AfD endorsement and his role advising U.S. President Donald Trump in drastically reducing the size of the US federal government.  Tesla sales are falling globally, however. The company posted itsfirst annual sales dropin more than a dozen years in January. Tesla’s new Cybertruck has had multiple recalls including last week, when the company recalled nearly all of them because panels that run along the left and right side of the windshield can fly off when driving. It was the eighth recall of the Cybertruck since deliveries to customers began just over a year ago.",
        "summary": "Tesla's sales in Europe dropped by 49% in the first two months of the year, despite overall growth in the EV market. The decline is attributed to complaints about an aging vehicle lineup, backlash against CEO Elon Musk's affiliations, and increasing competition from other automakers like BYD. Tesla also faced criticism in Europe for Musk's endorsement of Germany's far-right party. Globally, Tesla's sales are falling, with the company experiencing its first annual sales drop in over a decade and facing issues with its Cybertruck recalls.",
        "sentiment": {
            "company": "tesla",
            "score": -0.7
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25 09:47:48",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/nhl-front-office-app-49b2f0421df504555bbc940bb861e4a2",
        "source": "ap_news",
        "headline": "NHL launches a front office iPad app to modernize roster, contract and salary cap info for teams",
        "content": "MANALAPAN, Fla. (AP) — The NHL has launched a front office app that modernizes the league’s roster, contract and salary cap information. The league worked with SAP to develop an app for Apple iPads that streamlines Central Registry data, cap and long-term injury status and no-trade and no-move clauses and lays it all out for general managers and league executives to access at their fingertips for the first time. Announced Thursday, GMs have been trying it out since late December. “Instead of traveling with a booklet of heavy — it looks like a magazine or a Bible, almost — having everything in one place on an iPad I think will just alleviate and make it easier and simpler to log on and check the status and sometimes your roster and how you can make transactions and stuff like that,” Philadelphia Flyers GM Daniel Briere told The Associated Press this week. The development comes eight years sincethe NHL put iPads in coaches’ and players’ handson benches during games. The hope is it will be used just as frequently to figure out trades, free agent signings and other moves. “The on-bench coaching app that we built together, that is a part of the game every single day and it’s built in a robust way that it can be part of the game every single day,” NHL chief operating officer Stephen McArdle said. “We’ve sort of done groundbreaking work on the coaching side. We’ve done groundbreaking work on the fan side with a lot of the statistical data that was powered many years ago by SAP when we re-did that (NHL.com stats) site, and now this is sort of the third leg of the stool with roster information.” Longtime hockey executive Don Waddell, in his first season as GM of the Columbus Blue Jackets, said it’s convenient to have “something to refer to quickly where you’re always asking those questions” about no-trade clauses and the like.  “And with any new app, it’s only going to continue to get better, so we’re excited about it,” Waddell said. “But I think the features that they’re offering right now is certainly something that we’re all going to be able to utilize.” The initial release of the SAP-NHL Front Office App is made up of three sections: — League view, which provides a high-level display of each team’s current and projected offseason cap situation, alerts for daily transactions with custom filters and a player watch list and draft grid of future picks with details on how they changed hands and conditions on selections. — Team view, which offers contract information for each player in the organization for the current season and the next eight. — Player view, which includes biographical information, contract details and PDFs, game logs and transaction history. McArdle said the idea was a result of the technology available combined with the needs expressed from organizations around the league. SAP VP of Global Sponsorships Dan Fleetwood pointed to the coaching app as the necessary first step to make this possible — and potentially speed up player movement around NHL. “It’s that type of a foundation that you need to really kind of grow and do something,” Fleetwood said. “We hope that it does power more trades or give people the ability to manipulate their rosters better.” In the aftermath of theWashington Capitals buyingand shuttering the popular CapFriendly site to make that their proprietary in-house data, places like PuckPedia and CapWages have emerged to fill the void for fans who at one point used CapGeek to look up or reimagine rosters. This app is for teams and teams only and expected to eventually be available on iPhone, but there is no plan to offer a version for the general public. “We’re currently focused on super-serving the clubs in the front office,” McArdle said. “There is so much information in this version that we think it is most appropriate for the front offices and for the clubs. Down the road, who knows, but right now it’s not our focus.” AP NHL:https://apnews.com/hub/nhl",
        "summary": "The NHL has launched a front office app in collaboration with SAP for Apple iPads to streamline roster, contract, and salary cap information for general managers and league executives. This app aims to provide easy access to essential data, replacing the need for physical booklets or documents. The initiative follows the NHL's previous introduction of iPads for coaches and players during games, with the goal of enhancing decision-making processes related to trades and signings.",
        "sentiment": {
            "company": "apple",
            "score": 0.6
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-20 09:25:50",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-sues-cpsc-product-recalls-cbc117a5cc2c322bded2b3b93736121e",
        "source": "ap_news",
        "headline": "Amazon sues Consumer Product Safety Commission over recall order for hazardous products",
        "content": "NEW YORK (AP) —Amazonhas sued the U.S. Consumer Product Safety Commission for finding the e-commerce giantlegally responsiblefor the recalls of hundreds of thousands of products sold on its site. The independent federal agency ordered Amazon in January to take several actions, including notifying customers who bought more than 400,000 items covered by recalls and giving refunds to those who could prove the products were properly disposed of or destroyed. The order followed the commission’s unanimous determination last summer that Amazon was a “distributor” of faulty items sold on its website by third-party sellers and shipped through the company’s fulfillment service But Amazon has long disputed it qualifies as a “distributor” of products offered by other sellers. In its lawsuit filed on March 14, the company maintained it serves as a “third-party logistics provider” and therefore should not be held liable for recalls of products that were made, owned and sold by others. The commission sued Amazon in 2021 for allegedlydistributing hazardous items, accusing the company of puttingconsumer safetyat risk by failing to properly notify the public about recalled products that included defective carbon monoxide detectors and flammable children’s pajamas. Amazon said in its lawsuit that it issued previous recall notices and some refunds shortly after the CPSC raised safety concerns several years ago. The company argues the commission is an “unconstitutionally structured agency” that overstepped its authority with the new directive.  “The remedies ordered by the CPSC are largely duplicative of the steps we took several years ago to protect customers, which are the same steps we take whenever we learn about unsafe products,” Amazon said in a statement sent to The Associated Press. The Seattle-based company said it could not comment further on its lawsuit filed last week. Amazon and Elon Musk’s SpaceXalso have active lawsuits challenging the structure of the National Labor Relations Board as unconstitutional. Thetwo companies initiatedthe cases after the labor agency filed complaints against them in disputes about workers’ rights and union organizing. The Consumer Product Safety Commission declined to comment Wednesday on Amazon’s lawsuit complaint. In a Jan. 17 statement about the hazardous products order, Commissioner Richard L. Trumka Jr. said it was the CPSC’s job to “hold companies like Amazon accountable” and “no company is above the law.”",
        "summary": "Amazon has sued the U.S. Consumer Product Safety Commission over a recall order for hazardous products, arguing that it should not be held liable for recalls of products made and sold by others on its platform. The commission had ordered Amazon to take actions related to notifying customers and providing refunds for recalled items. Amazon contends that it is a third-party logistics provider, not a distributor of products, and had taken steps in the past to protect customers from unsafe products.",
        "sentiment": {
            "company": "amazon",
            "score": 0.2
        },
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-19 18:52:32",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/meta-careless-people-bestseller-zuckerberg-bd010d09d5cfe5a4ff7dfd5419a56aa4",
        "source": "ap_news",
        "headline": "Controversial insider account by former Meta official has strong first-week sales",
        "content": "NEW YORK (AP) — A former Meta official’sexplosive insider accountsold 60,000 copies in its first week and reached the top 10 on Amazon.com’s best-seller list amid efforts by thesocial media giantto discredit the book. Released last week byFlatiron Books, a Macmillan imprint, Sarah Wynn-Williams’ “Careless People” alleges cruel and otherwise disturbing behavior byMark Zuckerberg,Joel Kaplan and other executives and describes Zuckerberg’s alleged efforts to win favor with Chinese officials. Meta has countered that Wynn-Williams, a former director of global public policy who left what was then Facebook in 2017, violated a severance agreement and wrote a book filled with inaccuracies. According to Flatiron, first week sales include print audio and digital editions. On Wednesday, “Careless People” ranked No. 3 on Amazon. In response to a complaint filed by Meta, emergency arbitrator Nicholas A. Gowen last week placed a hold on Wynn-Williams’ promoting the book or making further “critical claims” about her former employer. In his ruling, Gowen wrote that Meta had “established a likelihood of success on the merits of its contractual non-disparagement claim” against Wynn-Williams. Flatiron can still publish and promote “Careless People.” A statement from Meta praised the arbitrator’s decision, saying it “affirms that Sarah Wynn Williams’ false and defamatory book should never have been published.” Meta has otherwise called “Careless People” a “mix of out-of-date and previously reported claims about the company and false accusations about our executives.” Flatiron also issued a statement, saying it “was appalled by Meta’s tactics to silence our author through the use of a non-disparagement clause in a severance agreement.” The publisher added that the arbitrator had not addressed the allegations made by Wynn-Williams.  “The book went through a thorough editing and vetting process, and we remain committed to publishing important books such as this. We will absolutely continue to support and promote it,” the statement reads. Flatiron did not announce the book until just days before its release. Meta’s response has included queries to media outlets, among them The Associated Press, over their plans for coverage. Washington Post critic Ron Charles wrote last week that he had received repeated messages from Meta. “In my 27 years of reviewing and editing newspaper books sections, no company has ever done this with me,” he noted.",
        "summary": "A former Meta official's book, \"Careless People,\" alleging disturbing behavior by Mark Zuckerberg and other executives, sold 60,000 copies in its first week, reaching the top 10 on Amazon's best-seller list. Meta has tried to discredit the book, claiming inaccuracies and violation of a severance agreement. An emergency arbitrator placed restrictions on the author from making further critical claims about Meta, but the publisher can still promote the book.",
        "sentiment": {
            "company": "meta",
            "score": -0.7
        },
        "tags": [
            "meta"
        ],
        "timestamp": "2025-03-19 16:27:46",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-google-brussels-european-union-internet-8f1c2f1fda1d3ffeed50322df8093817",
        "source": "ap_news",
        "headline": "European Union lays out how Apple must open its tech up to competitors under bloc’s digital rules",
        "content": "LONDON (AP) — The European Union on Wednesday outlined the steps that Apple must take to open up its iPhone and iPad operating systems to work better with competing technologies. It’s the first time the EU has moved to compel a technology company to comply with the bloc’s digital Digital Markets Act — a wide-ranging set of regulations designed to prevent Big Tech “gatekeeper” companies from cornering markets. After the DMA took effect a year ago, the EU’s executive Commission moved swiftly toopen a raft of investigationsinto Big Tech companies. Brussels also opened two “specification proceedings” in September to spell out what Apple needs to do under the DMA, which aims to make digital markets “fairer” and “more contestable” by breaking up closed tech ecosystems that lock consumers into a single company’s products or services. In its legally binding decision, the commission detailed measures that the iPhone maker has to take involving nine connectivity features for its iOS operating system. The measures will give device and app makers better access to iPhone features that work with devices. For example, iPhone users will have “enhanced possibilities” to receive notifications on non-Apple smartwatches, including receiving pictures and the ability to reply to them. Users could also benefit from more seamless pairing of wireless headphones from other brands. Access to Apple’s wireless file transfer technology would let third-party developers create apps similar to the AirDrop feature.  The commission also laid out a second set of measures to make the process for software developers requesting access to iPhone features more transparent and effective. Among the changes are better access to technical documentation not yet available to third parties, it said. With its decision, Brussels is “providing regulatory certainty both to Apple and to developers,” the European Commission Executive Vice President Teresa Ribera said in a press release. “Effective interoperability” for will mean “better choice for consumers in the fast-growing market for innovative connected devices,” she said. European consumer group BEUC hailed the decision. “For too long, Apple has operated a walled garden around its products and prevented interoperability,” Director General Agustin Reyna said. Apple, however, voiced its unhappiness, saying it’s bad for the company’s products and for European users. “Today’s decisions wrap us in red tape, slowing down Apple’s ability to innovate for users in Europe and forcing us to give away our new features for free to companies who don’t have to play by the same rules,” the company said in a statement. Apple said it will continue to work with the European Commission to “help them understand our concerns on behalf of our users.” The Commission also said Wednesday that Google wasn’t doing enough to comply with DMA. Despite making changes, including removing flight listings, Google was still giving preference to its own services in search results, it said. Google is also failing to let app developers steer users to cheaper options outside its Google Play Store app marketplace, the commission said in preliminary findings. While it’s acceptable for Google to charge a fee for downloading an app in its app store, the company is charging fees that “go beyond what is justified,” for every purchase of digital goods or services, it said. Google said the EU findings will require the company to make even more changes to how it displays some search results, “which would make it harder for people to find what they are looking for and reduce traffic to European businesses. This is, quite simply, misguided.” The commission’s app store findings, meanwhile, “create a false choice between openness and security” and risk exposing Europe users to more “malware and fraud,” it added. Google now has the chance to reply to the findings. If the commission decides Google is in “non-compliance” with the DMA, it can issue a fine of up to 10% of the company’s annual global revenue. But officials have said that they want to avoid issuing blockbuster fines and instead negotiate with companies to get them to comply. The EU’s crack down on the global tech industry has irritated President Donald Trump, who recently blasted the bloc’s hefty antitrust fines for U.S. tech companies. Vice-President JD Vance, meanwhile, has railed against excessive AI regulation, in a rebuke aimed at the EU’s sweeping Artificial Intelligence Act. However, both companies have been under pressure in the U.S. too. Apple is facing a Justice Departmentantitrust lawsuitaccusing it of engineering an illegal smartphone monopoly. Meanwhile, federal antitrust regulators are seeking to break up Google after a federal judge ruled Google’s ubiquitous search engine has been illegally exploiting its dominance to squash competition and stifle innovation.",
        "summary": "The European Union has mandated Apple to open up its iPhone and iPad operating systems to better integrate with competing technologies under the bloc's Digital Markets Act. This move is part of the EU's efforts to prevent Big Tech companies from monopolizing markets and to promote fair competition. Apple is required to implement measures to improve connectivity features for third-party device and app makers, such as enhancing notifications on non-Apple smartwatches and enabling seamless pairing with wireless headphones from other brands.",
        "sentiment": {
            "company": "apple",
            "score": 0.3
        },
        "tags": [
            "apple",
            "alphabet"
        ],
        "timestamp": "2025-03-19 13:51:17",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-gtc-jensen-huang-ai-457e9260aa2a34c1bbcc07c98b7a0555",
        "source": "ap_news",
        "headline": "Nvidia CEO Jensen Huang unveils new Rubin AI chips at GTC 2025",
        "content": "Nvidia founder Jensen Huang kicked off the company’s artificial intelligence developer conference on Tuesday by telling a crowd of thousands that AI is going through “an inflection point.” At GTC 2025 — dubbed the “Super Bowl of AI” — Huang focused his keynote on the company’s advancements in AI and his predictions for how the industry will move over the next few years. Demand for GPUs from the top four cloud service providers is surging, he said, adding that he expects Nvidia’s data center infrastructure revenue to hit $1 trillion by 2028. Huang’s highly anticipated announcement revealed more details around Nvidia’s next-generation graphics architectures: Blackwell Ultra and Vera Rubin -- named for the famous astronomer. Blackwell Ultra is slated for the second half of 2025, while its successor, the Rubin AI chip, is expected to launch in late 2026. Rubin Ultra will take the stage in 2027. In a talk that lasted at over two hours, Huang outlined the “extraordinary progress” that AI has made. In 10 years, he said, AI graduated from perception and “computer vision” to generative AI, and now to agentic AI — or AI that has the ability to reason. “AI understands the context, understands what we’re asking. Understands the meaning of our request,” he said. “It now generates answers. Fundamentally changed how computing is done.” The next wave of AI, he said, is already happening: robotics.  Robotics fueled by so-called “physical AI” can understand concepts like friction and inertia, cause and effect, and object permanence, he said. “Each one of these phases, each one of these waves, opens up new market opportunities for all of us,” Huang said. The key to that physical AI, and many of Huang’s other announcements, was the concept of using synthetic data generation — AI or computer-created data — for model training. AI needs digital experiences to learn from, he said, and it learns at speeds that make using humans in the training loops obsolete. “There’s only so much data and so much human demonstration we can perform,” he said. “This is the big breakthrough in the last couple of years: reinforcement learning.” Nvidia’s tech, he said, can help with that type of learning for AI as it attacks or tries to engage in solving a problem, step by step. To that end, Huang announced Isaac GR00T N1, an open-source foundation model designed to assist in developing humanoid robots. Isaac GR00T N1 would be paired with an updated Cosmos AI model to help develop simulated training data for robots. Benjamin Lee, a professor of electrical and systems engineering at the University of Pennsylvania, said that the challenge in training robotics lies in data collection because training in the real world is time-consuming and expensive. A simulated environment has long been a standard for reinforcement learning, Lee said, so researchers can test the effectiveness of their models. “I think it’s really exciting. Providing a platform, and an open-source one, will allow more people to learn on reinforcement learning,” Lee said. “More researchers could start playing with this synthetic data — not just big players in the industry but also academic researchers.” Huang introduced the Cosmos series of AI models, which can generate cost-efficient photo-realistic video that can then be used to train robots and other automated services, at CES earlier this year. The open-source model, which works with the Nvidia’s Omniverse — a physics simulation tool — to create more realistic video, promises to be much cheaper than traditional forms of gathering training, such as having cars record road experiences or having people teach robots repetitive tasks. U.S. car maker General Motors plans to integrate Nvidia technology in its new fleet of self-driving cars, Huang said. The two two companies will work together to build custom AI systems using both Omniverse and Cosmos to train AI manufacturing models. The Nvidia head also unveiled the company’s Halos system, an AI solution built around automotive — especially autonomous driving — safety. “We’re the first company in the world, I believe, to have every line of code safety assessed,” Huang said. At the end of his talk, Huang an open-source physics engine for robotics simulation called Newton, which is being developed with Google DeepMind and Disney Research. A small, boxy robot named Blue joined him on stage, popping up from a hatch in the floor. It beeped at Huang and followed his commands, standing beside him as he wrapped up his thoughts. “The age of generalist robotics is here,” Huang said.",
        "summary": "Nvidia CEO Jensen Huang unveiled new Rubin AI chips at GTC 2025, emphasizing the company's advancements in AI and predicting industry trends. The event highlighted Nvidia's next-generation graphics architectures, Blackwell Ultra and Vera Rubin, with releases scheduled through 2027. Huang discussed the evolution of AI from perception to generative AI, and now to agentic AI, emphasizing the impact on computing and the upcoming wave of robotics driven by physical AI.",
        "sentiment": {
            "company": "nvidia",
            "score": 0.8
        },
        "tags": [
            "nvidia",
            "alphabet"
        ],
        "timestamp": "2025-03-18 17:24:30",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-rates-nvidia-91a42e60248e389f1650bd744e6d9a2e",
        "source": "ap_news",
        "headline": "Stock market today: Wall Street falls sharply as Nvidia tumbles 8.5% and AI mania falters",
        "content": "NEW YORK (AP) — U.S. stock indexes fell sharply Thursday as Wall Street’s frenzy aroundartificial-intelligencetechnology faltered some more. The S&P 500 sank 1.6% for itsfifth dropin six days after setting anall-time high last week. Concerns aboutthe U.S. economy’s futurehave been behind much of the drop, including worries about howtariffspushed byPresident Donald Trumpcould worseninflation, and Wall Street’s main measure of health has lost all but 1.4% of its rally since Election Day. The Dow Jones Industrial Average dropped 193 points, or 0.4%, and the Nasdaq composite tumbled 2.8%. Weighing most heavily on the market was superstar stockNvidia, one of Wall Street’s most influential companies that’s been leading the market for years. After initially rising at the open of trading following abetter-than-expected profit report, Nvidia quickly slid to a loss of 8.5%. Better-than-expected earnings reports have become routine for Nvidia, whose chips are powering the surge intoartificial-intelligencetechnology, but this was the company’s first sinceDeepSeekshook theentire AI industry. AP business correspondent Damian Troise reports markets are off to a mixed start. After the Chinese upstart said it developed a large language model that can compete with the world’s best without using the most expensive chips, Wall Street had to question all the spending it assumed would go into Nvidia’s chips and the ecosystem that’s built around the AI boom, such as electricity to power large data centers.  Nvidia’s performance for the latest quarter, along with its forecasts for upcoming results, were “good enough to keep the debate moving in a positive direction,” according to analysts at UBS led by Timothy Arcuri. But it apparently wasn’t enough to send Nvidia’s stock higher, particularly given criticism that its price had already leaped too high, too quickly. After more than tripling two years ago, Nvidia’s stock more than doubled last year as its sales exploded. The market also soured on Salesforce, which fell 4% despite topping analysts’ profit expectations for the latest quarter. Several analysts called the performance solid, and the company continued to tout its AI offerings, but it gave a forecast for upcoming revenue that fell short of expectations. One AI-related company bucking the trend was Snowflake. The AI data cloud company rose 4.5% after delivering stronger profit and revenue for the latest quarter than analysts expected. It joined a range of stocks on the more staid end of Wall Street, ones that didn’t grab as many headlines as AI stocks in recent years. Despite the sharp loss for the overall S&P 500, close to 2 out of every 5 stocks in the index climbed. A 1.7% rise for Berkshire Hathaway, the company run by famed investor Warren Buffett, was one of the strongest upward forces on the index. The owner of Geico, BNSF railroad and other businesses has builta hoard of unused cashrecently. That could indicate Buffett, who’s famous for buying stocks when prices are low, may not see much worth purchasing in a market that critics say looks too expensive. Some investors have been waiting for other stocks to pick up the market’s leadership baton from Nvidia and the handful of big stocks that dominated for years. Nvidia alone accounted for a little more than 22% of the entire total return for the S&P 500 index last year. All told, the S&P 500 fell 94.49 points to 5,861.57 Thursday. The Dow Jones Industrial Average dropped 193.62 to 43,239.50, and the Nasdaq composite tumbled 530.84 to 18,544.42. In the bond market, Treasury yields swung following Trump’s latest announcement ontariffs. He said “the proposed TARIFFS scheduled to go into effect on MARCH FOURTH will, indeed, go into effect, as scheduled” for imports from Canada and Mexico. He also said he would add an additional 10% tariff on Chinese products on that date. Such moves could push up prices for U.S. households when inflation has already proven to be stubborn. Wall Street has been hoping the threats are merely leverage that Trump will use to negotiate with other countries before ultimately inflicting less pain on the economy than feared. But even if that proves to be the case, all the talk on tariffs has already gottenU.S. households to feel more nervousabout the economy. That’s dangerous because their strong spending has been a main reason the U.S. economy has avoided a recession. Such uncertainty also pressures the Federal Reserve, which has few if any tools to help an economy where growth is slowing and inflation is rising at the same time. Jeff Schmid, president of the Federal Reserve Bank of Kansas City, said in a speech Thursday that he has “become more cautious” in his hopes that inflation will continue to ease. He also said that discussions with people in his district suggest “elevated uncertainty might weigh on growth” for the economy. For now, at least, the U.S. economy appears to be in solid shape. The government on Thursday left alone its estimate for theU.S. economy’s performance during the last three months of 2024, though it raised its estimate for a measure of inflation during the quarter. A separate report saidmore U.S. workers applied for unemploymentbenefits last week. While the number is at a three-month high, it’s still nowhere close to where it’s been in past recessions. In the bond market, the yield on the 10-year Treasury edged up to 4.27% from 4.26% late Wednesday. In stock markets abroad, indexes were mixed across Europe and Asia. Germany’s DAX lost 1.1%, while Japan’s Nikkei 225 added 0.3%. AP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
        "summary": "Nvidia's stock tumbled 8.5% as U.S. stock indexes fell sharply due to concerns about the economy's future and inflation. Despite better-than-expected earnings reports, Nvidia's stock slid following a profit report. The company's performance for the latest quarter was deemed good enough by analysts, but criticism over its high stock price and competition in the AI chip market impacted its stock value.",
        "sentiment": {
            "company": "nvidia",
            "score": -0.5
        },
        "tags": [
            "nvidia"
        ],
        "timestamp": "2025-02-27 16:11:42",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-trump-rates-inflation-352fd536517d6824d7006c429651e3a2",
        "source": "ap_news",
        "headline": "Stock market today: Wall Street slumps as Nvidia, Tesla and other Big Tech stocks drop",
        "content": "NEW YORK (AP) — Drops for Nvidia, Tesla and other former superstars dragged Wall Street lower on Wednesday. The S&P 500 sank 1.1% to break what had been arun of calmer trading. The Dow Jones Industrial Average swung from a gain of 230 points in the morning to a loss of 132 points, or 0.3%, while the weakness for Big Tech sent the Nasdaq composite to a market-leading drop of 2%. The group of dominant stocks known as the “Magnificent Seven” has been at the center of the U.S. stock market’s recent sell-off, which earlier this month took the S&P 500 10% below itsall-time highfor itsfirst “correction” since 2023. Big Tech had rocketed in earlier years amid a frenzy aroundartificial-intelligencetechnology, and critics said their prices rose too quickly compared with their already rapidly growing profits. Nvidia fell 6% to bring its loss for the young year so far to 15.5%. It was the single heaviest weight on the S&P 500 by far. Other AI-related stocks were also weak, including server-builder Super Micro Computer, which fell 8.9%, and power companies hoping to electrify AI data centers. Teslahas been contending with additional challenges, including worries that politicalanger at its CEO, Elon Musk, will hurt the electric-vehicle maker’s sales. Tesla dropped 5.6% to extend its loss for 2025 to 32.6%. Other U.S. automakers went on their own sharp swings after the White House said in the afternoon that President Donald Trump would announcetariffs on auto importsafter trading ended for the day on the U.S. stock market.  U.S. auto giants have already spread their production around North America following prior free-trade deals encompassing the United States, Canada and Mexico. General Motors sank 3.1%. Ford Motor went from an early gain to a loss and back before inching up by 0.1%. The U.S. stock market had beensteadying somewhatfollowing its drop into a correction, with a three-day winning streak running through Tuesday. But strategists along Wall Street have warned the sharp swings likely aren’t over yet, with a suite ofU.S. tariffsscheduled to arrive next week. Even if those end up less painful for the global economy than feared, all the talk about tariffs has already soured confidence among U.S.consumersand companies. Such weakening confidence and the threat of tariffs pushed Venu Krishna and other strategists at Barclays to cut their forecast for where the S&P 500 may end the year, down to 5,900 from 6,600. The new target suggests a 2% rise from Tuesday’s closing level instead of a 14% jump. The Barclays strategists also slashed their estimate for how much profit S&P 500 companies will make this year, though they don’t see a recession. Much still remains uncertain, and things will “hinge upon the final scope and severity of tariffs,” Krishna and the strategists wrote in a report. A walk-back in tariffs by Trump could send the S&P 500 up to 6,700, while more strict levies could send the index down to 4,400. So far, the economy and job market have appeared to remain solid despite the worsening moods of shoppers and businesses, and economists are looking for signals about whether the hit to confidence is translating into actual pain for the economy. Another report on Wednesday morning offered little clarity. Orders for machinery, airplanes and other long-lasting manufactured products unexpectedly grew last month, when economists were forecasting a contraction. But a subset of the data seen as an indicator for investment by businesses flipped from growth to contraction. That could be a signal businesses are holding back on spending to see how tariffs play out. Treasury yields in the bond market, which often move with expectations for the U.S. economy’s strength, swiveled up and down following the report. The yield on the 10-year Treasury ended up rising to 4.34% from 4.31% late Tuesday. On Wall Street, GameStop jumped 11.7% after the video-game retailer reported better results for the latest quarter than analysts expected. It also said it would begin investing part of its treasuryin bitcoin. Dollar Treerose 3.1% after it said it’s selling Family Dollar to a pair of private equity firms for $1 billion after a decade of trying to make itsacquisitionof the bargain chain fit. Dollar Tree also reported stronger profit for the latest quarter than analysts expected. Cintas climbed 5.8% after the provider of work uniforms, restroom supplies and other equipment reported stronger profit for the latest quarter than analysts expected. All told, the S&P 500 fell 64.45 points to 5,712.20. The Dow Jones Industrial Average sank 132.71 to 42,454.79, and the Nasdaq composite tumbled 372.84 to 17,889.01. In stock markets abroad, indexes were mixed across much of Europe and Asia. The FTSE 100 rose 0.3% in London after a report saidU.K. inflation improvedby a touch more than economists expected. AP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
        "summary": "Nvidia, along with other Big Tech stocks like Tesla, experienced significant drops leading to a 1.1% decline in the S&P 500 and a 2% drop in the Nasdaq composite. Nvidia's stock fell by 6%, contributing heavily to the S&P 500's decline. The recent sell-off in the U.S. stock market has been attributed to the underperformance of dominant tech stocks, including those related to artificial intelligence like Nvidia.",
        "sentiment": {
            "company": "nvidia",
            "score": -0.7
        },
        "tags": [
            "nvidia",
            "tesla"
        ],
        "timestamp": "2025-03-26 17:05:58",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/google-alphabet-wiz-32-billion-e50fb41b9a84a1056a116f963e6efed0",
        "source": "ap_news",
        "headline": "Google to buy cybersecurity firm Wiz for $32 billion in the biggest deal in company’s history",
        "content": "SAN FRANCISCO (AP) —Googlehas struck a deal to buy cybersecurity firm Wiz for $32 billion in what would be the tech giant’s biggest-ever acquisition at the same time it’s facing a potential breakup of its internet empire. The proposed takeoverannounced Tuesdayis part of Google’s aggressive expansion into cloud computing during an artificial intelligence boom. The frenzy is driving demand for data centers that provide the computing power for AI technology and intensifying the competition in that space among Google and two other tech powerhouses, Microsoft and Amazon. If the all-cash transaction is approved by regulators, Wiz will join Google Cloud — an increasingly important part of its business separate from the search and advertising operations that account for most of the $350 billion annual revenue at Google’s parent company, Alphabet. With the advent of AI, however, the cloud division has become a rising star at Google. Annual revenue in the division was $26.3 billion in 2022, and soared 64% to $43.2 billion last year. Wiz, a five-year-old startup founded by four longtime friends who met in the Israeli army when they were still teenagers, is on track for an estimated $1 billion in revenue this year. After getting its start in Israel in 2020, Wiz now oversees an operation that makes security tools protecting the information stored in data centers from its current headquarters in New York. “Wiz and Google Cloud are both fueled by the belief that cloud security needs to be easier, more accessible, more intelligent, and democratized, so more organizations can adopt and use cloud and AI securely,” Wiz CEO Assaf Rappaportwrote in a blog post.  In a Tuesday conference call, Google CEO Sundar Pichai predicted Cloud division’s addition of Wiz will result in even better security at a lower cost than can be provided now. That prediction may have been aimed as much at regulators likely to scrutinize how the deal will affect competition and pricing, as much as at prospective customers. Google had been courting Wiz for some time before finally settling on a price that’s much richer than areported $23 billion bidthat was rejected last July. At that time, Wiz signaled it would instead pivot back to a previously-planned initial public offering. But recent volatility in the stock market has chilled the IPO market, and now Rappaport said Wiz expects to “innovate even faster” by becoming a part of Google. Wedbush analysts called Google’s move to buy Wiz “a shot across the bow” at other tech giants, particularly Microsoft and Amazon, who have already made big bets on cyber security as the fight to dominate cloud computing intensifies. Google had fallen behind its competition in the cloud space, Wedbush said, but the acquisition of Wiz could alter the parameters. The bid Tuesday easily eclipses the current largest acquisition in Google’s 26-year history — a $12.5 billion takeover of Motorola Mobility in 2012 that didn’t pay off the way that the Mountain View, California, company had hoped. The $32 billion purchase of Wiz would also go down as the biggest-ever cybersecurity acquisition and rank among the 20 most expensive takeovers of a software company in history, according to Mergermarket, a financial intelligence service. As often happens with high-priced acquisitions, investors reacted coolly to Tuesday’s news. Alphabet’s shares declined 2% to close at $160.67. Some of Google’s other acquisitions have turned into gold mines, most notably its $1.76 billion purchase of online video pioneer YouTube in 2006 and its $3.1 billion takeover of advertising technology platform DoubleClick in 2008. A $5.4 billion purchase of another security firm, Mandiant, in 2022 also helped fuel the recent growth of Google’s Cloud division, which posted an operating profit of $6.1 billion last year. Google’s DoubleClick deal is now part of an antitrust case filed by the U.S. Justice Department targeting Google’s technology for distributing ads across the internet. A rulingin that case, involving allegations that Google illegally abused its power to manipulate digital ad prices, is expected this year. Regulatorsin the U.S.andabroadare targeting Google on other fronts, too. Last year, a federal judge in another case brought by the Justice Department last year concluded Google had turned its ubiquitous search engineinto an illegal monopoly.The penalization phase of that trial begins next month. The Justice Department is seeking a rebuke that would include a requirement for Googleto sell its Chrome web browserand would ban the company from making agreements with Apple and other companies to make its search engine the default tool for finding online information on the iPhone and other devices. The Wiz deal will also get a close look from antitrust regulators. While many expect the Trump administration to welcome more dealmaking than occurred during the previous years, it has also expressed leeriness about Big Tech getting any bigger. Andrew Ferguson, the Trump administration’s Federal Trade Commission Chairman, has been particularly outspoken about his resolve to keep Big Tech on a short leash. The deal raises antitrust concerns due to the potential impact on standalone cyber security vendors, as well as potential disruption for bigger rivals. Still, Wedbush’s analysts note the industry is “ripe for consolidation” — which could pose “massive growth opportunities on the horizon heading into this AI Revolution.” Antitrust worries were also believed among the reasons Wiz called off sales talks with Google last year while President Joe Biden’s administration was seeking to block a variety of tech deals. Agreeing to a sale now indicates both Google and Wiz are more confident the deal will gain U.S. approval under the Trump administration, Mergermarket analysts Kevin Ketcham and Kevin McCaffrey wrote in a Tuesday note. “The two sides likely wouldn’t have struck the deal if they didn’t at least see a potential path to closing,” Ketcham and McCaffrey wrote. But the business watchdog group Demand Progress Education Fund urged the Trump administration to block Google’s takeover attempt. “It’s time to show the public whether they have the guts to step in and stop a big fish from being gobbled up by one of the biggest fishes in the pond,” said Emily Peterson-Cassin, the group’s director of corporate power. If they get the regulatory greenlight and meet several conditions spelled out in their agreement, Google and Wiz expect the deal to close in 2026. Grantham-Philips reported from New York.",
        "summary": "Google has announced its plan to acquire cybersecurity firm Wiz for $32 billion, marking its largest acquisition to date. This move is part of Google's strategic expansion into cloud computing amidst the growing demand for AI technology. The acquisition of Wiz will enhance Google Cloud's security offerings and is seen as a significant step in strengthening its position in the competitive cloud computing market. Wiz, founded by former Israeli army friends, is expected to bring in around $1 billion in revenue this year and will help Google Cloud provide more accessible and intelligent cloud security solutions.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "apple",
            "alphabet"
        ],
        "timestamp": "2025-03-18 16:32:37",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-prime-ai-dubbing-movies-ccf67a44f86e60e69a2677650a05ab3a",
        "source": "ap_news",
        "headline": "Amazon is now testing AI-aided dubbing for some movies and series on Prime",
        "content": "Amazon is testing artificial intelligence-aided dubbing for select movies and shows offered on its Prime streaming service. The company said this week that the AI-assisted dubbing – which refers to the practice of replacing an original audio track with a translated language – will be offered for licensed titles that previously lacked dubbing, such as the 2003 animated film “El Cid: La Leyenda.” The Seattle-based company said its AI-aided dubbing service will be in English and Latin American Spanish. Initially, it will be offered for 12 licensed titles. Amazon says the program will take a hybrid approach, allowing “local processionals to collaborate with AI to ensure quality control.” Other tech companies have also introduced AI-powered dubbing into their platforms. Last year, YouTube released a feature that allows content creators to translate their videos into multiple languages. Meta, meanwhile, said in September that it was testing an AI tool that will automatically translate voices in Reels.",
        "summary": "Amazon is testing AI-aided dubbing for select movies and shows on its Prime streaming service. The AI-assisted dubbing will be available for licensed titles that previously lacked dubbing, starting with 12 titles in English and Latin American Spanish. Amazon's approach involves a collaboration between local professionals and AI for quality control.",
        "sentiment": {
            "company": "amazon",
            "score": 0.7
        },
        "tags": [
            "alphabet",
            "amazon"
        ],
        "timestamp": "2025-03-06 10:30:54",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/google-search-artificial-intelligence-overviews-c4061a38b5e186f7abc41ee011da329f",
        "source": "ap_news",
        "headline": "Google leans further into AI-generated overviews for its search engine",
        "content": "Google is updating its ubiquitous search engine with the next generation of its artificial intelligence technology as part of an effort to provide instant expertise amid intensifying competition from smaller competitors. The company announced Wednesday that it will feed itsGemini 2.0 AI modelinto its search engine so it can field more complex questions involving subjects such as computer coding and math. As has been the casesince last May, the AI-generated overviews will be placed above the traditional web links that have become the lifeblood of online publishers dependent on traffic referrals from Google’s dominant search engine. Google is broadening the audience for AI overviews in the U.S. by making them available to teenage searchers without requiring them to go through a special sign-in process to see them. The stage is also being set for what could turn out to be one of the most dramatic changes to the search engine’s interface since Google co-founders Larry Page and Sergey Brin started the company in a Silicon Valley garage during the late 1990s. Google is going to begin a gradual rollout of an “AI mode” option that will result in the search engine generating even more AI overviews. When search is in AI mode, Google is warning the overviews are likely to become more conversational and sometimes head down online corridors that result in falsehoods that the tech industry euphemistically calls “hallucinations.” “As with any early-stage AI product, we won’t always get it right,” Google product vice president Robby Stein wrotein a blog postthat also acknowledged the possibility “that some responses may unintentionally appear to take on a persona or reflect a particular opinion.”  More stringent guardrails are supposed to be in place to prevent AI mode from steering people in the wrong direction for queries involving health and finance. The need for additional fine tuning is one reason Google is initially only offering AI mode in its experimental Labs section, and only subscribers to its $20-per-month Google One AI Premium will be allowed to test it out at first. But these tests almost always result in the technology being released to all comers — a goal that Google is pursuing in response to AI-powered search engines from ChatGPT and Perplexity. Google’s amped-up usage of more sophisticated AI overviews is likely to amplify worries that the summaries will make web surfers even less likely to click on links to take them to sites with useful information on the topic. Those traffic referrals are one of the main ways that online publishers attract the clicks needed to sell the digital ads that help finance their operations. Google executives insist AI overviews are still driving traffic to other sites by driving up people’s curiosity so they engage in more queries to learn more, resulting in more clicks to other publishers. But those reassurances haven’t placated publishers who believe that Google will be the main beneficiary of AI overviews, further enriching an internet empire that already generates more than $260 billion in annual ad revenue. The expanded use of AI overviews also could expose Google to more allegations that it is abusing the power of a search engine that a federal judge last year foundto be an illegal monopolyin attempt to maintain its position as the internet’s main gateway. The U.S. Justice Department, which filed the monopoly claims against Google in 2020, is now proposinga partial breakup of the companythat would include the sale of its Chrome browser as part of its punishment. The hearings on the proposed penalties against Google, which may include digging deeper into its use of AI, are scheduled to begin next month in Washington D.C. Online educational online service Chegg already has amplified on that monopoly case with a lawsuit filed last month in the same Washington court accusing Google of improperly cribbing information from its site to present in its AI Overviews. Google has denied the allegations.",
        "summary": "Google is updating its search engine with the Gemini 2.0 AI model to provide AI-generated overviews for complex questions, aiming to offer instant expertise amidst competition. The AI overviews will be shown above traditional web links, potentially changing the search engine interface significantly. Google is also introducing an \"AI mode\" option for more AI-generated overviews, with caution about potential inaccuracies and the need for fine-tuning, especially in sensitive areas like health and finance.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.6
        },
        "tags": [
            "alphabet",
            "openai"
        ],
        "timestamp": "2025-03-05 12:20:04",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-openai-chatgpt-competition-britain-uk-e94a99716f7e226db2c7e98976832ac2",
        "source": "ap_news",
        "headline": "UK watchdog drops competition review of Microsoft’s OpenAI deal",
        "content": "LONDON (AP) — Britain’s competition watchdog said Wednesday it has dropped its review of Microsoft’s partnership with OpenAI, saying it’s satisfied that the deal doesn’t need a closer investigation under the country’s merger rules. The Competition and Markets Authority said that based on “available evidence,” the partnership between the U.S. tech giant and the ChatGPT maker doesn’t qualify for a merger investigation. “In particular the CMA does not consider there has been a change of control by Microsoft from material influence to de facto control over OpenAI,” the watchdog said in a statement. Microsoft was a big initial backer of OpenAI, plowing billions of dollars into the San Francisco-based startup in its early days. But since then OpenAI has attracted otherbig investorsincluding Japan’s Softbank and chipmaker Nvidia after its success with ChatGPT. The CMA has stepped up scrutiny of AI deals amid a wave of investment from Big Tech companies into startups working on generative artificial intelligence. Last year it approved anotherMicrosoft dealinvolving Inflection AI as well as partnerships with chatbot maker Anthropic by Google andAmazon.",
        "summary": "The UK competition watchdog has decided to drop its review of Microsoft's partnership with OpenAI, stating that the deal does not warrant a closer investigation under merger rules. The Competition and Markets Authority concluded that there has been no change of control by Microsoft over OpenAI. Microsoft was an early supporter of OpenAI, but the startup has since attracted other significant investors.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.5
        },
        "tags": [
            "nvidia",
            "microsoft",
            "alphabet",
            "openai"
        ],
        "timestamp": "2025-03-05 09:21:27",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/elon-musk-openai-lawsuit-f5724e7ab07b5bed8292a1e8aa2ef695",
        "source": "ap_news",
        "headline": "Judge denies Elon Musk’s request to block OpenAI for-profit conversion but welcomes trial",
        "content": "OAKLAND, Calif. (AP) — A federal judge has denied Elon Musk’s request for a court order blocking OpenAI from converting itself to afor-profit companybut said she could expedite a trial to considerMusk’s claims against the ChatGPT makerand its CEO. U.S. District Judge Yvonne Gonzalez Rogers ruled late Tuesday that “Musk has not demonstrated likelihood of success on the merits” in his request for a preliminary injunction. She offered to hold a trial in her California courtroom as soon as this fall, “given the public interest at stake and potential for harm if a conversion contrary to law occurred.” Musk, an early OpenAI investor, began a legal offensive against the ChatGPT maker and CEO Sam Altman a year ago,suing for breach of contractover what he said was the betrayal of itsfounding aims as a nonprofit. He escalated the legal dispute late last year, adding new claims and defendants, including Microsoft, and asking for a court order that would stop OpenAI’s plans to convert itself into a for-profit business. Musk also added his own AI company, xAI, as a plaintiff, claiming that OpenAI was unfairly stifling business competition. He and a group of investors more recently made anunsolicited $97.4 billion bidto buy a controlling stake in the nonprofit — a move that undermined Musk’s “claim of irreparable harm,” the judge wrote. OpenAI said it welcomed the court’s decision.  “This has always been about competition,” a statement from the company said. “Elon’s own emails show that he wanted to merge a for-profit OpenAI into Tesla. That would have been great for his personal benefit, but not for our mission or U.S. interests.” Musk alleges in the lawsuit that the companies are violating the terms of his foundational contributions to the charity. He had invested about $45 million in the startup from its founding until 2018, his lawyer has said. Musk attorney Marc Toberoff said in a statement late Tuesday that he is pleased that the court offered an expedited trial on the core claims. “We look forward to a jury confirming that Altman accepted Musk’s charitable contributions knowing full well they had to be used for the public’s benefit rather than his own enrichment,” Toberoff said. Gonzalez Rogers in a hearing last month called it a “stretch” to claim “irreparable harm” to Musk, and she called the case “billionaires vs. billionaires.” She questioned why Musk invested tens of millions in OpenAI without a written contract. Toberoff responded that it was because the relationship between Altman and Musk at the time was “built on trust” and the two were very close. “That is just a lot of money” to invest “on a handshake,” the judge said. The dispute has roots in a 2017 internal power struggle at the fledgling startup that led to Altman becoming OpenAI’s CEO. Emails disclosed by OpenAI show Musk had also sought to be CEO and grew frustrated after two other OpenAI co-founders said he would hold too much power as a major shareholder and chief executive if the startup succeeded in its goal to achieve better-than-human AI known asartificial general intelligence. Musk haslong voiced concernsabout how advanced forms of AI could threaten humanity. Altman eventually succeeded in becoming CEO and has remained so except for a period in 2023 when he was firedand then reinstateddays later after the board that ousted him was replaced. Gonzalez Rogers, appointed by then-President Barack Obama in 2011, has handled a number of tech industry cases including Apple’sfight with Epic Games, though she said last month that Musk’s case is “nothing like” that one. That case was also the last time she granted a preliminary injunction, eight months before the case went to trial. O’Brien reported from Providence, Rhode Island. The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "summary": "A federal judge denied Elon Musk's request to block OpenAI from converting to a for-profit company but offered to expedite a trial to consider Musk's claims against the ChatGPT maker and its CEO, Sam Altman. Musk, an early OpenAI investor, initiated legal action against OpenAI and Altman for breach of contract over the conversion to a for-profit entity. The judge's ruling indicated that Musk had not demonstrated a likelihood of success on the merits for a preliminary injunction, and she proposed a trial to address the matter promptly.",
        "sentiment": {
            "company": "openai",
            "score": 0.1
        },
        "tags": [
            "openai"
        ],
        "timestamp": "2025-03-05 09:49:47",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-ai-artificial-intelligence-f72da2deff83510987a0017e61eac335",
        "source": "ap_news",
        "headline": "Nvidia sales surge in the fourth quarter on demand for AI chips",
        "content": "LOS ANGELES (AP) — Nvidia on Wednesday reported a surge in fourth-quarter profit and sales as demand for its specialized Blackwell chips, which power artificial intelligence systems, continued to grow, sending the company’s stock higher after hours. For the three months that ended Jan. 26, the tech giant based in Santa Clara, California, posted revenue of $39.3 billion, up 12% from the previous quarter and 78% from one year ago. Adjusted for one-time items, it earned 89 cents a share. “Demand for Blackwell is amazing as reasoning AI adds another scaling law — increasing compute for training makes models smarter and increasing compute for long thinking makes the answer smarter,” Nvidia Founder Jensen Huang said in a statement. Nvidia has ramped up the massive-scale production of Blackwell AI supercomputers, Huang said, “achieving billions of dollars in sales in its first quarter.” “AI is advancing at light speed as agentic AI and physical AI set the stage for the next wave of AI to revolutionize the largest industries,” he said. Wednesday’s earnings report topped Wall Street expectations. Analysts had been expecting adjusted earnings of 85 cents a share on revenue of $38.1 billion, according to FactSet. Nvidia reported net income of $22.06 billion in the fourth quarter, beating analysts’ predictions of $19.57 billion. The tech giant expected sales to continue to grow, forecasting revenue of around $43 billion for the first quarter of fiscal 2026. Data center sales, which account for much of Nvidia’s revenues, were a core part of that uptick — fourth-quarter revenue was $35.6 billion, up 93% from one year ago.  The growth in the data center market comes as President Donald Trump has talked up a joint venture investing up to $500 billion for infrastructure tied to AI through a new partnership formed by OpenAI, Oracle and SoftBank. The Stargate project will start building out data centers and the energy generation needed for the further development of AI, according to the White House. Nvidia is a partner in that project. On an earnings call Wednesday afternoon, Nvidia Chief Financial Officer Colette Kress said that fourth-quarter Blackwell sales exceeded the company’s expectations. “We delivered $11 billion of Blackwell architecture revenue in the fourth quarter of fiscal 2025, the fastest product ramp in our company’s history,” Kress said. “Blackwell sales were led by large cloud service providers which represented approximately 50% of our data center revenue.” The poster child of the AI boom, Nvidia has grown into the second-largest company on Wall Street — it is nowworth over $3 trillion— and the stock’s movement carries more weight on the S&P 500 and other indexes than every company except Apple. Two years ago, Nvidia’s market value was below $600 billion. Nvidia and other companies benefiting from the AI boom have been a major reason the S&P 500 has climbed to record after record recently, with the latest coming last week. Their explosion of profits has helped to propel the market despite worries about stubbornly high inflation and possible pain coming for the U.S. economy from tariffs and other policies of President Donald Trump. But those tariffs are still “an unknown,” Kress said, until Nvidia can better understand what the Trump administration’s plan is. “We are awaiting,” she said, adding that the company would follow any export controls or tariff rules. The fourth-quarter earnings are the company’s first report since Chinese company DeepSeek boasted it had developed a large language model that could compete with ChatGPT and other U.S. rivals, but was more cost-effective in its use of Nvidia chips to train the system on troves of data. The frenzy over DeepSeek caused $595 billion in Nvidia’s wealth to vanish briefly. But the company in a statement commended DeepSeek’s work as “an excellent AI advancement” that leveraged “widely-available models and compute that is fully export control compliant.” “DeepSeek R1 has ignited global enthusiasm,” Huang said on Wednesday’s earnings call. “It’s an excellent innovation, but even more importantly, it has open-sourced a world-class reasoning AI model. Nearly every AI developer is applying R1, or chain of thought and reinforcement learning techniques like R1, to scale their models’ performance.” Speaking to investors, Huang said the “next wave” of AI is coming with “agentic AI for enterprise, physical AI for robotics and sovereign AI as the different regions build out their AI for their own ecosystems.” “We’re in the center of much of this development,” Huang said.",
        "summary": "Nvidia reported a significant surge in fourth-quarter profit and sales driven by the increasing demand for its specialized Blackwell chips used in AI systems. Revenue reached $39.3 billion, up 12% from the previous quarter and 78% from a year ago. Nvidia's Founder Jensen Huang highlighted the strong demand for Blackwell AI supercomputers and expressed optimism about the future growth potential of AI technologies.",
        "sentiment": {
            "company": "nvidia",
            "score": 0.9
        },
        "tags": [
            "nvidia",
            "openai"
        ],
        "timestamp": "2025-02-26 18:51:47",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-alexa-fee-ai-assistant-017c17bddfa6742d1e78873cdda3663f",
        "source": "ap_news",
        "headline": "Amazon’s new AI-powered Alexa promises to be your ‘best friend in a digital world’ for a monthly fee",
        "content": "NEW YORK (AP) —Amazonon Wednesday unveiled agenerative-AIinfused Alexa that it says will allow thepopular voice assistantto have more personality, check a user’s tone and even plan romantic dates. But unlike before, when Alexa was offered for free on any Alexa-enabled devices, customers will have to pay Amazon a monthly fee of $19.99 for the revamped voice assistant, which it calls “Alexa+”. However, the generative-AI powered Alexa will be free for Prime members, who pay the company a monthly or annual fee for free delivery and other perks. At a media event held in New York City, Amazon executives showed off the update to the ten-year old digital assistant with the new features aimed at boosting sales and interactions with Alexa-enabled devices. The company says Alexa+ is able to have conversations with a more natural, humanlike flow and can learn more about a user — such as dietary preferences or allergies — the more it’s used. “I’m not just an assistant, I’m your new best friend in the digital world,” Alexa+ said during an onstage demo on Wednesday. At the event, Panos Panay, Amazon’s senior vice president of devices & services, listed off the other things the voice assistant can now do, such as create study plans, text a babysitter and call an Uber ride for a friend. He and other company executives also said Alexa can fetch videos from Ring cameras — such as checking whether a user’s dog was walked that day — and is able to remember handwritten recipes, emails and other documents shared with it. “She’s smarter than she’s ever been before, but she’s also approachable,” Panay said.  Alexa is built into products such as smart speakers, Amazon’s Fire TVs and earbuds. The Seattle-based tech giant launched its popular voice assistant in 2014 alongside its first Echo device, which responds to voice commands. Panay said Amazon has sold more than 600 million Alexa-enabled devices and that user engagement grew 20% last year compared to 2023. Some market estimates have shown Alexa holds the largest market share among voice assistants. The revamped Alexa uses large language models, including some developed by Amazon and others by Anthropic, the generative AI startup the tech giant has poured billions into. Alexa+ has a “model-agnostic system,” allowing it to select the best AI model for the tasks it wants to complete, said Daniel Rausch, Amazon’s vice president for Alexa and Echo. Amazon says it will kick off “early access” of Alexa+, currently only available in English, in the U.S. next month — starting with users who own or purchase some of its newest Echo Show devices, which feature onscreen displays of Alexa responses. After opting in, those eligible users will then see Alexa+ start working across compatible devices, as well as on their web browser and app, the company said. Amazon will later roll out the update in “waves” internationally and to more devices. Some of the new features are only built for products with screens. Alexa+ will not reach certain older Echo models — but Amazon says owners of those devices can continue to use the original assistant. And users who simply prefer using the original Alexa can continue doing so, pera FAQfrom the company. Amazon’s announcement came more than a yearafter the company teased an early versionof an AI-infused Alexa at a media event held to show off new devices. At the time, Amazon had said it was working on a “speech-to-speech” model that would allow Alexa to exhibit humanlike attributes, such as laughter and phrases like “uh-huh” during conversations. During the demo on Wednesday, Amazon highlighted features it had previously kept under lid. In one exchange, Panay showed the new Alexa a video of the crowd in the room to test a feature that apparently allows it to sense the surrounding mood. Panay asked Alexa+ if the crowed “looked pumped” to which it responded the room full of journalists were “paying attention to you and excited.” Like its predecessor, Alexa+ is enabled when users say the voice assistant’s name — but executives on Wednesday said users now only have to say that wake word once before having a prolonged, back and forth exchange. Still, demonstrators would occasionally say “Alexa” again if it seemed like the voice assistant didn’t catch something. Amazon competes in the smart speaker market with other tech giants, including Apple and Google. Though it has had success in selling devices, the company’s other goal — driving Amazon purchases through Alexa — has been more challenging to pull off. Amazon has said Alexa customers have used their device to shop. However, many rely on it mostly for menial tasks, such as playing music, asking questions or checking the weather. A subscription fee for the revamped Alexa will allow the company to offset costs related to AI development and help its devices operations become more profitable. This story was corrected to show that is Panos Panay is Amazon’s senior vice president, not vice president, of devices & services.",
        "summary": "Amazon unveiled a new AI-powered Alexa called \"Alexa+\" that offers more personality and features like checking a user's tone and planning dates. Customers will need to pay a monthly fee of $19.99 for Alexa+, but it will be free for Prime members. The revamped voice assistant aims to enhance sales and interactions with Alexa-enabled devices by providing more natural conversations and personalized experiences. The new features include creating study plans, texting a babysitter, and fetching videos from Ring cameras. Amazon has sold over 600 million Alexa-enabled devices, and user engagement increased by 20% last year.",
        "sentiment": {
            "company": "amazon",
            "score": 0.8
        },
        "tags": [
            "apple",
            "amazon"
        ],
        "timestamp": "2025-02-27 09:01:57",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-chips-revenue-deepseek-apple-1063d50f560f48c04fb97539d566c46e",
        "source": "ap_news",
        "headline": "Nvidia posted another strong quarterly report. What to know, by the numbers",
        "content": "Wall Street once again fixated on an earnings report fromNvidia, the main player in the artificial intelligence mania. The chipmaker reported earnings after the bell Wednesday that topped analyst forecasts, and shares added 2% in after-hours trading, perhaps indicating that Wall Street quietly hoped for even better results. This is Nvidia’s first earnings report since a Chinese upstart,DeepSeek, upended the artificial-intelligence industry by saying it has developed a large language model that can compete with big U.S. rivals without having to use the most expensive chips. Nvidia’s market value saw a one-day drop of nearly $600 billion after the news came out. Here’s a look at Nvidia, by the numbers. Nvidia’s total market value as of the close Wednesday, before the release of its earnings report. That’s second in the S&P 500 behind Apple ($3.611 trillion). Microsoft is third with a market value just below $3 trillion ($2.972 trillion). Two years ago, Nvidia’s market value was below $600 billion. The one-day drop in Nvidia shares on Jan. 27 after DeepSeek’s revelation called into question all the spending Wall Street had assumed would go into not only Nvidia’s chips but also the ecosystem that’s built around the AI boom. The stock rose more than 170% in 2024. Nvidia’s revenue for the fourth quarter, easily topping Wall Street’s estimate and up 78% from last year’s fourth quarter.  Nvidia’s revenue for the fiscal year that ended in January 2025. That was more than double its revenue for fiscal 2024 and more than four times its receipts the year before that. That’s approximately how much of the S&P 500’s gain for last year could be attributed to Nvidia alone, according to S&P Dow Jones Indices. By comparison, Amazon accounted for about 6% of the gain.Nvidia replaced Intel in the Dow Jones Industrial Averagein November. That’s how many dozen eggs one could buy with Nvidia’s market value of $3.215 trillion, using the average price of $4.95 per dozen for January from the Federal Reserve. Egg prices have spiked due to an outbreak of bird flu, and supplies of eggs have run short in some areas.",
        "summary": "Nvidia reported strong earnings that exceeded analyst expectations, leading to a 2% increase in after-hours trading. The company's market value has surged, ranking second in the S&P 500 behind Apple. However, Nvidia faced a significant one-day drop in market value following competition from Chinese AI upstart DeepSeek. Despite this, Nvidia's revenue for the fourth quarter and fiscal year showed impressive growth, contributing significantly to the S&P 500's gains.",
        "sentiment": {
            "company": "nvidia",
            "score": 0.8
        },
        "tags": [
            "nvidia",
            "microsoft",
            "apple",
            "amazon"
        ],
        "timestamp": "2025-02-26 17:13:33",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/israel-palestinians-ai-technology-microsoft-gaza-lebanon-90541d4130d4900c719d34ebcd67179d",
        "source": "ap_news",
        "headline": "Microsoft workers protest sale of AI and cloud services to Israeli military",
        "content": "WASHINGTON (AP) — Five Microsoft employees were ejected from a meeting with the company’s chief executive for protesting contracts to provide artificial intelligence and cloud computing services to the Israeli military.  The protest on Monday came after an investigation by The Associated Pressrevealed last weekthat sophisticated AI models from Microsoft and OpenAI had been used as part of an Israeli military program to select bombing targets during the recent wars in Gaza and Lebanon. The story also contained details of an errant Israeli airstrike in 2023 that struck a vehicle carrying members of a Lebanese family, killing three young girls and their grandmother.  Microsoft CEO Satya Nadella was speaking about new products at an employee town hall meeting at the company’s corporate campus in Redmond, Washington. Workers standing about 15 feet to his right then revealed T-shirts that when they stood side-by-side spelled out the question “Does Our Code Kill Kids, Satya?”  Photos and videoof the incident, which was live streamed throughout the company, shows Nadella kept speaking and did not acknowledge the protesters. Two men quickly tapped the workers on the shoulders and ushered them out of the room.  “We provide many avenues for all voices to be heard,” Microsoft said in a statement provided to the AP. “Importantly, we ask that this be done in a way that does not cause a business disruption. If that happens, we ask participants to relocate. We are committed to ensuring our business practices uphold the highest standards.”     Microsoft did not answer Tuesday when asked whether the employees involved in the protest would face disciplinary action. The company also previously declined to comment about the AP’s Feb. 18 story about its contracts with the Israeli military.  In October, Microsoftfired two workersfor helping organize an unauthorized lunchtime vigil for Palestinian refugees at its headquarters. Microsoft said at the time that it ended the employment of some people “in accordance with internal policy” but declined to give details.  A group of workers has been raising concerns within the company for months about Microsoft providing services to the Israeli military through its Azure cloud computing platform. Some employees at the company have also spoken out in support of Israel andsaid those supporting Palestinians have made them feel unsafe.  The AP’s investigation included exclusive details drawn from internal company data and documents, including that the usage of AI models by the Israeli military through Azure increased nearly 200 times after the Oct. 7, 2023, attack by Hamas militants. Microsoft CEO Satya Nadella speaks at the Microsoft Ignite conference, Nov. 19, 2024, in Chicago. (AP Photo/Charles Rex Arbogast, File)   The AP’s report was shared and discussed among Microsoft employeeson social mediaand within the company’s internal systems. In a community forum designated for employees to raise concerns with senior leadership, an employee shared links to the AP report. More than a dozen others questioned whether the company was violating itsstated principles to defend human rightsand not to let its AI models be used to harm people, according to screenshots reviewed by the AP.  Abdo Mohamed, a researcher and data scientist who was one of the Microsoft workers fired over the October vigil, said the company is prioritizing profits over its own human rights commitments.  “The demands are clear,” said Mohamed, who works with a group of Microsoft workers called No Azure for Apartheid. “Satya Nadella and Microsoft executives need to answer to their workers by dropping contracts with the Israeli military.”   Contact AP’s global investigative team at[email protected]or https://www.ap.org/tips/",
        "summary": "Five Microsoft employees were removed from a meeting with CEO Satya Nadella after protesting the company's contracts to provide AI and cloud services to the Israeli military. The protest was in response to reports that Microsoft's AI models were used in selecting bombing targets during conflicts in Gaza and Lebanon. This incident follows previous controversies involving Microsoft's dealings with the Israeli military.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.6
        },
        "tags": [
            "microsoft",
            "openai"
        ],
        "timestamp": "2025-02-25 18:43:52",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-low-cost-iphone-artificial-intelligence-1fc43f8b839d7995763fbe939f5de290",
        "source": "ap_news",
        "headline": "Apple unveils a souped-up and more expensive version of its lowest priced iPhone",
        "content": "Apple has released a sleeker and more expensive version of its lowest priced iPhone in an attempt to widen the audience for a bundle of artificial intelligence technology that the company has been hoping will revive demand for its most profitable product lineup. The iPhone 16e unveiled Wednesday is the fourth-generation of a model that’s sold at a dramatically lower price than the iPhone’s standard and premium models. The previous bargain-bin models were called the iPhone SE, with the last version coming out in 2022. Like the higher-pricediPhone 16 lineup unveiled last September, the iPhone 16e includes the souped-up computer chip needed to process an array of AI features that automatically summarize text, audio and create on-the-fly emojis while smartening up the device’s virtual assistant, Siri. It will also have a more powerful battery and camera. All those upgrades will translate into a higher starting price for an iPhone 16e at $600, a 40% increase from $430 for the last iPhone SE. But iPhone 16e will be more affordable than the cheapest standard iPhone 16 at $800. The new phone will be available in stores Feb. 28, but can be pre-ordered beginning Friday. “We’re so excited for iPhone 16e to complete the lineup as a powerful, more affordable option to bring the iPhone experience to even more people,” said Kaiann Drance, an Apple vice president in charge of promoting a device lineup that accounts for more than half of the company’s revenue.  But Apple is also trying to balance its desire to offer a more affordable iPhone that will lure more people into its sphere of product against its self interest in maximizing its profits from selling higher price products, according to Forrester Research analyst Dipanjan Chatterjee. “The problem with a lower-end product in a luxury portfolio is that you want it to be good but not so good as to cannibalize the crown jewels,” Chatterjee said. Although Apple has been hyping itsforay into AI since last June, the complete set of features still haven’t been released in the U.S. and the technology still isn’t even available in some parts of the world. The delays in making the iPhone’s AI — dubbed “Apple Intelligence’” — more widely available through free software updates dinged the Cupertino, California, company during the past holiday whensales of the device dipped slightlyfrom their 2023 levels. Apple has primarily been losing the ground in China, where it hasn’t yet specified when the iPhone’s AI technology will be available. But the company recently struck an AI partnership with Alibaba in China that could pave the way for the technology coming to iPhones in that country this spring. Besides being able to handle AI for the first time, the iPhone 16e has a different look from previous SE models. It boasts a 6.1-inch display screen, slightly larger than the 4.7-inch display on SE model and no longer has a home screen button like the SE had. The new iPhone 16e will rely include a facial recognition option for unlocking the device, just like the higher priced models do. Apple’s shares edged higher Wednesday to close at $244.87, below the stock’s peak of roughly $260 reached in late December.",
        "summary": "Apple has unveiled the iPhone 16e, a more expensive version of its lowest priced iPhone, featuring a souped-up computer chip for AI capabilities, a more powerful battery and camera. The iPhone 16e is priced at $600, a 40% increase from the previous iPhone SE, but still more affordable than the cheapest standard iPhone 16 at $800. Apple aims to widen its audience with this new model while balancing the need to offer affordability with maximizing profits.",
        "sentiment": {
            "company": "apple",
            "score": 0.6
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-02-19 16:26:46",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/bill-gates-original-code-microsoft-anniversary-dd33373215f6d22ccf4faa2913f6075f",
        "source": "ap_news",
        "headline": "Microsoft founder Bill Gates reflects upon a 50-year-old computer code that reshaped technology",
        "content": "Even as he grows older, Microsoft founder Bill Gates still fondly remembers the catalytic computer code he wrote 50 years ago that opened up a new frontier in technology. Although the code that Gates printed out on a teletype machine may look crude compared to what’s powering today’s artificial intelligence platforms, it played a critical role in creating Microsoft in April 1975 — a golden anniversary that the Redmond, Washington, company will celebrate on Friday. Gates, 69, set the stage for that jubilee witha blog postreminiscing on how he and his old high school friend — the late Paul Allen — scrambled to create the world’s first “software factory” after reading an article in the January 1975 issue of Popular Electronics magazine about the Altair 8800, a minicomputer that would be powered by a tiny chip made by the then-obscure technology company, Intel. The article inspired Gates, who was just a freshman at Harvard University, and Allen to call Altair’s maker, Micro Instrumentation and Telemetry Systems, and promise the company’s CEO Ed Roberts they had developed software that would enable consumers to control the hardware. There was just one hitch: Gates and Allen hadn’t yet come up with the code they promised Roberts. Gates and Allen tackled the challenge by latching onto the BASIC computer language that had been developed in 1964 at Dartmouth College, but they still had to figure out a way to make the technology compatible with the forthcoming Altair computer, even though they didn’t even have a prototype of the machine.  After spending two months working on the program with little sleep, Gates finished the code that became the basis for the Altair’s first operating system. “That code remains the coolest I’ve ever written,” Gates wrote in his blog post, which includes an option to download the original program. The code would go on to provide the foundation for a business that would make personal computers a household staple, with a suite of software that include the Word, Excel and PowerPoint programs, as well as the Windows operating system that still powers most PCs today. “That was the revolution,” Gates said of the codein a videoaccompanying his post. “That was the thing that ushered in personal computing.” Gates’ recollection of the code is part of a nostalgic kick that he has been on this year as he prepares to turn 70 in October. The trip down memory lane includedthe February release of a memoirexploring his early years as an often-misunderstood child with few friends, and a hailing of the 25th anniversary of the philanthropic foundation he created after stepping down as Microsoft’s CEO in 2000. The tech giant initially stumbled after Gates’ departure but has been thriving under CEO Satya Nadella, and has amassed a market value of about $2.8 trillion. In his memoir, Gates also reflected on his tempestuous relationship with fellow PC pioneer, the late Apple co-founder Steve Jobs, whose company will be celebrating its golden anniversary next year. “Fifty years is a long time,” said Gates, whose personal fortune is estimated at $108 billion. “It’s crazy that the dream came true.”",
        "summary": "Microsoft founder Bill Gates reflects on the 50-year-old computer code he wrote that paved the way for Microsoft's creation in 1975. The code, which Gates considers the coolest he's ever written, was instrumental in developing the Altair's first operating system. Gates and his late high school friend, Paul Allen, utilized the BASIC computer language to fulfill their promise to Micro Instrumentation and Telemetry Systems, kickstarting Microsoft's journey.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "apple"
        ],
        "timestamp": "2025-04-03 19:00:02",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/meta-facebook-instagram-turkey-erdogan-59f16571e884fd6f0f9597a72771131f",
        "source": "ap_news",
        "headline": "Meta is fined by Turkey after refusing to restrict content on Facebook and Instagram",
        "content": "Meta said it has been hit with a hefty fine for resisting Turkish government demands to limit content on Facebook and Instagram. President Recep Tayyip Erdogan’s government has been trying torestrict opposition voices on social mediaafter widespread protests erupted following thearrest of Istanbul’s mayor, who’s a key rival. “We pushed back on requests from the Turkish government to restrict content that is clearly in the public interest, and have been fined by them as a consequence,” the company said in a statement. The social media company did not disclose the size of the fine, except to say it was “substantial” and did not provide any more details about the content in question. The Associated Press has approached the Turkish government for comment. “Government requests to restrict speech online alongside threats to shut down online services are severe and have a chilling effect on people’s ability to express themselves,” Meta said. In recent years the Turkish government has increasingly sought to bring social media companies under its control. When protests erupted following the March 19 arrest of opposition Istanbul Mayor Ekrem Imamoglu, many social media platforms such as X, Instagram and Facebook were blocked. More than 700 individual X accounts, including those belonging to journalists, media outlets, civil society organizations and student groups, were blocked, according to the Media and Law Studies Association. X said it would object. Dozens have been arrested for social media posts deemed to be supporting the protests.",
        "summary": "Meta has been fined by Turkey for refusing to comply with government demands to restrict content on Facebook and Instagram. The Turkish government has been attempting to limit opposition voices on social media, particularly after protests erupted following the arrest of Istanbul's mayor, a key rival. Meta pushed back against these requests, citing the importance of protecting public interest content and expressing concerns about the impact of government restrictions on free speech.",
        "sentiment": {
            "company": "meta",
            "score": -0.5
        },
        "tags": [
            "meta"
        ],
        "timestamp": "2025-04-02 20:45:49",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/ufc-meta-trump-dana-white-zuckerberg-tko-f2d927e11b7c6af3202380836ab0a6ae",
        "source": "ap_news",
        "headline": "Dana White’s UFC and Mark Zuckerberg’s Meta joining forces in partnership",
        "content": "NEW YORK (AP) — UFC is joining up with Facebook’s parent company Meta in a deal that will bring mixed martial arts to more fans around the world. The companies said Wednesday that their multiyear partnership will give UFC the ability to use Meta’s technology platforms, services, and products, including Meta AI, Meta Glasses, Meta Quest, Facebook, Instagram, WhatsApp and Threads, so that UFC fans have more ways to view its content. Meta and UFC, whose parent company is TKO Group, said they will work together to incorporate Meta’s AI glasses into UFC events. “Meta has the greatest minds in tech and they are going to take fan engagement to the next level,” UFC President and CEO Dana White said in a statement. White mentioned that Meta is already working on some innovations for a new fighter rankings system. The deal, whose financial terms were not disclosed, will also see the Meta brand appear in UFC’s Octagon, as well as across numerous broadcasts. Meta’s social media platform Threads will feature exclusive original UFC content. “I love this sport and I’m looking forward to working with the UFC to let fans experience it in new ways,” Meta Founder and CEO Mark Zuckerberg said. Zuckerberg is trained in mixed martial arts and posted about completing his first jiu jitsu tournament in 2023. That same year, there were talks of him and Tesla CEO Elon Musk squaring off in a“cage match,”but the event never happened.  Zuckerberg and White are no strangers to each other, with WhitejoiningMeta’s board of directors in January. Both Zuckerberg and White are among the many high profile business figures within the orbit of President Donald Trump. After Trump won reelection in November,Zuckerberg dinedat the president-elect’s Mar-a-Lago club in Florida and Meta donated $1 million to Trump’sinauguration fund. Other Big Tech companies such as Amazon have donated similar amounts. Trump is a longtime UFC fan and frequent attendee of major fights. His ties with White date back to 2001, when White hosted a UFC at the Republican’s former casino-hotel in Atlantic City, New Jersey, the Trump Taj Mahal. Trump has also appeared with White at UFC matches over the years, especially in his 2024 campaign as part of efforts to appeal to younger male voters. White has had speaking roles at the 2016, 2020 and 2024 Republican conventions and appeared on stage at Trump’s election victory party in November. Shares of Meta Platforms Inc. rose slightly in midday trading, while shares of TKO Group Holdings Inc. climbed more than 2%.",
        "summary": "UFC and Meta, led by Mark Zuckerberg, have announced a partnership to enhance fan engagement and content distribution using Meta's technology platforms like Meta AI, Meta Glasses, Facebook, Instagram, WhatsApp, and Threads. The collaboration will involve incorporating Meta's AI glasses into UFC events and featuring exclusive UFC content on Meta's social media platform Threads. Dana White, UFC President, praised Meta's tech expertise, while Zuckerberg expressed excitement about exploring new ways for fans to experience the sport.",
        "sentiment": {
            "company": "meta",
            "score": 0.8
        },
        "tags": [
            "amazon",
            "meta",
            "tesla"
        ],
        "timestamp": "2025-04-02 12:06:36",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/france-apple-antitrust-fine-d993553dc64b56b69f5266cf1fe79d95",
        "source": "ap_news",
        "headline": "France’s antitrust watchdog fines Apple for problems with App Tracking Transparency",
        "content": "PARIS (AP) — France’s antitrust watchdog fined Apple 150 million euros ($162 million) on Monday over a privacy feature protecting users from apps snooping on them because its introduction resulted in abuse of competition law. The French Competition Authority said the aim of Apple’s App Tracking Transparency (ATT) requiring iPhone and iPad apps to ask users for permission before tracking them was not in itself open to criticism. But it ruled that the “way in which it was implemented was neither necessary nor proportionate to Apple’s stated objective of protecting personal data.” Applerolled out ATTstarting in April 2021 as part of an update to the operating system powering the iPhone and iPad. The feature forces apps to obtain permission before collecting data to target users with personalized ads. While the feature was designed to tighten up privacy, it faced criticism from Big Tech rivals that it would make it harder for smaller apps to survive without charging consumers. AP correspondent Charles de Ledesma reports France’s antitrust watchdog has fined Apple $162 million over a privacy feature protecting users from apps snooping on them. The fine, punishing Apple for abuse of its dominant position in mobile app distribution, covers the period from April 2021 to July 2023. But the amount is a pittance for the iPhone maker, which earned $124 billion in revenue in the final three months of last year. The watchdog said the feature’s rollout resulted in users being barraged by pop-ups from third-party apps requesting their consent. It bemoaned how the proliferation of these consent windows made it “excessively complex” for app users to navigate the iOS environment.  It also questioned the system’s neutrality, saying it penalized the smallest publishers, which depend to a large extent on the collection of third-party data to finance their activity. Apple said in a statement that ATT gives users more privacy control “through a required, clear, and easy-to-understand prompt about one thing: tracking.” “That prompt is consistent for all developers, including Apple, and we have received strong support for this feature from consumers, privacy advocates, and data protection authorities around the world,” the company said. “While we are disappointed with today’s decision, the French Competition Authority (FCA) has not required any specific changes to ATT.” AP Business Writer Kelvin Chan contributed from London.",
        "summary": "France's antitrust watchdog fined Apple 150 million euros for issues related to its App Tracking Transparency feature, which requires apps to ask for user permission before tracking them. The watchdog found that while the feature aimed to protect personal data, its implementation was deemed unnecessary and disproportionate. Apple's introduction of ATT faced criticism from Big Tech rivals and was accused of making it harder for smaller apps to survive without charging consumers.",
        "sentiment": {
            "company": "apple",
            "score": -0.5
        },
        "tags": [
            "microsoft",
            "apple"
        ],
        "timestamp": "2025-03-31 11:54:23",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/x-musk-sale-xai-b245f463076ac9b72c41f92160dc77eb",
        "source": "ap_news",
        "headline": "Elon Musk sells X to his own xAI for $33 billion in all-stock deal",
        "content": "Elon Musk has sold social media site X to his own xAI artificial intelligence company in a $33 billion all-stock deal, the billionaire announced on Friday. Both companies are privately held, which means they are not required to disclose their finances to the public. Musk said in a post on X that the move will “unlock immense potential by blending xAI’s advanced AI capability and expertise with X’s massive reach.” He said the deal values xAI at $80 billion and X at $33 billion. Musk, who serves as CEO of Tesla and SpaceX as well as an advisor to President Donald Trump, bought the site then called Twitter for $44 billion in 2022, gutted its staff and changed its policies on hate speech, misinformation and user verification and renamed it X. Helaunched xAIa year later. “xAI and X’s futures are intertwined. Today, we officially take the step to combine the data, models, compute, distribution and talent. This combination will unlock immense potential by blending xAI’s advanced AI capability and expertise with X’s massive reach,” Musk wrote on X. “The combined company will deliver smarter, more meaningful experiences to billions of people while staying true to our core mission of seeking truth and advancing knowledge.” It’s not clear if the move will change anything for X users — xAI already uses data from X user posts to train its artificial intelligence models and paying X users have access to its AI chatbot, Grok, while nonpaying users can ask the chatbot 10 questions every 2 hours. This story was first published on Mar. 28, 2025. It was updated on Mar. 29, 2025 to correct that Grok has already been available to X’s nonpaying users on a limited basis. An earlier version stated Grok had only been available to X users who paid for a subscription.",
        "summary": "Elon Musk has sold social media site X to his own xAI artificial intelligence company in a $33 billion all-stock deal. The move aims to combine xAI's advanced AI capability with X's massive reach, with Musk emphasizing the potential for delivering smarter and more meaningful experiences to billions of people. The deal values xAI at $80 billion and X at $33 billion.",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-29 13:12:20",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-iphone-second-quarter-earnings-70e4b60e081814ca11a75fe02622535b",
        "source": "ap_news",
        "headline": "Apple posts stronger-than-expected Q2 results, says majority of US iPhones sold will come from India",
        "content": "Apple CEO Tim Cook said Thursday that the majority of iPhones sold in the U.S. in the current fiscal quarter will be sourced from India, while iPads and other devices will come from Vietnam as the company works to avoid the impact of President Trump’s tariffs on its business. Apple’s earnings for the first three months of the year topped Wall Street’s expectations thanks to high demand for its iPhones, and the company said tariffs had a limited effect on the fiscal second quarter’s results. Cook added that for the current quarter, assuming things don’t change, Apple expects to see $900 million added to its costs as a result of the tariffs, but Cook said the company remains “confident” in this business. The Cupertino, California-based company earned $24.78 billion, or $1.65 per share, in the first three months of the year, up 4.8% from $23.64 billion, or $1.53 per share, in the same period a year earlier. Revenue rose 5.1% to $95.36 billion from $90.75 billion. Analysts, on average, were expecting earnings of $1.62 per share on revenue of $94.19 billion, according to a poll by FactSet. The numbers for the January-March period provide a snapshot of how Apple was faring before President Trump’s unveiling ofsweeping tariffs in Aprilthat rattled the financial markets amid fears a trade war would reignite inflation and shove the U.S. economy into a recession. “While it is likely that some of the sales growth was driven by consumers accelerating purchases ahead of expected tariff increases, margins remained healthy on the other side of the balance sheet,” said Thomas Monteiro, an analyst at Investing.com. He added that the company “still has room for maneuver” regardless of the economic backdrop and will “likely not need to significantly deplete cash reserves to keep moving the needle.”  Apple’sreliance on Chinese factoriesto make its iPhones and other devices thrust the technology trendsetter into the crosshairs of Trump’s trade war. The exposure caused Apple’s stock price to plunge 23% shortly after the president announced the severity of the reciprocal tariffs, temporarily erasing $773 billion in shareholder wealth in the process. Most of those losses have since been recovered after Trump temporarily exempted iPhones and other electronics from the reciprocal tariffs, but Apple’s stock remains down by nearly 5% since the April fusillade of tariffs. Besides the trade war, Apple has been hurt by its inability to live up to its own hype surrounding artificial intelligence features on the iPhone 16 lineup that came out last fall. The technology wasn’t ready when the iPhone 16 went on sale. Some AI features have rolled out in parts of the worldas part of software updates, but Apple still hasn’t been able to live up to its original promise to make Siri smarter and more versatile. The missteps prompted Apple to pull advertising campaigns promoting AI breakthroughs on the iPhone, although the company still intends to release more features powered by the technology at some point. Apple had been counting on its late entry into the AI craze to revive demand for the iPhone after last year’s sales dipped 2% from 2023’s levels. Apple said Wednesday that its phone sales climbed 1.9% to $46.84 billion for the first three months of the year. Wall Street had expected iPhone sales of $45.62 billion. But the company continues to see its China business decline, with revenue from the Greater China region down 2.3% to $16 billion for the quarter. Other regions, including the Americas, Europe and the rest of Asia, saw sales increases. When Trump initially indicated his 145% tariffs on Chinese-made goods would apply to the iPhone, U.S. consumers rushed to stores to buy new devices rather than risk prices spiking higher after the duties began driving up costs. But the flurry of panic buying won’t show up until Apple reports its results for the April-June quarter this summer. Trump’s trade war has ramped up the pressure on Cook to work the same diplomatic sleight of hand that enabled the iPhone to avoid being stung by the China tariffs that the president imposed during his first administration. Cook signaled his intention remain on good terms with Trump by arranging private meetings with him and personally donating $1 million to the president’s second inauguration ceremony beforesitting on the daiswhen Trump was sworn into office on January 20. Apple subsequentlyannounced plans to invest $500 billionin the U.S. while hiring 20,000 workers during the next four years. Trump’s trade war also is prompting a push to Apple to shift all the production of the iPhones that it sells in the U.S. from China to India, where the company has been building up its supply chain for the past seven years, according toa recent story in the Financial Times.But the complicated logistics of making such a huge move likely couldn’t be completed until next year, at the earliest, leaving Apple vulnerable to the vagaries of Trump’s trade war. Apple’s stock fell $5.81, or 2.7%, to $207.51 in after-hours trading.",
        "summary": "Apple reported stronger-than-expected Q2 results, with the majority of US iPhones sourced from India and iPads from Vietnam to avoid Trump's tariffs. Earnings for the first three months exceeded Wall Street's expectations, with limited impact from tariffs. Despite expecting $900 million in added costs due to tariffs, Apple remains confident in its business. Analysts view Apple as having room for maneuver and healthy margins, even amidst economic uncertainties.",
        "sentiment": {
            "company": "apple",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "apple",
            "leidos",
            "dupont",
            "broadcom"
        ],
        "timestamp": "2025-05-01 18:00:51",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/ai-artificial-intelligence-5dfa1da145689e7951a181e2253ab349",
        "source": "ap_news",
        "headline": "Visa wants to give artificial intelligence ‘agents’ your credit card",
        "content": "Artificial intelligence “agents” are supposed to be more than chatbots. The tech industry has spent monthspitching AI personal assistantsthat know what you want and can do real work on your behalf. So far, they’re not doing much. Visa hopes to change that by giving them your credit card. Set a budget and some preferences and these AI agents — successors to ChatGPT and its chatbot peers — could find and buy you a sweater, weekly groceries or an airplane ticket. “We think this could be really important,” said Jack Forestell, Visa’s chief product and strategy officer, in an interview. “Transformational, on the order of magnitude of the advent of e-commerce itself.” Visa announced Wednesday it is partnering with a group of leading AI chatbot developers — among them U.S. companies Anthropic, Microsoft, OpenAI and Perplexity, and France’s Mistral — to connect their AI systems to Visa’s payments network. Visa is also working with IBM, online payment company Stripe and phone-maker Samsung on the initiative. Pilot projects begin Wednesday, ahead of more widespread usage expected next year. The San Francisco payment processing company is betting that what seems futuristic now could become a convenient alternative to our most mundane shopping tasks in the near future. It has spent the past six months working with AI developers to address technical obstacles that must be overcome before the average consumer is going to use it. For emerging AI companies, Visa’s backing could also boost their chances of competing with tech giants Amazon and Google, which dominate digital commerce and are developing their own AI agents.  The tech industry is already full of demonstrations of the capabilities of what it calls agentic AI, though few are yet found in the real world. Most are still refashioned versions of large language models — thegenerative AI technologybehind chatbots that can write emails, summarize documents or help people code. Trained onhuge troves of data, they can scour the internet and bring back recommendations for things to buy, but they have a harder time going beyond that. “The early incarnations of agent-based commerce are starting to do a really good job on the shopping and discovery dimension of the problem, but they are having tremendous trouble on payments,” Forestell said. “You get to this point where the agents literally just turn it back around and say, ‘OK, you go buy it.’ Visa sees itself as having a key role in giving AI agents easier and trusted access to the cash they need to make purchases. “The payments problem is not something the AI platforms can solve by themselves,” Forestell said. “That’s why we started working with them.” The new AI initiative comes nearly a year after Visarevealed major changesto how credit and debit cards will operate in the U.S., making physical cards and their 16-digit numbers increasingly irrelevant. Many consumers are already getting used to digital payment systems such as Apple Pay that turn their phones into a credit card. A similar process of vetting someone’s digital credentials would authorize AI agents to work on a customer’s behalf, in a way Forestell says must assure buyers, banks and merchants that the transactions are legitimate and that Visa will handle disputes. Forestell said that doesn’t mean AI agents will take over the entire shopping experience, but it might be useful for errands that either bore some people — like groceries, home improvement items or even Christmas lists — or are too complicated, like travel bookings. In those situations, some people might want an agent that “just powers through it and automatically goes and does stuff for us,” Forestell said. Other shopping experiences, such as for luxury goods, are a form of entertainment and many customers still want to immerse themselves in the choices and comparisons, Forestell said. In that case, he envisions AI agents still offering assistance but staying in the background. And what about credit card debt? The credit card balances of American consumers hit $1.21 trillion at the end of last year, according to the Federal Reserve of New York. Forestell says consumers will give their AI agents clear spending limits and conditions that should give them confidence that the human is still in control. At first, the AI agents are likely to come back to buyers to make sure they are OK with a specific airplane ticket. Over time, those agents might get more autonomy to “go spend up to $1,500 on any airline to get me from A to B,” he said. Part of what is attracting some AI developers to the Visa partnership is that, with a customer’s consent, an AI agent can also tap into a lot of data about past credit card purchases. “Visa has the ability for a user to consent to share streams of their transaction history with us,” said Dmitry Shevelenko, Perplexity’s chief business officer. “When we generate a recommendation -- say you’re asking, ‘What are the best laptops?’ — we would know what are other transactions you’ve made and the revealed preferences from that.” Perplexity’s chatbot can already book hotels and make other purchases, but it’s still in the early stages of AI commerce, Shevelenko says. The San Francisco startup has also, along with ChatGPT maker OpenAI, told a federal court it would consider buying Google’s internet browser, Chrome, if the U.S. forces a breakup of the tech giant in apending antitrust case.",
        "summary": "Visa is partnering with leading AI chatbot developers to integrate artificial intelligence \"agents\" with credit card transactions. These AI agents, successors to chatbots like ChatGPT, will be able to make purchases on behalf of users based on set budgets and preferences. Visa sees this initiative as transformational, potentially revolutionizing e-commerce. The company is collaborating with tech giants like Microsoft, IBM, and Stripe on pilot projects starting this week, with broader implementation expected next year.",
        "sentiment": {
            "company": "visa",
            "score": 0.8
        },
        "tags": [
            "apple",
            "amazon",
            "visa",
            "mastercard",
            "openai",
            "walmart",
            "leidos",
            "samsung"
        ],
        "timestamp": "2025-04-30 16:05:43",
        "headline_tags": [
            "visa",
            "leidos"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-earnings-0c9702a96b50e943b0ed48bca980630c",
        "source": "ap_news",
        "headline": "Microsoft says quarterly profits up 18% as it weathers tech sector turbulence with cloud growth",
        "content": "REDMOND, Wash. (AP) — Microsoft’s cloud computing and artificial intelligence business helped deliver $70.1 billion in sales and boosted profits by 18% for the January-March quarter, a dose of relief for investors during a turbulent time for the tech sector and U.S. economy. The company reported quarterly net income of $25.8 billion, or $3.46 per share, beating Wall Street expectations for earnings of $3.22 a share. The Redmond, Washington-based software maker posted revenue of $70.1 billion in the period, its third fiscal quarter, up 13% from the same period a year ago and also beating Wall Street expectations. Analysts polled by FactSet expected Microsoft to post revenue of $68.44 billion for the quarter. Microsoft CEO Satya Nadella credited cloud growth for its strong quarter. The company’s cloud unit posted revenue of $26.8 billion, compared with expectations of $26.17 billion. “Cloud and AI are the essential inputs for every business to expand output, reduce costs, and accelerate growth,” Nadella said in a statement. The company also saw a 6% increase in revenue in its personal computing unit, which includes its laptop business and Xbox services. Nadella noted on a call with investors that demand for cloud and artificial intelligence remained strong. He said Microsoft is constantly tweaking its investments based on efficiency improvements in computing systems and what kind of services customers want.  “We just want to make sure we are accounting for the latest and greatest information,” he said. Microsoft is among a group of thetech industry’s bellwether companiesthat have been through a period of uncertainty and turmoil since President Donald Trump returned to the White House, with a see-sawing of stocks that has eviscerated trillions of dollars in shareholder wealth amid anonslaught of tariffsand other actions. Microsoft’s stock price has dropped nearly 8% since Trump’s inauguration in January, to about $395 at the close of markets Wednesday. But investors appeared pleased moments later after Microsoft released its earnings report, sending stocks up more than 6% in after-hours trading. Revenue from Microsoft’s cloud computing business segment grew 21%, to $26.8 billion, also beating Wall Street projections. The company felt more tariff uncertainty in its personal computing business, which is centered around its Windows operating system and the fees it collects from computer makers that put it on the hardware they sell. Revenue from that business was $13.4 billion for the quarter, up 6% from the first three months of last year.",
        "summary": "Microsoft reported a strong quarter with $70.1 billion in sales and an 18% increase in profits, driven by its cloud computing and artificial intelligence business. The company's quarterly net income of $25.8 billion exceeded Wall Street expectations, with revenue up 13% from the same period last year. CEO Satya Nadella credited cloud growth for the positive results, emphasizing the importance of cloud and AI for business expansion.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "apple",
            "leidos",
            "broadcom"
        ],
        "timestamp": "2025-04-30 19:04:27",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-europe-cloud-data-technology-feb82ae47eaa4d653727c3f4c38b0d74",
        "source": "ap_news",
        "headline": "Microsoft pledges to protect European operations and unveils data center expansion",
        "content": "LONDON (AP) — Microsoft pledged Wednesday to fight any U.S. government order to halt data center operations in Europe as it sought to soothe concerns among European customers that trans-Atlantic tensions would lead to service disruptions. The company’s president, Brad Smith, said it’s not something that officials are talking about in Washington, D.C. but it is a “real concern” for Microsoft’s customers across Europe, which include governments. President Donald Trump has stoked tensions between the U.S. and Europe with his tariff-fueled trade war, and alarmed European leaders with policy changes, includingpausing intelligence sharingwith Ukraine, that throw into doubt his administration’s commitment to the trans-Atlantic relationship. Smith, speaking at an event in Brussels, tried to allay concerns as he announced that the company was expanding data center operations across Europe. “What we want Europeans to know is that they can count on us,” he said in a speech. “In the unlikely event we are ever ordered by any government anywhere in the world to suspend or cease cloud operations in Europe, we are committing that Microsoft will promptly and vigorously contest such a measure using all legal avenues available, including by pursuing litigation in court,” Smith wrote in a Wednesday blog post. He noted that Microsoft has experience fighting lawsuits from the previous Trump administration as well as from former President Barack Obama’s administration.  “If we ever find ourselves losing we will put in place business continuity arrangements” that include storing computer code in Switzerland that European partners can access, he said. Microsoft is making five digital commitments to Europe, including increasing its data center capacity by 40% over the next two years and expanding data center operations in 16 countries, Smith said. He did not list the countries. The expansion will cost tens of billions of dollars annually. Smith declined to be more specific about the cost when asked by reporters. The expansion comes amid calls for Europe to assert tech and data sovereignty by weaning itself off reliance from big U.S. cloud data service providers, including Microsoft, Amazon and, to a lesser extent, Google. “Given recent geopolitical volatility, we recognize that European governments likely will consider additional options,” and Microsoft is committed to collaborating with European companies, Smith said.",
        "summary": "Microsoft has pledged to protect its European operations amidst concerns of potential disruptions due to trans-Atlantic tensions. The company's president, Brad Smith, reassured European customers by announcing an expansion of data center operations across Europe. Microsoft is committing to vigorously contest any government order to suspend cloud operations in Europe and is making significant digital commitments to the region, including increasing data center capacity by 40% over the next two years.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "amazon",
            "costco",
            "leidos"
        ],
        "timestamp": "2025-04-30 08:23:55",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/meta-artificial-intelligence-7ad0b5133b98c40e1877d2ea1f6b1d00",
        "source": "ap_news",
        "headline": "Meta launches AI app, Zuckerberg chats with Microsoft CEO Satya Nadella at developer conference",
        "content": "MENLO PARK, Calif. (AP) — Working to differentiate itself in the crowded field of artificial intelligence, Meta Platforms has launched a standalone AI app — with a social media component — to compete with OpenAI’s ChatGPT. The Meta AI app, built with the company’s Llama 4 AI system. It includes a “discover” feed that lets users see how others are interacting with AI. It also has a voice mode for interacting with the AI. “It’s smart for Meta to differentiate its ChatGPT competitor by drawing from the company’s social media roots. The app’s Discover feed is like a version of the OG Facebook Feed but only focused on AI use cases,” said Forrester research director Mike Proulx. By letting users link their Facebook and Instagram accounts, the Meta AI app “gets a leg up on instantly personalizing its user experience with social media context.” Meta has taken a different approach to AI than many of its rivals,releasing it for freeas an open-source product. The company says more than a billion people use its AI products each month. At the Menlo Park, California-based tech giant’s inaugural conference, LlamaCon, on Tuesday Meta CEO Mark Zuckerberg chatted with Microsoft CEO Satya Nadella in a technical discussion around the speed of AI development and how the technology is shifting both their companies — where AI is already writing code — as well as the world. Acknowledging there is a lot of “hype” around AI, Zuckerberg said “if this is going to lead to massive increases in productivity, that needs to be reflected in major increases in GDP.”  “This is going take some multiple years, many years, to play out,” Zuckerberg said. “I’m curious how you think, what’s your current outlook on what we should be looking for to understand the progress that this is making?” Nadella brought up the advent of electricity, saying that “AI has the promise, but you now have to sort of really have it deliver the real change in productivity — and that requires software and also management change, right? Because in some sense, people have to work with it differently.” He said it took 50 years before people figured out to change how factories operated with electricity. Zuckerberg replied “well we’re all investing as if it’s not going to take 50 years, so I hope it doesn’t take 50 years.”",
        "summary": "Meta Platforms has launched a new AI app with a social media component to compete with OpenAI's ChatGPT. The app, built with Meta's Llama 4 AI system, aims to differentiate itself in the AI space by leveraging social media roots. At the LlamaCon conference, Meta CEO Mark Zuckerberg discussed AI development with Microsoft CEO Satya Nadella, emphasizing the potential impact on productivity and GDP growth.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.6
        },
        "tags": [
            "microsoft",
            "meta",
            "openai",
            "broadcom"
        ],
        "timestamp": "2025-04-29 20:36:29",
        "headline_tags": [
            "microsoft",
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/openai-chatgpt-nonprofit-aad1fddb75a19008a1a349d1c972d476",
        "source": "ap_news",
        "headline": "Ex-OpenAI workers ask California and Delaware AGs to block for-profit conversion of ChatGPT maker",
        "content": "Former employees of OpenAI are asking the top law enforcement officers in California and Delaware to stop the company from shifting control of its artificial intelligence technologyfrom a nonprofit charityto a for-profit business. They’re concerned about what happens if the ChatGPT maker fulfills its ambition to build AI that outperforms humans, but is no longer accountable to its public mission to safeguard that technology from causing grievous harms. “Ultimately, I’m worried about who owns and controls this technology once it’s created,” said Page Hedley, a former policy and ethics adviser at OpenAI, in an interview with The Associated Press. Backed by three Nobel Prize winners and other advocates and experts, Hedley and nine other ex-OpenAI workers sent a letter this week to the two state attorneys general. The coalition is asking California Attorney General Rob Bonta and Delaware Attorney General Kathy Jennings, both Democrats, to use their authority to protect OpenAI’s charitable purpose and block its planned restructuring. OpenAI is incorporated in Delaware and operates out of San Francisco. OpenAI said in response that “any changes to our existing structure would be in service of ensuring the broader public can benefit from AI.” It said its for-profit will be a public benefit corporation, similar to other AI labs like Anthropic and tech billionaire Elon Musk’s xAI, except that OpenAI will still preserve a nonprofit arm. “This structure will continue to ensure that as the for-profit succeeds and grows, so too does the nonprofit, enabling us to achieve the mission,” the company said in a statement.  The letter is the second petition to state officials this month. The last came from a group of labor leaders and nonprofits focused on protecting OpenAI’s billions of dollarsof charitable assets. Jennings said last fall she would “review any such transaction to ensure that the public’s interests are adequately protected.” Bonta’s office sought more information from OpenAI late last year but has said it can’t comment, even to confirm or deny if it is investigating. OpenAI’s co-founders, including current CEO Sam Altman and Musk, originally started it as a nonprofit research laboratory on a mission to safely build what’s known asartificial general intelligence, or AGI, for humanity’s benefit. Nearly a decade later, OpenAI has reported its market value as $300 billion and counts 400 million weekly users of ChatGPT, its flagship product. OpenAI already has a for-profit subsidiary but faces a number of challenges in converting its core governance structure. One is alawsuit from Musk, who accuses the company and Altman of betraying the founding principles that led the Tesla CEO to invest in the charity. While some of the signatories of this week’s letter support Musk’s lawsuit, Hedley said others are “understandably cynical” because Musk also runs his own rival AI company. The signatories include two Nobel-winning economists, Oliver Hart and Joseph Stiglitz, as well as AI pioneers andcomputer scientists Geoffrey Hinton, who won last year’sNobel Prize in physics, and Stuart Russell. “I like OpenAI’s mission to ‘ensure that artificial general intelligence benefits all of humanity,’ and I would like them to execute that mission instead of enriching their investors,” Hinton said in a statement Wednesday. “I’m happy there is an effort to hold OpenAI to its mission that does not involve Elon Musk.” Conflicts over OpenAI’s purpose have long simmered at the San Francisco institute, contributing to Musk quitting in 2018, Altman’sshort-lived ouster in 2023and other high-profile departures. Hedley, a lawyer by training, worked for OpenAI in 2017 and 2018, a time when the nonprofit was still navigating the best ways to steward the technology it wanted to build. As recently as 2023, Altman said advanced AI held promise but also warned of extraordinary risks, from drastic accidents to societal disruptions. In recent years, however, Hedley said he watched with concern as OpenAI, buoyed by the success of ChatGPT, was increasingly cutting corners on safety testing and rushing out new products to get ahead of business competitors. “The costs of those decisions will continue to go up as the technology becomes more powerful,” he said. “I think that in the new structure that OpenAI wants, the incentives to rush to make those decisions will go up and there will no longer be anybody really who can tell them not to, tell them this is not OK.” Software engineer Anish Tondwalkar, a former member of OpenAI’s technical team until last year, said an important assurance in OpenAI’s nonprofit charter is a “stop-and-assist clause” that directs OpenAI to stand down and help if another organization is nearing the achievement of better-than-human AI. “If OpenAI is allowed to become a for-profit, these safeguards, and OpenAI’s duty to the public can vanish overnight,” Tondwalkar said in a statement Wednesday. Another former worker who signed the letter puts it more bluntly. “OpenAI may one day build technology that could get us all killed,” said Nisan Stiennon, an AI engineer who worked at OpenAI from 2018 to 2020. “It is to OpenAI’s credit that it’s controlled by a nonprofit with a duty to humanity. This duty precludes giving up that control.” ___ The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "summary": "Former employees of OpenAI are urging California and Delaware AGs to block the company's transition from a nonprofit to a for-profit entity, expressing concerns about accountability and potential risks associated with advanced AI technology. OpenAI plans to maintain a nonprofit arm alongside the for-profit structure, aiming to ensure public benefit from AI advancements. This move has sparked petitions and scrutiny from various groups, including labor leaders and nonprofits, seeking to safeguard OpenAI's charitable assets and mission. The company emphasizes that the restructuring is intended to benefit the broader public through AI innovation.",
        "sentiment": {
            "company": "openai",
            "score": 0.2
        },
        "tags": [
            "microsoft",
            "tesla",
            "openai",
            "leidos",
            "3m",
            "broadcom"
        ],
        "timestamp": "2025-04-23 05:02:48",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/openai-dolores-huerta-artificial-intelligence-nonprofit-5be2ce2185fb382a45e940426cd936d3",
        "source": "ap_news",
        "headline": "OpenAI picks labor icon Dolores Huerta and other philanthropy advisers as it moves toward for-profit",
        "content": "OpenAI has named labor leader Dolores Huerta and three others to a temporary advisory board that will help guide the artificial intelligence company’s philanthropy as it attempts to shift itself into a for-profit business. Huerta, who turned 95 last week, formedthe first farmworkers unionwith Cesar Chavez in the early 1960s and will now voice her ideas on the direction of philanthropic initiatives that OpenAI says will consider “both the promise and risks of AI.” The group will have just 90 days to make their suggestions. “She recognizes the significance of AI in today’s world and anybody who’s been paying attention for the last 50 years knows she will be a force in this conversation,” said Daniel Zingale, the convener of OpenAI’s new nonprofit commission and a former adviser to three California governors. Huerta’s advice won’t be binding but the presence of a social activist icon could be influential as OpenAI CEO Sam Altman attempts a costly restructuring of the San Francisco company’s corporate governance, which requires the approval of California’s attorney general and others. Another coalition of labor leaders and nonprofits recently petitioned state Attorney General Rob Bonta, a Democrat, to investigate OpenAI, halt the proposed conversion and “protect billions of dollars that are under threat as profit-driven hunger for power yields conflicts of interest.” OpenAI, the maker of ChatGPT, started out in 2015 as a nonprofit research laboratory dedicated to safely building better-than-human AI that benefits humanity.  It later formed a for-profit arm and shifted most of its staff there, but is still controlled by a nonprofit board of directors. It is now trying to convert itself more fully into a for-profit corporation butfaces a number of hurdles, including getting the approval of California and Delaware attorneys general, potentially buying out the nonprofit’s pricy assetsand fighting a lawsuitfrom co-founder and early investor Elon Musk. Backed by Japanese tech giant SoftBank, OpenAI last month said it’s working to raise $40 billion in funding, putting its value at $300 billion. Huerta will be joined on the new advisory commission by former Spanish-language media executive Monica Lozano; Robert Ross, the recently retired president of The California Endowment; and Jack Oliver, an attorney and longtime Republican campaign fundraiser. Zingale, the group’s convener, is a former aide to California governors including Democrat Gavin Newsom and Republican Arnold Schwarzenegger. “We’re interested in how you put the power of AI in the hands of everyday people and the community organizations that serve them,” Zingale said in an interview Wednesday. “Because, if AI is going to bring a renaissance, or a dark age, these are the people you want to tip the scale in favor of humanity.” The group is now tasked with gathering community feedback for the problems OpenAI’s philanthropy could work to address. But for California nonprofit leaders pushing for legal action from the state attorney general, it doesn’t alter what they view as the state’s duty to pause the restructuring, assess the value of OpenAI’s charitable assets and make sure they are used in the public’s interest. “As impressive as the individual members of OpenAI’s advisory commission are, the commission itself appears to be a calculated distraction from the core problem: OpenAI misappropriating its nonprofit assets for private gain,” said Orson Aguilar, the CEO and founding president of LatinoProsperity, in a written statement. ——————————- The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "summary": "OpenAI has appointed labor icon Dolores Huerta and three others to an advisory board to guide its philanthropic initiatives as it transitions into a for-profit entity. This move comes as OpenAI CEO Sam Altman undertakes a restructuring of the company's corporate governance. The presence of Huerta, a social activist, on the advisory board could carry significant influence. OpenAI, known for ChatGPT, is facing challenges in its conversion to a for-profit corporation, including regulatory approvals and legal battles.",
        "sentiment": {
            "company": "openai",
            "score": 0.2
        },
        "tags": [
            "openai",
            "leidos",
            "ge"
        ],
        "timestamp": "2025-04-16 15:47:25",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/robby-starbuck-meta-ai-delaware-eb587d274fdc18681c51108ade54b095",
        "source": "ap_news",
        "headline": "Conservative activist Robby Starbuck sues Meta over AI responses about him",
        "content": "LOS ANGELES (AP) — Conservative activist Robby Starbuck has filed a defamation lawsuit against Meta alleging that the social media giant’s artificial intelligence chatbot spread false statements about him, including that he participated in the riot at the U.S. Capitol on Jan. 6, 2021. Starbuck, known for targeting corporate DEI programs, said he discovered the claims made by Meta’s AI in August 2024, when he was going after “woke DEI” policies at motorcycle maker Harley-Davidson. “One dealership was unhappy with me and they posted a screenshot from Meta’s AI in an effort to attack me,” he said in a post on X. “This screenshot was filled with lies. I couldn’t believe it was real so I checked myself. It was even worse when I checked.” Since then, he said he has “faced a steady stream of false accusations that are deeply damaging to my character and the safety of my family.” The political commentator said he was in Tennessee during the Jan. 6 riot. The suit, filed in Delaware Superior Court on Tuesday, seeks more than $5 million in damages. In an emailed statement, a spokesperson for Meta said that “as part of our continuous effort to improve our models, we have already released updates and will continue to do so.” Starbuck’s lawsuit joins the ranks of similar cases in which people have sued AI platforms over information provided by chatbots. In 2023, a conservative radio host in Georgia filed a defamation suit against OpenAI alleging ChatGPT provided false information by saying he defrauded and embezzled funds from the Second Amendment Foundation, a gun-rights group.  James Grimmelmann, professor of digital and information law at Cornell Tech and Cornell Law School, said there is “no fundamental reason why” AI companies couldn’t be held liable in such cases. Tech companies, he said, can’t get around defamation “just by slapping a disclaimer on.” “You can’t say, ‘Everything I say might be unreliable, so you shouldn’t believe it. And by the way, this guy’s a murderer.’ It can help reduce the degree to which you’re perceived as making an assertion, but a blanket disclaimer doesn’t fix everything,” he said. “There’s nothing that would hold the outputs of an AI system like this categorically off limits.” Grimmelmann said there are some similarities between the arguments tech companies make in AI-related defamation and copyright infringement cases, like those brought forward by newspapers, authors and artists. The companies often say that they are not in a position to supervise everything an AI does, he said, and they claim they would have to compromise the tech’s usefulness or shut it down entirely “if you held us liable for every harmful, infringing output, it’s produced.” “I think it is an honestly difficult problem, how to prevent AI from hallucinating in the ways that produce unhelpful information, including false statements,” Grimmelmann said. “Meta is confronting that in this case. They attempted to make some fixes to their models of the system, and Starbuck complained that the fixes didn’t work.” When Starbuck discovered the claims made by Meta’s AI, he tried to alert the company about the error and enlist its help to address the problem. The complaint said Starbuck contacted Meta’s managing executives and legal counsel, and even asked its AI about what should be done to address the allegedly false outputs. According to the lawsuit, he then asked Meta to “retract the false information, investigate the cause of the error, implement safeguards and quality control processes to prevent similar harm in the future, and communicate transparently with all Meta AI users about what would be done.” The filing alleges that Meta was unwilling to make those changes or “take meaningful responsibility for its conduct.” “Instead, it allowed its AI to spread false information about Mr. Starbuck for months after being put on notice of the falsity, at which time it ‘fixed’ the problem by wiping Mr. Starbuck’s name from its written responses altogether,” the suit said. Joel Kaplan, Meta’s chief global affairs officer, responded to a video Starbuck posted to X outlining the lawsuit and called the situation “unacceptable.” “This is clearly not how our AI should operate,” Kaplan said on X. “We’re sorry for the results it shared about you and that the fix we put in place didn’t address the underlying problem.” Kaplan said he is working with Meta’s product team to “understand how this happened and explore potential solutions.” Starbuck said that in addition to falsely saying he participated in the the riot at the U.S. Capitol, Meta AI also falsely claimed he engaged in Holocaust denial, and said he pleaded guilty to a crime despite never having been “arrested or charged with a single crime in his life.” Meta later “blacklisted” Starbuck’s name, he said, adding that the move did not solve the problem because Meta includes his name in news stories, which allows users to then ask for more information about him. “While I’m the target today, a candidate you like could be the next target, and lies from Meta’s AI could flip votes that decide the election,” Starbuck said on X. “You could be the next target too.”",
        "summary": "Conservative activist Robby Starbuck has filed a defamation lawsuit against Meta, claiming that the social media giant's AI chatbot spread false statements about him, including his alleged involvement in the U.S. Capitol riot. Starbuck discovered these claims in August 2024 and has faced ongoing false accusations that have harmed his reputation. Meta has stated they are continuously improving their AI models. This lawsuit is part of a trend where individuals are suing AI platforms over inaccurate information provided by chatbots.",
        "sentiment": {
            "company": "meta",
            "score": -0.6
        },
        "tags": [
            "meta",
            "openai",
            "target",
            "leidos",
            "3m"
        ],
        "timestamp": "2025-04-30 17:08:30",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-epic-games-ruling-antitrust-violated-69b16572d2b2c990f6b69d4bbad9b57b",
        "source": "ap_news",
        "headline": "Court sides with Fortnite maker Epic as Apple sanctioned for defying order in App Store case",
        "content": "Apple says it plans to appeal a federal judge’s ruling that the iPhone maker willfully violated a court injunction in an antitrust case filed by Fortnite maker Epic Games. Apple, which reports its quarterly earnings Thursday, said it strongly disagrees with the decision. U.S. District Judge Yvonne Gonzalez Rogers had ordered Apple to lower the barriers protecting its previously exclusive payment system for in-app digital transactions and allow developers to display links to alternative options. On Wednesday she found that Apple violated a 2021 injunction that, she wrote, sought to “restrain and prohibit the iPhone maker’s anticompetitive conduct” and pricing. “Apple’s continued attempts to interfere with competition will not be tolerated,” Gonzalez Rogers said in the ruling, which held Apple in contempt. She ordered that Apple “no longer impede developers’ ability to communicate with users nor will they levy or impose a new commission on off-app purchases.” Epic CEO and founderTim Sweeney said on Xthe company will return Fortnite to Apple’s U.S. App Store next week. Apple did not immediately respond to a request for comment. Epic first filed an antitrust lawsuit in 2020 alleging that Apple had built an illegal monopoly around its popular App Store that makes billions of dollars annually from a then-exclusive payment system collecting commissions ranging from 15% to 30% on in-app commerce.  Although Gonzalez Rogers hadrejected the monopoly claims, she ordered Apple to lower the barriers protecting its previously exclusive payment system for in-app digital transactions and allow developers to display links to alternative options. TheSupreme Court rejected Apple’s appealin the case in January 2024. “In stark contrast to Apple’s initial in-court testimony, contemporaneous business documents reveal that Apple knew exactly what it was doing and at every turn chose the most anticompetitive option,” the judge wrote Wednesday. She accused the company’s Alex Roman, vice-president for finance, of “outright” lying under oath. “Internally, (longtime Apple executive) Phillip Schiller had advocated that Apple comply with the injunction, but (CEO) Tim Cook ignored Schiller and instead allowed Chief Financial Officer Luca Maestri and his finance team to convince him otherwise. Cook chose poorly,” Gonzalez Rogers wrote. The judge referred the matter to the U.S. Attorney for the Northern District of California to investigate whether criminal contempt proceedings are appropriate.",
        "summary": "Apple has been sanctioned for defying a court order in the ongoing App Store case with Fortnite maker Epic Games. The court ruled that Apple willfully violated the injunction by maintaining anticompetitive practices. Despite Apple's plan to appeal the decision, the judge emphasized that interference with competition will not be tolerated. Epic Games CEO announced that Fortnite will be returning to Apple's U.S. App Store soon.",
        "sentiment": {
            "company": "apple",
            "score": -0.6
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-05-01 14:55:48",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/colombia-social-media-rebels-united-nations-6b2a8f1577709c35d5388bcb767a6fc3",
        "source": "ap_news",
        "headline": "Rebels in Colombia are recruiting youth on social media. The UN wants TikTok and Facebook to do more",
        "content": "BOGOTA, Colombia (AP) — Rebel groups in Colombia are using apps like Facebook and Tik Tok to recruit children and young adults, and social media companies must do more to moderate content, the United Nations says. The U.N.'s top human rights official in Colombia, Scott Campbell, in an interview with The Associated Press said more investment is needed in both automated tools and human moderators to take down videos posted by gangs and rebel groups that are targeting youth from marginalized communities. Colombian rebel groups such as the FARC-EMC are increasingly posting videos that glamorize life in their ranks and urge youth to enlist. “These companies are not putting enough resources into online content moderation in the global south,” Campbell said, calling Colombia an example of how “grave” the threat can be for children and Indigenous communities. He said companies take more action in the global north, where they feel the most political pressure. Campbell, who previously served as a human rights and technology specialist at the U.N.’s Geneva office, said he recently met with representatives from Meta, which owns Facebook, to discuss how rebel groups and gangs can be stopped from using the company’s platforms to recruit young people. He said the company pledged to work on the problem, and added that he is also seeking a meeting with TikTok representatives.  In an email, a TikTok spokesperson said the company has developed community guidelines that include not allowing hateful or violent organizations on its platform. The company said if it notices that these organizations are using its platform, or if suspicious accounts are flagged by users who contact its help center, it will review accounts and delete them. TikTok also said it has been working closely with police in Colombia and with the army to identify and shut down accounts that violate community guidelines. In a separate email, Meta said the company has a policy of banning terrorist organizations from using its platforms and that it is collaborating with law enforcement to fight efforts to recruit children. “We also collaborate with other companies to share information and take actions against these evolving threats across the internet,” Meta said. The recruitment of children has become a major problem in rural areas of Colombia that are disputed by the military, drug gangs and rebel groups. According to Colombia’s Human Rights Ombudsman, 409 children under 18 were recruited into rebel groups in the South American nation last year, twice as many as in 2023. The U.N. recorded 216 cases of forced recruitment of minors in Colombia last year. The problem has been particularly striking in Cauca province in the southwest, where fighting has intensified as rebel groups try to fill a power vacuum left by the Revolutionary Armed Forces of Colombia, the guerrilla group that made peace with the government in 2016. Anyi Zapata, a humans rights specialist with ACIN, an Indigenous association in Cauca, said rebel groups there have long targeted vulnerable children, offering them money to do small favors and gifts like cellphones. Now they are posting videos on social media that show members with motorcycles, SUVs and adventurous lifestyles. One TikTok account recently featured a video of a man on a motorcycle wearing camouflage, with the caption: “Join me and you will know friendship without hypocrisy.” The images often show logos of rebel groups. Campbell said that even when accounts are taken down, they can be replaced by others. He said social media companies need to share their information on such accounts with Colombian prosecutors, who can file charges against people posting the content. “It’s difficult to get the balance right between freedom of expression and legitimate speech, while pulling down content that is clearly illegal and can cause harm,” Campbell said.",
        "summary": "Rebel groups in Colombia are using social media platforms like Facebook and TikTok to recruit children and young adults, prompting the United Nations to urge these companies to enhance content moderation efforts. The UN's top human rights official in Colombia emphasized the need for more resources in automated tools and human moderators to combat the spread of videos glamorizing life in rebel ranks. Meta, the parent company of Facebook, has pledged to address this issue, along with TikTok, which has developed community guidelines to prevent the presence of hateful or violent organizations on its platform.",
        "sentiment": {
            "company": "meta",
            "score": 0.2
        },
        "tags": [
            "meta",
            "ge"
        ],
        "timestamp": "2025-04-30 20:14:05",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/google-internet-medical-advice-9d4c56da3e598e694b2cf99b4eb5b71b",
        "source": "ap_news",
        "headline": "What’s that rash? Put some thought into asking Google for medical help",
        "content": "Dr. Google is often on call for worried patients, but it may not give the best advice. Doctors say internet searches for medical information should be done cautiously, especially with artificial intelligence playing a growing role. Information from the right websites can teach patients about symptoms and prepare them for a doctor’s visit. But a poorly done search might inflame anxiety well before someone reaches the waiting room. It’s important to know the source of the information you find and to avoid trying to diagnose yourhealthissue. Here are questions to keep in mind if you seek medical help online. When you do a search, don’t automatically click the first link. It may not contain the best answers. Some companies pay to have their websites listed at the top of a results page. Those links may be listed as sponsored. Scroll for results that come from a source you can trust for medical information. That can include big health systems like the Mayo Clinic or sites run by government agencies like the Centers for Disease Control and Prevention. “We’ve gotten so used to clicking on that first link,” says John Grohol, a psychologist who specializes in online behavior. “For your health information, especially when it is personal, you want to think about it.”  That depends on what it tells you. More people are using artificial intelligence to get quick answers pulled from a variety of internet sources. Some searches also will generate an AI summary at the top of the results page. But an AI answer may not say where it got the information. That makes it hard to judge credibility. AI also can be prone to “hallucinations,” an industry term for issues that cause the technology to make stuff up. Be especially wary of this if no source is cited. How you phrase a question plays a big role in the results you see. Doctors say patients should search for information based on symptoms, not an expected diagnosis. “You’ve got to ask at the very beginning the right questions,” said Dr. Eric Boose of the Cleveland Clinic. That means asking, “What could cause a lump to form under my skin?” instead of “Is the lump under my skin cancer?” Focusing on a diagnosis means you may miss other explanations, especially if you just click the first few links listed in the results. For some issues, you should skip the search altogether. If you are having chest pains, experiencing dizziness of showing signs of a stroke, seek help immediately. “You don’t want to delay something that should be treated within a certain amount of time,” said Dr. Olivier Gherardi, medical director of Brown University Health Urgent Care. No. Leave that to the real doctors who are trained to ask questions that lead to a diagnosis. Blood in your urine could mean cancer. It also might be caused by kidney stones or an infection. Unexplained weight loss also could be a sign of cancer. Or it could reflect an overactive thyroid or a new job that causes you to move around more. Some testing and a visit with a doctor who knows your medical history may be the best medicine in these situations. “There are a lot of symptoms that overlap between minor conditions and major medical problems,” said Dr. Sarah Sams, a board member with the American Academy of Family Physicians. ____ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content.",
        "summary": "The article discusses the importance of being cautious when seeking medical information online, particularly through search engines like Google. It emphasizes the need to verify the credibility of sources and avoid self-diagnosing based on search results. The role of artificial intelligence in providing quick answers is highlighted, with a warning about potential inaccuracies and lack of transparency in sourcing. Overall, the article advises users to be mindful of the information they find online and to approach medical searches with care.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.1
        },
        "tags": [
            "alphabet",
            "leidos"
        ],
        "timestamp": "2025-04-30 09:56:49",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/samsung-earning-smartphones-11323e2b04a587aa8dd152adfbab8d06",
        "source": "ap_news",
        "headline": "Samsung reports revenue increase thanks to mobile phone sales but its chip business suffers",
        "content": "SEOUL, South Korea (AP) — Samsung Electronics reported Wednesday a sharp increase in consolidated revenue for the first quarter thanks to strong sales of its new smartphones, but its semiconductor business suffered a setback. The South Korean semiconductor and smartphone giant said in a statement that it posted 79.14 trillion won ($56 billion) in consolidated revenue for the January-March quarter, calling it an all-time quarterly high. It said its operating profit rose to 6.7 trillion won ($4.7 billion), up from 6.61 trillion won ($4.6 billion) in the same period last year. Samsung attributed the results to strong sales of its flagship Galaxy S25 smartphone and other high-value-added products. However, the operating profit of the company’s semiconductor business fell to 1.1 trillion won ($774 million) from 1.91 trillion won ($1.3 billion) in the corresponding quarter last year. The company said its profits were squeezed by falling average sale prices, as well as reduced demand for high-bandwidth memory as customers wait for the release of next-generation memory chips.",
        "summary": "Samsung Electronics reported a record high consolidated revenue of 79.14 trillion won in the first quarter, driven by strong sales of its new smartphones like the Galaxy S25. However, the semiconductor business faced challenges with operating profit dropping to 1.1 trillion won due to lower prices and reduced demand for high-bandwidth memory chips.",
        "sentiment": {
            "company": "samsung",
            "score": -0.2
        },
        "tags": [
            "dupont",
            "samsung"
        ],
        "timestamp": "2025-04-30 05:25:28",
        "headline_tags": [
            "samsung"
        ]
    },
    {
        "url": "https://apnews.com/article/spain-power-outage-france-portugal-europe-grid-electricity-f091ffd3e51dfd3612edb2389eac1e11",
        "source": "ap_news",
        "headline": "What we know about Monday’s sweeping power outage in Spain and Portugal",
        "content": "MADRID (AP) — The sweepingpower outagethat hit Spain and Portugal this week has raised questions about the electricity grid in a region not normally known for blackouts. Monday’s outage, one of the worst ever in Europe,started in the afternoonand lasted through nightfall, affectingtens of millions of peopleacross the Iberian Peninsula. It disrupted businesses, hospitals,transit systems,cellular networks and other critical infrastructure. Authorities in Spain and Portugal are still investigating exactly what caused the failure, though some information has emerged about happened. Here’s what to know: Spain and Portugal lost most of their electricity early Monday afternoon. Shortly after 12:30 p.m. local time, Spain lost 15 gigawatts of electricity — or roughly 60% of demand in the country of 49 million, Prime Minister Pedro Sánchez said. There had been two significant “disconnection events” — or interruptions in power — before the outage, Spain’s electric grid operator Red Eléctrica de España said Tuesday. While Spain’s grid managed to recover from the first event, systems operations director Eduardo Prieto said that the second was more damaging, progressing to the point of interruptions from France’s electrical system and producing “a massive, temporary disconnection.” About three hours before the outage, power quality sensors in homes in the Madrid area showed warning signs of an unstable grid — there were small fluctuations in voltage around 9:30 a.m. local time, Whisker Labs CEO Bob Marshall said Tuesday. The Maryland-based software developer has a couple dozen sensors in homes in and around Madrid, testing the technology for use in Europe for home fire prevention and grid monitoring.  Instead of normal, steady voltage, Marshall said the data shows there were oscillations whose frequency and magnitude increased over the next three hours until the grid failed. He does not know what caused the instability. Around noon, there was a big jump in the magnitude of the fluctuations, with the voltage measured going up and down by about 15 volts every 1.5 seconds, Marshall said. “The way I would interpret our data,” Marshall said about Monday’s events, “is that the grid is struggling. Something’s wrong. And it’s showing increasing signs of instability.” Passengers crowd the train accesses at Sants train station in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  We don’t know exactly what caused Monday’s fluctuations and eventual failure. “There’s a variety of things that usually happen at the same time, and it’s very difficult for any event to say ‘this was the root cause,’” said Eamonn Lannoye, managing director at the Electric Power Research Institute, Europe. Lannoye said there was a range of events that can explain grid failures, including that electric grid lines or generators are switched off in some locations for maintenance. “This could be a really complex event, I think it’s fair to say,” Lannoye said. A man sells battery-powered radios and torches on a Barcelona street during the blackout in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  Power outages can have several triggers, including natural disasters and extreme weather, human-caused disasters, equipment failures, overloading transformers and wires and so on. Electric grids are sensitive to imbalances in the amount of energy generated versus what’s used. Enric Bartlett, an energy expert and professor of public law at Spain’s Esade business school, likened a grid’s supply and demand balance to a tandem bike. “To avoid falling, everyone must pedal at the same cadence,” Bartlett said. “Electrical grids are large interconnected systems, and their stability is related to a very close balance between electricity generation and demand,” said Grazia Todeschini, an engineering researcher at King’s College London. “If one area is disconnected, it can cause knock-on effects in nearby areas,” she said, adding that while grids have measures in place to limit the impact of outages to small areas, when the imbalance is large, disruptions can spread quickly and far. Paquita Gonzalez cries as she waits for news of train departures, after spending the whole night at the station in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  Authorities in Spain and Portugal have downplayed the idea that a cyberattack was responsible. Spain’s High Court said it would investigate to find the cause. On Tuesday, there was renewed attention on Spain’s renewable energy generation. The southern European nation is a leader in solar and wind power generation, with more than half of its energy last year having come from renewable sources. Portugal also generates a majority of its energy from renewable sources. Questions remain about whether Spain’s heavy renewable energy supply may have made its grid system more susceptible to the type of outage that took place Monday. The thinking goes that non-renewable energy sources, such as coal and natural gas, can better weather the type of fluctuations observed Monday on Spain’s grid. That is because renewable energies like solar and wind provide intermittent supply, relying on when the sun is shinning and wind is blowing. However, in recent years batteries that store energy, along with other methods, have helped regulate changes in electricity supply from renewables. Lannoye said it was too early to draw a straight line between Monday’s event and Spain’s solar power generation. “I think there’s some putting the cart before the horse to say this was solar,” Lannoye said, simply because there was solar power on the grid at the time of the disruption. Passengers react as they wait for news of train departures, at Sants train station in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  Europe’s electric grid is highly connected, meaning that it can pool power between countries. That can make the system more resilient, experts say. It also means a disruption in a major transmission artery or frequency imbalance can trigger cascading protective shutdowns across countries, according to Shreenithi Lakshmi Narasimhan, member of the Institute of Electrical and Electronics Engineers. Spain and Portugal are connected to Europe’s main electric grid through France. Spain’s grid operator on Tuesday said that the sudden drop in power caused an interconnector between Spain and France to trip. ___ Jennifer McDermott contributed to this report from Providence, Rhode Island.",
        "summary": "A sweeping power outage in Spain and Portugal affected tens of millions of people, disrupting businesses, hospitals, transit systems, and cellular networks. The outage, one of the worst in Europe, started in the afternoon and lasted through nightfall. Authorities are investigating the cause of the failure, with initial reports mentioning significant disconnection events and warning signs of an unstable grid prior to the outage.",
        "sentiment": {
            "company": "ge",
            "score": 0.0
        },
        "tags": [
            "amazon",
            "exxon",
            "chevron",
            "nextera",
            "bp",
            "ge",
            "dupont",
            "broadcom"
        ],
        "timestamp": "2025-04-30 07:03:20",
        "headline_tags": [
            "ge"
        ]
    },
    {
        "url": "https://apnews.com/article/toyota-autonomous-waymo-selfdrivingcars-technology-1a290270bf3aa8be75a05739653396ee",
        "source": "ap_news",
        "headline": "Japan’s Toyota starts collaborating with self-driving leader Waymo on autonomous cars",
        "content": "TOKYO (AP) — Japan’s top automaker Toyota announced a partnership with U.S. autonomous driving technology company Waymo on Wednesday. The move was somewhat anticipated, as the use of such technology speeds up around the world, andToyota Motor Corp.has been aggressive about its intention to stay on top of such advances. “Toyota is committed to realizing a society with zero traffic accidents and becoming a mobility company that delivers mobility for all. We share a strong sense of purpose and a common vision with Waymo in advancing safety through automated driving technology,” Toyota Executive Vice President Hiroki Nakajima said in a statement. Waymo, which started out as the Google Self-Driving Car Project in 2009,now offers fully autonomous ride-hailing services in San Francisco, Phoenix, Los Angeles and Austin, and is rolling them out in other U.S. cities. It also has a partnership withride-hailing leader Uber. Toyota hasbuilt a city, complete with streets and housing, near Mount Fuji called Woven Cityto test robotics, artificial intelligence and autonomous zero-emissions transportation. The maker of the Camry sedan and Lexus luxury models tends to be very cautious about rolling out auto technology, seeking to protect its reputation as a safe and environmentally conscious manufacturer. Tekedra Mawakana, co-CEO at Waymo, said partners were key to winning trust.  “This requires global partners like Toyota that share our commitment to improving road safety and expanding accessible transportation,” Mawakana said. Details of the terms of the deal were not disclosed. Both sides said they were still exploring how their collaboration might develop into actual products. Although there are various test versions of fully autonomous vehicles in Japan, they are for now limited to certain restricted areas.Other companies and automakers are working on similar services, including public transportation. ___ Yuri Kageyama is on Threads:https://www.threads.com/@yurikageyama",
        "summary": "Toyota has announced a partnership with Waymo, a leading autonomous driving technology company in the U.S., to collaborate on autonomous cars. Toyota aims to stay ahead in technological advancements and prioritize safety in its mobility solutions. The partnership with Waymo aligns with Toyota's vision of zero traffic accidents and expanding accessible transportation.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.8
        },
        "tags": [
            "apple",
            "alphabet",
            "toyota",
            "leidos",
            "siemens",
            "3m"
        ],
        "timestamp": "2025-04-29 21:41:37",
        "headline_tags": [
            "alphabet",
            "toyota"
        ]
    },
    {
        "url": "https://apnews.com/article/blackout-how-to-prepare-crisis-spain-portugal-792f7ce86ba8e90392240704abb3f103",
        "source": "ap_news",
        "headline": "Power outages across Spain and Portugal affected millions. How to prepare for a major blackout",
        "content": "BUDAPEST, Hungary (AP) — Anunprecedented blackoutacross Spain and Portugal upended the lives of millions across the Iberian Peninsula, a stark reminder of modern society’s reliance on electricity, and how quickly life can descend into chaos when the grid goes down. Power wasnearly completely restoredacross the region on Tuesday, but the cause of the previous day’s blackout remains unclear. For those affected, the experience will likely leave a lasting impression and raise questions on how to respond if another crisis emerges. While such widespread failures of power grids are rare, having a plan for how to react to such an event — and how to prepare ahead of time — can make a major difference in staying safe and managing the disruption if the lights go out. A man sells battery-powered radios and torches on a Barcelona street during the blackout in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  A general power outage affects everyone whether they are at home, at work or on the move. As in Spain and Portugal, electric trains, trolleys and subway systems can stop in their tracks and strand passengers, while traffic lights can go down turning roads into a snarl of gridlock. No matter where you are when the power goes down, your first priority should be to remain calm and tend to your most immediate needs like food, water and shelter, and develop a plan for how you can get to a safe place and connect with your loved ones. According to the American Red Cross, unnecessary travel, especially by car, should be avoided during a power outage. Without traffic lights, roads may become congested or hazardous, increasing the risk of becoming stranded.  An electric tram drives uphill in Lisbon, Tuesday, April 29, 2025, the day after a nationwide power outage that stopped trams, trains and subways. (AP Photo/Armando Franca)  If you are at home, exercise caution when using candles or gas lanterns for light because of the risk of fire and noxious gases like carbon monoxide. Use battery-powered lanterns or flashlights if available, but conserve batteries to extend their working life. Turn off any unnecessary electronics, and unplug appliances such as ovens or stoves that were in use when the power went out. If the power comes back on, surges can damage equipment and appliances can be hazardous if allowed to run unattended. If the outage lasts for more than a few hours, you’ll want to ensure the food you have on hand doesn’t spoil. According to emergency guidelines published by the Estonian government, refrigerators and freezers should be opened only briefly to preserve the cold. Use perishable food from the fridge first, followed by items in the freezer, then nonperishables. Passengers react as they wait for news of train departures, at Sants train station in Barcelona, Spain, Tuesday, April 29, 2025. (AP Photo/Emilio Morenatti)  Preparedness, “be it psychological or real preparedness in case of crisis,” is a key factor in successfully managing disruptive events, Argo Kerb from the Estonian Rescue Board, a government agency, told The Associated Press. As concerns grow around the world over instability stemming from armed conflict, political discord and climate change, many governments are prioritizing crisis preparedness among their populations. In March, the European Union urged all 450 million residents of the 27-nation blocto stockpile food, water and other essentialsto last at least 72 hours as war, cyberattacks, climate change and disease increase the chances of a crisis. According to Kerb: “Preparedness is a shared responsibility. It’s a shared responsibility in a family, in a country, but it’s also a shared responsibility in Europe and the world.” While long-lasting power outages such as the one in Spain and Portugal are relatively uncommon, having a few basic supplies on hand can make a substantial difference in how safely and comfortably they can be endured. People queue for petrol in Lisbon, Tuesday, April 29, 2025, the day after a nationwide power outage that shut down gas stations, trains and subways. (AP Photo/Armando Franca)  The EU recommends food, water, flashlights, ID papers, medicine and shortwave radios as things to have at home. Matches or lighters, chargers and a power bank for your devices are also recommended. In a sign of how critical access to information can be in an emergency, battery-powered radios flew off the shelves in Spain and Portugal as internet and cellphone services went down. Keeping a supply of batteries, and a battery powered or hand-crank radio, will help keep you connected to vital information when internet and television services are down. If you’re caught without these items during a crisis, you’ll need to buy them, but outages can leave electronic payments unavailable. You’ll want to make sure you keep a reasonable quantity of cash on hand. As European commissioner for crisis management Hadja Lahbib said in a recent video urging preparedness: “In the middle of a crisis, cash is king, and your credit card might just be a piece of plastic.” In abrochure provided to every household in Sweden, “In Case of Crisis or War,” the Swedish government says each person will need at least three liters (nearly a gallon) of water per day for drinking and cooking, which should be stored at home in bottles or other containers. It also recommends keeping extra warm bedding like sleeping bags and blankets on hand in case services are interrupted during cold weather. If you have a portable generator, strictly follow its instructions and never run it indoors or in enclosed spaces as it produces lethal carbon monoxide gas. Plug the devices you want to power directly into the generator, and never attempt to wire it to your home’s electrical system. ___ Emma Burrows contributed to this report from London.",
        "summary": "An unprecedented blackout affected millions across Spain and Portugal, highlighting society's reliance on electricity. Power was nearly completely restored, but the cause of the blackout remains unclear. The event serves as a reminder to have a plan in place for such emergencies to stay safe and manage disruptions effectively.",
        "sentiment": {
            "company": "ge",
            "score": 0.2
        },
        "tags": [
            "apple",
            "ge"
        ],
        "timestamp": "2025-04-29 08:24:13",
        "headline_tags": [
            "ge"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-ula-project-kuiper-spacex-starlinks-1a1c53a6a44f3f9bd9426bb1f56405c9",
        "source": "ap_news",
        "headline": "Amazon launches its first internet satellites to compete against SpaceX’s Starlinks",
        "content": "CAPE CANAVERAL, Fla. (AP) — Amazon’s first batch ofinternet satellitesrocketed into orbit Monday, the latest entry in the mega constellation market currently dominated by SpaceX’sthousands of Starlinks. The United Launch Alliance’s Atlas V rocket carried up 27 of Amazon’s Project Kuiper satellites, named after thefrigid fringesof our solar systembeyond Neptune. Once released in orbit, the satellites will eventually reach an altitude of nearly 400 miles (630 kilometers). Two test satellites were launched in 2023, also by an Atlas V. Project officials said major upgrades were made to the newest version. The latest satellites also are coated with a mirror film designed to scatter reflected sunlight in an attempt to accommodate astronomers. Stargazers oppose the fast-growing constellations of low-orbiting satellites, arguing they spoil observations. Others fear more satellite collisions. Founded byJeff Bezos, who now runs his own rocket company, Blue Origin, Amazon aims to put more than 3,200 of these satellites into orbit to provide fast, affordable broadband service around the globe. Elon Musk’s SpaceX already has launched more than 8,000 Starlinks since 2019. The company marked its 250th Starlink launch Sunday night. More than 7,000 Starlinks are still in orbit some 300-plus miles (550 kilometers) above Earth. The European-based OneWeb satellite constellation numbers in the hundreds in an even higher orbit.  Amazon already has purchased dozens of rocket launches from United Launch Alliance and Blue Origin for Project Kuiper, as well as others. “There are some things you can only learn in flight” despite extensive testing on the ground, said Rajeev Badyal, the project’s vice president. “No matter how the mission unfolds, this is just the start of our journey,” he said in a statement ahead of the evening liftoff. The first liftoff attempt earlier this month was nixed by bad weather. It took until now to secure another spot in the launch lineup at Cape Canaveral Space Force Station. ___ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
        "summary": "Amazon launched its first batch of internet satellites, Project Kuiper, into orbit to compete with SpaceX's Starlinks. The United Launch Alliance's Atlas V rocket carried 27 satellites, with plans to deploy over 3,200 for global broadband service. The satellites are designed to scatter sunlight to accommodate astronomers' concerns. Amazon has purchased rocket launches from Blue Origin and United Launch Alliance for Project Kuiper.",
        "sentiment": {
            "company": "amazon",
            "score": 0.7
        },
        "tags": [
            "amazon",
            "visa",
            "nextera",
            "bp",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris"
        ],
        "timestamp": "2025-04-29 05:52:13",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/nsf-cuts-science-funding-dei-trump-misinformation-ai-e989c978f273fb1a94c2e47b78843d64",
        "source": "ap_news",
        "headline": "Trump science cuts target bird feeder research, AI literacy work and more",
        "content": "Ashley Dayer’s dream of winning a National Science Foundation grant to pursue discoveries in bird conservation started when she was an early-career professor with an infant in her arms and a shoestring laboratory budget. Competition is intense for NSF grants, a key source of funding for science research at U.S. universities. It took three failed applications and years of preliminary research before the agency awarded her one. Then came a Monday email informing Dayer that President Donald Trump’s administration was cutting off funding, apparently because the project investigating the role of bird feeders touched on themes of diversity, equity and inclusion. “I was shocked and saddened,” said Dayer, a professor at Virginia Tech’s department of fish and wildlife conservation. “We were just at the peak of being able to get our findings together and do all of our analysis. There’s a lot of feelings of grief.” Hundreds of other university researchers had their National Science Foundation funding abruptly canceled Friday to comply with Trump’s directives to end support of research on diversity, equity and inclusion, as well as the study of misinformation. It’s the latest front in Trump’santi-DEI campaignthat has alsogone afteruniversity administrations,medical researchand the private sector. The NSF’s director, Sethuraman Panchanathan, defended the agency’s priorities but thenquit on Thursday, saying he had “done all I can to advance the critical mission of the agency.”  More than 380 grant projects have been cut so far, including work to combat internet censorship in China and Iran and a project consulting with Indigenous communities to understand environmental changes in Alaska’s Arctic region. One computer scientist was studying how artificial intelligence tools could mitigate bias in medical information, and others were trying to help people detect AI-generated deepfakes. A number of terminated grants sought to broaden the diversity of people studying science, technology and engineering. NSF, founded in 1950, has a $9 billion budget that can be a lifeline for resource-strapped professors and the younger researchers they recruit to their teams. It has shifted priorities over time but it is highly unusual to terminate so many midstream grants. Some scientists saw the cuts coming, after Republican U.S. Sen. Ted Cruz last year flagged thousands of NSF-funded projects he says reflected a “woke DEI” or Marxist agenda, including some but not all of the projects cut Friday. Still, Dayer said she was “incredibly surprised” that her bird project was axed. A collaboration with other institutions, including the Cornell Lab of Ornithology, it tapped into Project Feederwatch, a website and app for sharing bird observations. Dayer’s team had collected data from more 20,000 Americans on their birdwatching habits, fielding insights on how outdoor feeders were affecting wildlife, but also people’s mental well-being. The only mention of the word “diversity” in the grant abstract is about bird populations, not people. But the project explicitly sought to engage more disabled people and people of color. That fit with NSF’s longtime requirement that funded projects must have a broad impact. “We thought, if anything, maybe we’d be told not to do that broader impacts work and to remove that from our project,” Dayer said. “We had no expectation that the entire grant would be unfunded.” On the day the grants were terminated, Panchanathan, the NSF’s director since 2020, said on the agency’s website that it still supported “research on broadening participation” but those efforts “should not preference some groups at the expense of others, or directly/indirectly exclude individuals or groups.” Less than a week later, Panchanathan had announced his resignation. The NSF declined to share the total number of canceled grants, but Trump’s Department of Government Efficiency, run by billionaire Elon Musk, posted on X that NSF had canceled “402 wasteful DEI grants” amounting to $233 million. It didn’t say how much of that had already been spent. Grants typically last for several years. Caren Cooper, a North Carolina State University professor of forestry and natural resources, said she expected her work would be targeted after it made Cruz’s list. Her grant project also sought to include people of color and people with disabilities in participatory science projects, in collaboration with the Audubon Society and with the aim of engaging those whohave historically been excludedfrom natural spaces and birdwatching groups. One doctoral student had left her job and moved her family to North Carolina to work with Cooper on a stipend the grant helped to fund. “We’ve been trying to make contingency plans,” Cooper said. “Nonetheless, it’s an illegal thing. It’s violating the terms and conditions of the award. And it really harms our students.” Along with eliminating DEI research, NSF said it will no longer “support research with the goal of combating ‘misinformation,’ ‘disinformation,’ and ‘malinformation’ that could be used to infringe on the constitutionally protected speech rights of American citizens across the United States in a manner that advances a preferred narrative about significant matters of public debate.” Several researchers said they weren’t sure why their funding was terminated, other than that their abstracts included terms like “censorship” or “misinformation.” “The lack of transparency around this process is deeply concerning,” said Eric Wustrow, an engineering professor at the University of Colorado Boulder whose grant aims to study and combat internet censorship in countries like China and Iran. “Did they just Ctrl+f for certain words, ignoring context?” NSF said on its website that “there is not a list of words” to avoid, but that misinformation research is no longer aligned with NSF’s priorities. Wustrow said his research supports free speech and access to information around the world, and he plans to appeal the decision to terminate the funding. Meanwhile, he’s looking at potentially working for free this summer without a grant to fund his salary. Even for those who did intend to address misinformation, the cuts seemed to miss the point. Casey Fiesler, of the University of Colorado Boulder, had a project focused on dispelling AI misconceptions and improving AI literacy — also a priority of Trump’s education department. Cornell University’s Drew Margolin said his work set out to help people find ways to combat social media harassment, hate speech and misinformation without the help of content moderators or government regulators. “The irony is it’s like a free speech way of addressing speech,” Margolin said. The NSF declined to say if more cuts are coming. The terminated funding mirrors earlier cuts to medical research funding from the National Institutes of Health. A group of scientists and healthgroups sued the NIHearlier this month, arguing that those cuts were illegal and threatened medical cures. The cuts at NSF so far are a tiny portion of all of the agency’s grants, amounting to 387 projects, said Scott Delaney, a research scientist at Harvard University’s school of public health who is helping to track the cuts to help researchers advocate for themselves. Some received termination letters even though their projects had already ended. “It is very chaotic, which is very consistent with what is happening at NIH,” Delaney said. “And it’s really unclear if this is everything that’s going to get terminated or if it’s just the opening salvo.” Dayer is still figuring out what to do about the loss of funding for the bird feeder project, which cuts off part of summer funding for four professors at three universities and their respective student teams. She’s particularly worried about what it means for the next generation of American scientists, including those still deciding their career path. “It’s just this outright attack on science right now,” Dayer said. “It’s going to have lasting impacts for American people and for science and knowledge in our country. I’m also just afraid that people aren’t going to go into the field of science.” —— Associated Press writer Ali Swenson in New York contributed to this report.",
        "summary": "The news article discusses how President Trump's administration has cut funding for various research projects, including bird conservation and AI literacy work, that touch on themes of diversity, equity, and inclusion. This decision has affected numerous university researchers and their projects funded by the National Science Foundation. The NSF director defended the agency's priorities but later resigned. Over 380 grant projects have been terminated, impacting research on topics like internet censorship, bias mitigation in AI, and diversity in science studies.",
        "sentiment": {
            "company": "target",
            "score": -0.7
        },
        "tags": [
            "target",
            "leidos"
        ],
        "timestamp": "2025-04-24 16:45:20",
        "headline_tags": [
            "target"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-rates-tariffs-trump-ed03cfc78cd7d7d988573ef72301d11a",
        "source": "ap_news",
        "headline": "Microsoft and Meta Platforms lead Wall Street higher",
        "content": "NEW YORK (AP) —MicrosoftandMeta Platformsled Wall Street higher Thursday after the Big Tech companies reported profits for the start of the year that were even bigger than analysts expected. The S&P 500 rose 0.6% for aneighth straight gain, its longest winning streak since August. The Dow Jones Industrial Average added 83 points, or 0.2%, and the Nasdaq composite climbed 1.5%. Microsoft rallied 7.6% after the software giant saidstrength in its cloud computingand artificial intelligence businesses drove its overall revenue up 13% from a year earlier. Meta, the parent company of Facebook and Instagram, alsotopped analysts’ targets for revenue and profitin the latest quarter. It said AI tools helped boost its advertising revenue, and its stock climbed 4.2%. They’re two of the most influential stocks within the S&P 500 and other indexes because of their massive sizes, and they weren’t alone.CVS Health, Carrier Global and a bevy of other companies also joined the stream of better-than-expected profit reports that have helped steady Wall Street over the last week. The S&P 500 is back to within 9% of its record set earlier this year, after briefly droppingnearly 20% below the mark. Still, plenty of uncertainty remains about whether President DonaldTrump’s trade warwill force the economy into a recession. Even though companies have been reporting better profits for the first three months of the year than analysts expected, many CEOs are remaining cautious about the rest of the year. General Motors cut its forecast for profitin 2025, for example. It said it’s assuming it will feel a hit of $4 billion to $5 billion because of tariffs, and it expects to offset at least 30% of it. GM’s stock slipped 0.4%.  McDonald’sfell 1.9% after reporting weaker revenue for the latest quarter than analysts expected, even though its profit was slightly above forecasts. An important measure of performance at its U.S. restaurants had its worst decline since 2020, when COVID shuttered the global economy, and McDonald’s CEO Chris Kempczinski said consumers “are grappling with uncertainty.” McDonald’s joinedChipotleand other restaurant chains that have seen customers get more cautious amid all the unknowns about the economy and inflation that’s still higher than many would like. The uncertainty has already shown up in surveys of consumers, which say pessimism is shooting higher about where the economy heading. On Thursday, a couple reports about the economy came in mixed, following up on several recent updates that suggested it’s weakening. The first of the reports saidmore U.S. workers filed for unemployment benefitslast week than economists had forecast, setting the stage for a more comprehensive report on the job market arriving Friday. But a later update said U.S. manufacturing activity was better last month than economists had feared, though it still contracted again. The fear on Wall Street is for a possible worst-case scenario called “stagflation,” where the economy stagnates yet inflation remains high. The Federal Reserve has no good tools to fix both such problems at the same time. If the Fed were to try to help one problem by adjusting interest rates, it would likely make the other worse. Some encouraging news on inflation arrived Wednesday, when a report said that the measure ofinflation the Fed likes to use slowedin March. In the bond market, Treasury yields swiveled following Thursday’s economic reports. The yield on the 10-year Treasury initially fell below 4.13% after the worse-than-expected update on joblessness. But it later trimmed its losses following the better-than-expected report on manufacturing and rallied to 4.21%. That’s up from 4.17% late Wednesday. Stocks were steadier and held onto their gains through the day after opening higher. All told, the S&P 500 rose 35.08 points to 5,604.14. The Dow Jones Industrial Average added 83.60 to 40,752.96, and the Nasdaq composite gained 264.40 to 17,710.74. In stock markets abroad, trading was closed in many countries for May Day, or internationalLabor Day holidays. Tokyo’s Nikkei 225 rose 1.1% after the Bank of Japan kept its benchmark interest rate unchanged, as many investors expected. Hopes that Trump may eventually roll back some of his tariffs after reaching trade deals with other countries also helped to support markets. A social media blog by China’s state broadcaster claimed that the Trump administration has been seeking contact with the world’s second largest economy through multiple channels to start negotiations over tariffs. ___ AP Writers Yuri Kageyama, Matt Ott and Didi Tang contributed.",
        "summary": "Microsoft and Meta Platforms led Wall Street higher after reporting profits that exceeded analysts' expectations. Microsoft's stock surged 7.6% driven by strength in its cloud computing and artificial intelligence businesses, leading to a 13% increase in overall revenue. Meta also surpassed revenue and profit targets, with AI tools boosting its advertising revenue. The positive performance of these tech giants, along with other companies, contributed to the market's gains.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "meta",
            "general_motors",
            "leidos",
            "dow",
            "broadcom"
        ],
        "timestamp": "2025-05-01 17:08:11",
        "headline_tags": [
            "microsoft",
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/inflation-trump-powell-federal-reserve-6eb45ff17915b321366dbe1c5bb15e43",
        "source": "ap_news",
        "headline": "Trump renews attack on Federal Reserve Chair Powell, Dow Jones tumbles 1,000 points",
        "content": "WASHINGTON (AP) — President Donald Trump repeated hisattacksMonday against the chair of the Federal Reserve, demanding that the central bank lower its key interest rate to boost the economy. TrumpcalledPowell “a major loser” and said that energy and grocery prices are “substantially lower” and “there is virtually No Inflation.” Yet Trump said the economy could slow without rate cuts. Gas prices have fallen for the past two months, in part because oil costs have dropped on fears of slower growth, butfood pricesjumped in January and March andoverall inflationremains above the Fed’s 2% target. Trump’s comments drovethe stock market and the dollar loweras investors in the U.S. and overseas grow increasingly wary about the economic standing of the U.S. On Friday, a top White House adviser said the administration is studying whether it can fire Powell, a move that would undermine the Fed’s independence and likely send shock waves through global financial markets. The stock market, which fell immediately at the opening bell Monday, tumbled further after Trump’s post, with Dow dropping by more than 1,000 points and the broad S&P 500 stock index falling nearly 3% in mid-day trading. The dollar fell to a three-year low. The Federal Reserve was established as an independent agency and most economists think central banks that are free of political interferencedo a better job at keeping inflation in check. Otherwise, it would be harder for the Fed to take unpopular steps to keep prices down, such as raising interest rates.  The interest rate on 10-year Treasuries has been rising as Trump rolled out aggressive tariff policies against trading partners and continues to attack Powell and the Federal Reserve. The interest rate ticked higher again on Monday to 4.37%. The dollar losing value isunusualwhen stock prices fall and Treasury yields rise because investors typically buy U.S. government bonds during market turmoil, driving down the yield. Instead, investors appear to be avoiding U.S. markets due to the perception of rising risk. Trump also criticized Powell for being “too late” to move on interest rates. Powell and other Fed officials have long acknowledged that they waited too long to raise rates when inflation was first ignited in 2021. But right now, Powell hasunderscoredthat the Fed faces a potentially “challenging scenario.” Trump’s tariffs could worsen inflation, and the Fed would typically respond to rising prices by keeping its rate elevated, or even raising it. Yet the economy could also slow because of the duties, which the Fed would normally seek to counter with rate cuts. “Our tool only does one of those two things at the same time,” Powell said last week. As a result, Powell has underscored that the Fed will stay on the sidelines as it waits to see how the tariff policies play out. Trumplashed out at Powell on Fridayand said he could fire him if he wanted, though it would likely touch off a legal battle that could go to the Supreme Court. Powell has said the presidentlacks the authorityto fire him and has made clear he won’t step down until his term ends in May 2026. Kevin Hassett, director of the White House’s National Economic Council, when asked Friday whether firing Powell is an option, said that Trump “and his team will continue to study that matter.” Hassett also accused Powell of acting politically. Trump made a similar claim in his Truth Social post, accusing the Fed chair of cutting rates last year “in order to help Sleepy Joe Biden, later Kamala, get elected.” The Fed reduced its key rate three times in late 2024 as inflation cooled and out of concern that hiring was also slowing, though it later rebounded. On Sunday, Republican Sen. John Kennedy from Louisiana defended Powell on NBC’s “Meet the Press” and added that, “I don’t think the president, any president, has the right to remove the Federal Reserve chairman.” “The Federal Reserve ought to be independent,” he said. Also Sunday, Austan Goolsbee, president of the Federal Reserve’s Chicago branch, said on CBS’ “Face the Nation” that undermining the Federal Reserve’s independence could lead to higher inflation, slower economic growth, and less hiring. And William English, an economist at the Yale School of Management and a former senior Fed staffer, said Trump’s attacks on the Fed aren’t “going to make the American people better off over time.” “They’ll end up in all likelihood with higher inflation, and that is not something that people want,” he said.",
        "summary": "President Trump renewed his criticism of Federal Reserve Chair Powell, urging for lower interest rates to stimulate the economy. Trump's comments led to a drop in the stock market, with the Dow Jones falling over 1,000 points and the S&P 500 declining nearly 3%. The potential of the administration considering firing Powell raised concerns about the Fed's independence and global financial market stability.",
        "sentiment": {
            "company": "dow",
            "score": -0.8
        },
        "tags": [
            "exxon",
            "chevron",
            "shell",
            "bp",
            "conocophillips",
            "pioneer",
            "dow"
        ],
        "timestamp": "2025-04-21 12:45:36",
        "headline_tags": [
            "dow"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-rates-tariffs-52dbb020a4c41122e31669c2da236d67",
        "source": "ap_news",
        "headline": "Dow drops 1,600 as US stocks lead worldwide sell-off after Trump’s tariffs cause a COVID-like shock",
        "content": "▶ Follow live updates onPresident Donald Trump and his administration NEW YORK (AP) — Wall Street shuddered, and a level of shock unseen since COVID’s outbreak tore through financial markets worldwide Thursday on worries about the damagePresident Donald Trump’snewestset of tariffscould do toeconomies across continents, including his own. The S&P 500 sank 4.8%, more than in major markets across Asia and Europe, for its worst day since the pandemic crashed the economy in 2020. The Dow Jones Industrial Average dropped 1,679 points, or 4%, and the Nasdaq composite tumbled 6%.  Little was spared in financial markets as fear flared about the potentiallytoxic mixof weakeningeconomic growthandhigher inflationthat tariffs can create. Everything from crude oil to Big Tech stocks to the value of the U.S. dollar against other currencies fell. Even gold, whichhit records recentlyas investors sought something safer to own, pulled lower. Some of the worst hits walloped smaller U.S. companies, and the Russell 2000 index of smaller stocks dropped 6.6% to pull more than 20% below its record.  Mike Pistillo Jr., center, works with other traders on the floor at the New York Stock Exchange in New York, Thursday, April 3, 2025. (AP Photo/Seth Wenig)  Investors worldwide knew Trump was going to announce a sweeping set of tariffs late Wednesday, and fears surrounding it had already pulled Wall Street’s main measure of health, the S&P 500 index,10% below its all-time high. But Trump still managed to surprise them with “the worst case scenario for tariffs,” according to Mary Ann Bartels, chief investment officer at Sanctuary Wealth.  Joseph D’Arrigo works on the floor at the New York Stock Exchange in New York, Thursday, April 3, 2025. (AP Photo/Seth Wenig)  Trump announced a minimum tariff of 10% on imports, with the tax rate running much higher on products from certain countries like China and those from the European Union. It’s “plausible” the tariffs altogether, which would rival levels unseen in roughly a century, could knock down U.S. economic growth by 2 percentage points this year and raise inflation close to 5%, according to UBS.  Such a hit would be so big that it “makes one’s rational mind regard the possibility of them sticking as low,” according to Bhanu Baweja and other strategists at UBS.   Robert Greason works on the floor at the New York Stock Exchange in New York, Thursday, April 3, 2025. (AP Photo/Seth Wenig)  Trump has previously said tariffs could cause “a little disturbance” in the economy and markets, and on Thursday he again downplayed the impact as he left the White House to fly to Florida. “The markets are going to boom, the stock is going to boom and the country is going to boom,” Trump said. Tariffs sent stocks tumbling. The AP’s Seth Sutel has more. Wall Street had long assumed Trump would use tariffs merely as a tool for negotiations with other countries, rather than as a long-term policy. But Wednesday’s announcement may suggest Trump sees tariffs more as helping to solve an ideological goal than as an opening bet in a poker game. Trump on Wednesday talked about wresting manufacturing jobs back to the United States, a process that could take years. If Trump follows through on his tariffs, stock prices may need to fall much more than 10% from their all-time high in order to reflect the recession that could follow, along with the hit to profits that U.S. companies could take. The S&P 500 is now down 11.8% from its record set in February.  A trader works on the floor at the New York Stock Exchange in New York, Thursday, April 3, 2025. (AP Photo/Seth Wenig)  “Markets may actually be underreacting, especially if these rates turn out to be final, given the potential knock-on effects to global consumption and trade,” said Sean Sun, portfolio manager at Thornburg Investment Management, though he sees Trump’s announcement on Wednesday as more of an opening move than an endpoint for policy.  Trump offered an upbeat reaction after he was asked about the market’s drop as he left the White House to fly to his Florida golf club on Thursday. “I think it’s going very well,” he said. “We have an operation, like when a patient gets operated on and it’s a big thing. I said this would exactly be the way it is.”  Traders work on the floor at the New York Stock Exchange in New York, Thursday, April 3, 2025. (AP Photo/Seth Wenig)  One wild card is that the Federal Reserve could cut interest rates in order to support the economy. That’s what it had been doing late last year before pausing in 2025. Lower interest rates help by making it easier for U.S. companies and households to borrow and spend. Yields on Treasurys tumbled in part on rising expectations for coming cuts to rates, along with general fear about the health of the U.S. economy. The yield on the 10-year Treasury fell to 4.04% from 4.20% late Wednesday and from roughly 4.80% in January. That’s a huge move for the bond market. The Fed may have less freedom to move than it would like, though. While lower rates can goose the economy, they can also push upward on inflation. And worries are already worsening about that because of tariffs, with U.S.households in particular bracingfor sharp increases to their bills. The U.S. economy at the moment is still growing, of course. A report on Thursday saidfewer U.S. workers applied for unemployment benefits last week. Economist had been expecting to see an uptick in joblessness, and a relatively solid job market has been the linchpin keeping the economy out of recession. A separate report said activity for U.S. transportation, finance and other businesses in the services industry grew last month. But the growth was weaker than expected, and businesses gave a mixed picture of how they see conditions. Worries about a potentially stagnating economy and high inflation knocked down all kinds of stocks, leading to drops for four out of every five that make up the S&P 500. Best Buy fell 17.8% because the electronics that it sells are made all over the world. United Airlines lost 15.6% because customers worried about the global economy may not fly as much for business or feel comfortable enough to take vacations.Targettumbled 10.9% amid worries that its customers, already squeezed by still-high inflation, may be under even more stress. All told, the S&P 500 fell. 274.45 points to 5,396.52 The Dow Jones Industrial Average sank 1,679.39 to 40,545.93, and the Nasdaq composite tumbled 1,050.44 to 16,550.61. In stock markets abroad, indexes fell sharply worldwide. France’s CAC 40 dropped 3.3%, and Germany’s DAX lost 3% in Europe. Japan’s Nikkei 225 sank 2.8%, Hong Kong’s Hang Seng lost 1.5% and South Korea’s Kospi dropped 0.8%. ___ AP Writers Matt Ott, Elaine Kurtenbach and Darlene Superville contributed.",
        "summary": "The stock market experienced a significant drop, with the Dow Jones Industrial Average falling 1,679 points, or 4%, following President Trump's announcement of new tariffs. The S&P 500 and Nasdaq also saw sharp declines, reflecting global concerns about the economic impact of these tariffs. The announcement led to widespread fear in financial markets, affecting various sectors from crude oil to technology stocks.",
        "sentiment": {
            "company": "dow",
            "score": -0.8
        },
        "tags": [
            "apple",
            "exxon",
            "chevron",
            "shell",
            "bp",
            "conocophillips",
            "pioneer",
            "dow",
            "dupont"
        ],
        "timestamp": "2025-04-03 18:13:56",
        "headline_tags": [
            "dow"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-rates-tariffs-aeb0ed831602ab06235065aace6df5ec",
        "source": "ap_news",
        "headline": "US stocks drop as Nvidia slides and the fog of Trump’s trade war thickens",
        "content": "NEW YORK (AP) — U.S. stocks fell Wednesday afterNvidiawarned new restrictions on exports to China willchisel billions of dollarsoff its results, while companies around the world saidPresident Donald Trump’s trade waris clouding forecasts for how they and the economy will do this year. The S&P 500 sank 2.2% after falling as much as 3.3% earlier. Such an amount would have vied for one of its worst losses in years before thehistoric,chaoticswings that have upended Wall Street in recent weeks. The Dow Jones Industrial Average dropped 699 points, or 1.7%, and the Nasdaq composite sank a market-leading 3.1%. Losses accelerated after the head of theFederal Reserve said againthat Trump’s tariffs appear to be bigger than it expected, which could in turn slow the economy and raise inflation more than it had earlier thought. But Jerome Powell also said again that the Fed will need more time before deciding whether to lower interest rates, which could help the economy but make inflation worse, or to do the opposite. “All of this is highly uncertain,” Powell said. “We’re thinking now, really before the tariffs have their effects, (about) how they might affect the economy. That’s why we’re waiting really to see what the policies ultimately are, and then we can make a better assessment of what the economic effects will be.” Some companies are already seeing big effects because of changes from Washington.  Nvidia dropped 6.9% after it said the U.S. government is restricting exports of its H20 chips to China, citing worries that they could be used to build a supercomputer. The restrictions could mean a hit of $5.5 billion to Nvidia’s results for the first quarter, covering charges related to inventory and purchase commitments. Advanced Micro Devices sank 7.3% after it said U.S. limits on exports to China for its own chips may mean a hit of up to $800 million for inventory and other charges. In Amsterdam, ASML’s stock sank 5.2%. The Dutch company, whose machinery makes chips, said demand for artificial-intelligence technology is continuing to drive growth. “However, the recent tariff announcements have increased uncertainty in the macro environment and the situation will remain dynamic for a while,” CEO Christophe Fouquet said. The uncertainty around Trump’s trade war has been scrambling plans for companies across industries and around the world. It’s so dynamic that United Airlines gave two different financial forecasts for how it may perform this year, one if there’s a recession and one if not. The airline said it made the unusual move to give twin forecasts because it believes it’s “impossible to predict this year with any degree of confidence.” United’s stock finished roughly flat even though it reported a stronger profit for the latest quarter than analysts expected. Many investors are bracing for apossible recessionbecause of Trump’s tariffs, which he has said he hopes will bring manufacturing jobs back to the United States and trim how much more it imports from other countries than it exports. A survey of global fund managers by Bank of America found expectations for recession are at the fourth-highest level in the last 20 years. TheWorld Trade Organization said Wednesdayit expects tariffs to cause a 0.2% decline in the volume of world merchandise trade for 2025. That’s if the tariff situation remains as it was on Monday. Trade could shrink by 1.5% this year if conditions worsen, the WTO said. The “enduring uncertainty threatens to act as a brake on global growth, with severe negative consequences for the world, the most vulnerable economies in particular,” Director-General Ngozi Okonjo-Iweala said. One U.S. company that moves products around the continent, J.B. Hunt Transport Services, tumbled 7.7% for one of Wall Street’s sharper losses, even though it reported slightly stronger profit for the latest quarter than analysts expected. All told, the S&P 500 fell 120.93 points to 5,275.70. The Dow Jones Industrial Average dropped 699.57 to 39,669.39, and the Nasdaq composite sank 516.01 to 16,307.16. Tariffs could also drive up inflation, at least temporarily, by pushing U.S. importers to pass along the higher costs to their customers. Fears about such price hikes drove a spending binge last month, andsales at U.S. retailers acceleratedby more than economists expected. Economists said much of that was likely because of U.S. shoppers rushing to buy automobiles, electronics and other items before their prices could rise due to possible tariffs. Recent surveyshave shown U.S. households are feelingmore pessimisticabout the economy because of tariffs, and a fear is that it could lead them to pull back on their spending eventually, which could cause a recession by itself. Treasury yields eased in the bond market, taking a leg lower following the comments from the Fed’s chair. The yield on the 10-year Treasury fell to 4.28% from 4.35% late Tuesday and from 4.48% at the end of last week. It’s another notable move for the bond market and somewhat of a return to form after an unusual rise in yields last weekrattled investors and Trump. Treasury yields typically fall when investors are worried about the economy, and last week’s climb raised concerns that the trade war may be causing investors to second-guess the reputation of U.S. government bonds as one of the world’s safest possible investments. In stock markets abroad, indexes fell across much of Asia and were mixed in Europe. Stocks dropped 1.9% in Hong Kong, 1% in Tokyo, 1.2% in Seoul and 0.1% in Paris. The FTSE 100 rose 0.3% in London after the government saidinflation in the U.K.fell for the second month running in March, largely as a result of lower gas prices. ___ AP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
        "summary": "U.S. stocks, including Nvidia, fell as the company warned about new export restrictions to China impacting its results. The S&P 500 dropped 2.2%, with Nvidia declining 6.9% due to concerns over restrictions on its H20 chips. Advanced Micro Devices also faced challenges with U.S. limits on exports to China. The uncertainty surrounding Trump's trade war is clouding forecasts for companies globally, leading to market declines.",
        "sentiment": {
            "company": "nvidia",
            "score": -0.8
        },
        "tags": [
            "nvidia",
            "dow",
            "dupont",
            "tsmc"
        ],
        "timestamp": "2025-04-16 17:17:20",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-earnings-tariffs-a5ffef130fc2d328ac4ccb023d56dcdd",
        "source": "ap_news",
        "headline": "Amazon posts solid first quarter earnings growth, but outlook is tempered by tariff uncertainty",
        "content": "NEW YORK (AP) — Amazon posted higher first-quarter profit and sales that beat analysts’ projections, underscoring the online behemoth’s hold on shoppers looking for low prices and a wide selection in an uncertain economy. The Seattle-based company also reported strong sales growth for its prominent cloud computing arm Amazon Web Services, it said after the market closed Thursday. However, uncertainty about President Donald Trump’s tariffs and consumer spending clouded Amazon’s outlook. Trump’s erratic trade policies — including 145% tariffs on China — have paralyzed businesses and threaten to raise prices and hurt consumers. However, big companies like Amazon are expected to navigate the climate better than small retailers. Amazon, along with many large retailers and suppliers, have tried to beat the clock by bringing in foreign goods before Trump’s tariffs took effect. And Amazon’s president and CEO Andy Jassy told analysts during its earnings call that many of its third party sellers did the same. And because of that move, a fair amount of third-party sellers haven’t changed their pricing yet, he said. Jassy vowed that Amazon would do everything it could to keep prices low, and while he acknowledged challenges ahead, he touted Amazon’s model of vast selection that would help it navigate this new climate. “When there are uncertain environments, customers tend to choose the provider they trust most,” Jassy told analysts. “Given our really broad selection, low pricing, and speedy delivery, we have emerged from these uncertain eras with more relative market segment share than we started, and better set up for the future.”  On Friday, Trump is also endinga trade exemptionthat allowed low-value shipments from China to bypass duties, an exemption that had given an advantage to China-founded e-commerce firms, such as Shein and Temu. The new tariffs could benefit Amazon by increasing costs for its competitors. But it would also affect Chinese sellers who connect with American consumers on the company’s shopping platform. Furthermore, it could increase prices on a recently-launched online storefront that Amazon set up to ship low-cost products directly from China. The storefront, calledAmazon Haul, was Amazon’s answer to Shein and Temu. Amazon said that it earned $17.13 billion, or $1.59 per share, for the quarter ended March 31. That’s up from $10.43 billion, or 98 cents a share, in the year-ago period. Revenue rose 9% to $155.7 billion, up from $143.3 billion from the year-ago period. Sales for Amazon Web services rose 17% to $29.3 billion during the fiscal first quarter. Amazon is one of the biggest players in the race around generative artificial intelligence. Like other tech companies, it has increased investments in the technology and is spending billions to expand data centers that bolster AI and cloud computing. The company is also investing in its own computer chips and those developed by Nvidia. It has also expanded its own AI models and integrated generative AI intoother parts of its business. In the first quarter, Amazon reported spending $25.02 billion on property and equipment, higher than the $14.92 billion spent in same period in 2024. Amazon this week announced a $4 billion investment through 2026 to expand its rural delivery network to bring faster delivery to customers in less densely populated areas across the U.S. The company said it expects sales in the second quarter to be anywhere from $159 billion to $164 billion. Analysts projected $161.2 billion, according to FactSet. It also projects operating income to be in the range of $13 billion to $17.5 billion for the fiscal second quarter. Analysts expect $17.6 billion, according to FactSet. Amazon shares fell more than 2% in after-hours trading on Thursday.",
        "summary": "Amazon reported strong first-quarter earnings growth, exceeding analysts' expectations and showcasing its dominance in the online retail space. The company also saw robust sales growth in its Amazon Web Services division. However, concerns over President Trump's tariffs and their impact on consumer spending have clouded Amazon's outlook. Amazon's CEO, Andy Jassy, reassured analysts of the company's commitment to keeping prices low and highlighted its competitive advantages in uncertain times.",
        "sentiment": {
            "company": "amazon",
            "score": 0.7
        },
        "tags": [
            "apple",
            "amazon",
            "walmart",
            "tsmc"
        ],
        "timestamp": "2025-05-01 18:51:08",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/instagram-teens-parents-age-verification-meta-94f1f9915ae083453d23bf9ec57e7c7b",
        "source": "ap_news",
        "headline": "Instagram tries using AI to determine if teens are pretending to be adults",
        "content": "Instagram is beginning to test the use of artificial intelligence to determine if kids are lying about their ages on the app, parent company Meta Platforms said on Monday. Meta has been using AI to determine people’s ages for some time, the company said, but photo and video-sharing app will now “proactively” look for teen accounts it suspects belong to teenagers even if they entered an inaccurate birthdate when they signed up. If it is determined that a user is misrepresenting their age, the account will automatically become ateen account, which has more restrictions than an adult account. Teen accounts are private by default. Private messages are restricted so teens can only receive them from people they follow or are already connected to.“Sensitive content,” such as videos of people fightingor those promoting cosmetic procedures, will be limited, Meta said. Teens will also get notifications if they are on Instagram for more than 60 minutes and a “sleep mode” will be enabled that turns off notifications and sends auto-replies to direct messages from 10 p.m. until 7 a.m. Meta says ittrains its AIto look for signals, such as the type of content the account interacts, profile information and when the account was created, to determine the owner’s age. The heightened measures arrive as social media companies face increased scrutiny over how their platform affects the mental health and well-being of younger users. A growing number of states are also trying to pass age verification laws, although they have faced court challenges.  Meta and othersocial mediacompanies support putting the onus on app stores to verify ages amid criticism that they don’t do enough to make their products safe for children — or verify that no kids under 13 use them. Instagram will also send notifications to parents “with information about how they can have conversations with their teens on the importance of providing the correct age online,” the company said.",
        "summary": "Meta Platforms, the parent company of Instagram, is testing the use of AI to identify teenagers who may be pretending to be adults on the platform. If a user is found misrepresenting their age, their account will be automatically switched to a teen account with more restrictions. This move comes as social media companies face increased scrutiny over the impact of their platforms on young users' mental health and well-being.",
        "sentiment": {
            "company": "meta",
            "score": 0.6
        },
        "tags": [
            "meta",
            "leidos"
        ],
        "timestamp": "2025-04-21 06:46:42",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/google-search-monopoly-breakup-chrome-09b695c8de6c91b3d1e1b5305393f235",
        "source": "ap_news",
        "headline": "Google faces off with US government in attempt to break up company in search monopoly case",
        "content": "WASHINGTON (AP) — Google is confronting an existential threat as the U.S. government tries to break up the company as punishment for turning its revolutionary search engine into an illegal monopoly. The drama began to unfold Monday in a Washington courtroom as three weeks of hearings kicked off to determine how the company should be penalized for operating a monopoly in search. In its opening arguments, federal antitrust enforcers also urged the court to impose forward-looking remedies to prevent Google from using artificial intelligence to further its dominance. “This is a moment in time, we’re at an inflection point, will we abandon the search market and surrender them to control of the monopolists or will we let competition prevail and give choice to future generations,” said Justice Department attorney David Dahlquist. The proceedings, known in legal parlance as a “remedy hearing,” are set to feature a parade of witnesses that includes Google CEO Sundar Pichai. The U.S. Department of Justice is asking a federal judge to order a radical shake-up that would ban Google from striking the multibillion dollar deals with Apple and other tech companies that shield its search engine from competition, share its repository of valuable user data with rivals and force a sale of its popular Chrome browser. Google’s attorney, John Schmidtlein, said in his opening statement that the court should take a much lighter touch. He said the government’s heavy-handed proposed remedies wouldn’t boost competition but instead unfairly reward lesser rivals with inferior technology.  “Google won its place in the market fair and square,” Schmidtlein said. The moment of reckoning comes four-and-a-half-years after the Justice Department fileda landmark lawsuitalleging Google’s search engine had been abusing its power as the internet’s main gateway to stifle competition and innovation for more than a decade. After the case finally went to trial in 2023,a federal judge last year ruledGoogle had been making anti-competitive deals to lock in its search engine as the go-to place for digital information on the iPhone, personal computers and other widely used devices, including those running on its own Android software. That landmark ruling by U.S. District Judge Amit Mehta sets up a high-stakes drama that will determine the penalties for Google’s misconduct in a search market that it has defined since Larry Page and Sergey Brin founded the company in a Silicon Valley garage in 1998. Since that austere start, Google has expanded far beyond search to become a powerhouse in email, digital mapping, online video, web browsing, smartphone software and data centers. Seizing upon its victory in the search case, the Justice Department is now setting out to prove that radical steps must be taken to rein in Google and its corporate parent, Alphabet Inc. “Google’s illegal conduct has created an economic goliath, one that wreaks havoc over the marketplace to ensure that — no matter what occurs — Google always wins,” the Justice Department argued in documents outlining its proposed penalties. “The American people thus are forced to accept the unbridled demands and shifting, ideological preferences of an economic leviathan in return for a search engine the public may enjoy.” Although the proposed penalties were originally made under President Joe Biden’s term, they are still being embraced by the Justice Department under President Donald Trump, whose first administration filed the case against Google. Since the change in administrations, the Justice Department has also attempted to cast Google’s immense power as a threat to freedom, too. In his opening statement, Dahlquist noted that top officials from the Justice Department were in the room to watch proceedings. He said their presence indicated that the case had the full support of federal antitrust regulators, both past and present. “The fact that this case was filed in 2020, tried in 2023, under two different administrations, and joined by 49 states demonstrates the non-partisan nature of this case and our proposed remedies,” Dahlquist said. Dahlquist also said that Mehta would be hearing a lot about artificial intelligence and said top executives from AI companies, like ChatGPT maker’s OpenAI, would be called to testify. He said the court’s remedies should include provisions to make sure that Google’s Gemini, a technology build on generative AI, isn’t used to strengthen its existing search monopoly. “We believe that Google can and will attempt to circumvent the court’s remedies if it is not included,” Dahlquist said. “Gen AI is Google’s next evolution to keep their vicious cycle spinning.” The focus on AI during the hearings reflects the potential for the technology to revolutionize the way people plumb the internet for information, just as Google’s search engine did more than 20 years ago The government’s first witness was Greg Durrett, an AI expert and computer science professor from the University of Texas, who said the Google’s dominate position in search has been integral in helping the company build high-quality AI products. Schmidtlein, Google’s attorney, said in his opening remarks that rival AI companies had seen enormous growth in recent years and were doing “just fine.” Butin a Monday blog postabout the remedy hearings, AI search engine Perplexity backed the government’s push to forbid the multibillion dollar deals that give Google a favored position on smartphones and PCs. “The future of search is clear, and it isn’t links for Google to sell traffic. It’s AI that answers questions, completes tasks, and interacts with applications,” Perplexity said. But Google is also sounding alarms about the proposed requirements to share online search data with rivals and the proposed sale of Chrome posing privacy and security risks. “The breadth and depth of the proposed remedies risks doing significant damage to a complex ecosystem. Some of the proposed remedies would imperil browser developers and jeopardize the digital security of millions of consumers,” Google lawyers said in a filing leading up to hearings. The showdown over Google’s fate marks the climax of the biggest antitrust case in the U.S. since the Justice Department sued Microsoft in the late 1990s for leveraging its Windows software for personal computers to crush potential rivals. The Microsoft battle culminated in a federal judge declaring the company an illegal monopoly and ordering a partial breakup — a remedy that was eventually overturned by an appeals court. Google intends to file an appeal of Mehta’s ruling from last year that branded its search engine as an illegal monopoly but can’t do so until the remedy hearings are completed. After closing arguments are presented in late May, Mehta intends to make his decision on the remedies before Labor Day. The Justice Department also targeted Google’s digital advertising network in a separate antitrust case that resulted last week inanother federal judge’s decisionthat found the company was abusing its power in that market, too. That ruling means Google will be heading into another remedy hearing that could once again raise the specter of a breakup later this year or early next year. ——— The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives. ___ Liedtke reported from San Francisco.",
        "summary": "Google is facing a significant challenge from the U.S. government, which is seeking to break up the company due to allegations of operating an illegal monopoly with its search engine. The ongoing hearings aim to determine the appropriate penalties for Google's monopolistic practices, with the Justice Department advocating for forward-looking remedies to prevent further dominance through artificial intelligence. The case involves key figures like Google CEO Sundar Pichai and focuses on potential remedies such as prohibiting lucrative deals with tech companies, sharing user data with rivals, and potentially divesting the Chrome browser. Google's attorney argues against harsh penalties, claiming that the company rightfully earned its market position.",
        "sentiment": {
            "company": "alphabet",
            "score": -0.5
        },
        "tags": [
            "microsoft",
            "apple",
            "alphabet",
            "openai",
            "leidos",
            "ge",
            "broadcom"
        ],
        "timestamp": "2025-04-21 15:37:00",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/doge-musk-trump-ai-starlink-gsa-efficiency-d67a41d1be98db11f05ca8e4472f53bd",
        "source": "ap_news",
        "headline": "Elon Musk installed his top lieutenants at a federal agency you probably haven’t heard of",
        "content": "▶ Follow live updates onPresident Donald Trump and his administration WASHINGTON (AP) — On the rooftop patio of the General Services Administration headquarters, an agency staffer recently discovered something strange: a rectangular device attached to a wire that snaked across the roof, over the ledge and into the administrator’s window one floor below. It didn’t take long for the employee — an IT specialist — to figure out the device was a transceiver that communicates withElon Musk’svast and private Starlink satellite network. Concerned that the equipment violated federal laws designed to protect public data, staffers reported the discovery to superiors and the agency’s internal watchdog. The Starlink equipment raises a host of questions about what Muskand his efficiency czarsare doing at GSA, an obscure agency that is playing an outsized role in the Trump administration’s quest to slash costs and bring the federal government to heel. Among other clues that GSA is a critical cog in Musk’s stated efforts to slash billions of dollars in federal spending: people with ties to the entrepreneur or his companies hold key jobs at the agency. Its acting administrator is a Silicon Valley tech executive who has expertise in rolling out artificial intelligence tools and whose wife once worked for Musk at his social media company, X. Elon Musk attends the finals for the NCAA wrestling championship, Saturday, March 22, 2025, in Philadelphia. (AP Photo/Matt Rourke, file)  An engineer at Tesla, the billionaire’s electric car company, runs the GSA’s technology division. And one of Musk’s trusted lieutenants is helping to spearhead the work of downsizing the government’s real estate footprint.  GSA oversees many of Uncle Sam’s real estate transactions, collecting and paying rent on behalf of almost every federal agency. It helps manage billions in federal contracts. And it assists other agencies in building better websites and digital tools for citizens. It is so important because it is “a choke point for all agencies,” said Steven Schooner, a George Washington University law school professor who specializes in government contracting. “They can, in effect, stop all civilian agencies from purchasing, period. That’s everything.” In a statement in early March, GSA said it planned to get rid of “non-core assets” and welcomed “creative solutions, including sale-lease backs, ground leases and other forms of public/private partnerships.” The search for those cuts has engulfed the entire 12,000-person agency. At the helm of that push is the GSA’s acting administrator, Stephen Ehikian, the tech executive whose wife worked for X. “GSA was built for this moment,” Ehikian told employees last month in a meeting, a video of which was viewed by The Associated Press. “This agency is the backbone of federal government operations,” said Ehikian, who is seeking to expand automation — through the use of artificial intelligence — of many GSA functions. “We literally have an impact on the administration’s mandate right now, which is around efficiency.” Have a news tip? Contact AP’s global investigative team at[email protected].For secure and confidential communications, use the free Signal app+1 (202) 281-8604. Wires are seen leading from a top floor corner window to the roof of the headquarters of the General Services Administration (GSA) are photographed Wednesday, April 2, 2025, in Washington. (AP Photo/Mark Schiefelbein)  Another close Musk adviser — Nicole Hollander — is driving the initiative to unload the government’s real estate. Her husband, Steve Davis, is acting as thede facto leaderof the Musk-inspired Department of Government Efficiency. Hollander, who studied business and real estate at George Washington University, is a licensed property manager in Washington, according to LinkedIn. Her profile also lists her as an employee of X since 2023. In early March, the GSA real estate divisionreleased a list of hundredsof government-owned or leased properties it sought to sell in a frenzied rush. The list drew sharp criticism from Democrats and civil society groups because it proposed the sale of the Justice Department headquarters and included at least one undisclosed Central Intelligence Agency facility. GSA quickly withdrew the list. That did not stall DOGE’s fire sale. In the presentation viewed by the AP, Ehikian said the agency has canceled more than 680 leases, listed or sold at least 32 properties worth $185 million and cut more than $50 billion in contracts. Hollander has mostly operated behind the scenes. She rarely appears in Zoom meetings, according to employees. Documents obtained by the AP show spreadsheets she creates are stripped of her name and replaced with a more generic “GSA leadership.” The AP also obtained copies of some event invitations on Hollander’s calendar. They showed Hollander had several meetings with commercial real estate and services firms, including a brokerage firm and a real estate consulting company that helps companies economize their space. She also took meetings with a consortium of Washington technology companies. Hollander did not respond to a request for comment sent over LinkedIn or through a GSA spokesperson. It’s not the first time that Hollander has led a cost-cutting campaign for Musk. Alawsuit brought by fired Twitter employeesin 2023 alleged that Hollander and Davis were part of a “cadre of sycophants” who were particularly zealous in implementing Musk’s mandate overhaul of the social media company. Thesuit claimedthe pair, following their boss’ orders, circumvented San Francisco building and safety codes, ignored their obligation to pay vendors and landlords and downsized without regard to the turmoil it caused employees or customers. The couple, the lawsuit alleged, also lived at Twitter headquarters with their month-old child, mirroring Musk, who has a reputation for living at his company offices. That pattern appears to be repeating at GSA: Hollander has installed cots on the agency’s sixth floor, according to employees. Attorneys for Musk and X have moved to dismiss the lawsuit, arguing that the Delaware federal court lacks jurisdiction and the lawsuit is legally groundless. Another employee installed by the Trump administration at GSA worked for Musk at Tesla. Shortly after taking over GSA’s technology unit, Thomas Shedd told his workforce the goal was to “move fast and make changes,” according to a transcript of the February meeting obtained by the AP. That’s a variation on Facebook founder Mark Zuckerberg’s motto of moving fast and breaking things. Shedd soon began demanding access to sensitive systems that enable the public to communicate or interact with government services, according to staffers who spoke to the AP on condition of anonymity because they feared reprisal. Shedd’s request prompted pushback from existing GSA staff. One employee resigned rather than give Shedd access,according to 404 Media. He also told staff he wanted to consolidate all the government contracts in a centralized database to more easily figure out which ones to eliminate, according to a transcript of the meeting. It’s not clear if he accomplished that goal. Shedd did not reply to emails seeking comment. He and other GSA officials have also sought to rely more heavily on artificial intelligence. In March, employees were given a demo of a new internal AI chatbot that is designed to more speedily identify contracts and real estate that can be jettisoned. Government agencies like GSA have been hesitant to deploy AI in such ways due to data-security and privacy concerns, according to current and former officials. It’s not known what role — if any — Starlink is playing in GSA’s technological evolution. On the GSA roof, employees found at least two transceivers, including the one with a wire running to the administrator’s office. It is not clear why the agency is using Starlink. The network provides internet service but is not generally approved for use in most government computer systems. Wires are seen leading from a top floor corner window to the roof of the headquarters of the General Services Administration (GSA) are seen on Wednesday, April 2, 2025, in Washington. (AP Photo/Mark Schiefelbein)  IT staffers, who reported the discovery to superiors, were concerned that the devices were not authorized to be used at GSA and DOGE might be utilizing them to siphon off agency data, according to internal emails obtained by the AP and a GSA employee who spoke on condition of anonymity out of fear of reprisal. GSA’s IT staff opened an investigation to see if the terminals were a security threat, and an employee filed a complaint with the GSA’s inspector general, the emails show. The status of those probes could not be determined. The AP obtained photos — taken by a GSA employee — of the transceivers. And an AP staffer, using a telephoto lens, confirmed that a wire runs from the roof to a window to the administrator’s office.NBC reportedthat several DOGE staffers working out of GSA had begun using Starlink terminals in February. It’s unclear if they’re the same terminals referred for investigation by IT staff in March. A GSA spokesman confirmed the presence of Starlink transceivers but said they were not connected “to GSA’s internal network, nor was there a security breach.” Wires are seen leading from a top floor corner window to the roof of the headquarters of the General Services Administration (GSA) Wednesday, April 2, 2025, in Washington. (AP Photo/Mark Schiefelbein)  To many veterans of the agency, the irony of DOGE’s slash-and-burn approach to GSA is that it is jeopardizing one of the agency’s longstanding missions: improving government efficiency. The agency, for example, had an in-house consulting shop that during the first Trump administration focused on improving government services, especially those relying on technology. Among its initiatives, the team helped create systems to allow Americans to file taxes online and was working to improve online passport renewal. In the early weeks of the second Trump administration, DOGE officials gutted the team. Shedd defended that move, telling employees in a meeting that the team was eliminated because its work was not cost-effective, according to a transcript of his remarks. Any reduction in headcount could also jeopardize the government’s ability to police contracts once they are issued to keep costs down. Such decisions have baffled those who have tracked GSA’s work. Amira Boland, a behavioral scientist at GSA during the first Trump administration, said that trimming government was a good idea but described some of DOGE’s cuts as “reckless.” “There is certainly bureaucracy that needs to be eliminated,” Boland said, “but you have to know the stakes you’re playing with.” ___ Goodman reported from Miami and Burke from San Francisco. ___ Contact AP’s global investigative team at[email protected]orhttps://www.ap.org/tips/",
        "summary": "Elon Musk's influence is being felt at the General Services Administration (GSA), an agency crucial in the Trump administration's cost-cutting efforts. Musk's Starlink equipment was found on the GSA headquarters' rooftop, raising concerns about potential data violations. Individuals connected to Musk or his companies hold key positions at GSA, including an engineer from Tesla overseeing the agency's technology division. This highlights Musk's involvement in efforts to streamline government operations and reduce federal spending.",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        },
        "tags": [
            "microsoft",
            "apple",
            "meta",
            "tesla",
            "palantir",
            "leidos",
            "3m"
        ],
        "timestamp": "2025-04-17 11:25:27",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/ai-nvidia-amd-chips-trump-controls-0e6fbdc1ad8b54d8ecc704393c2a1558",
        "source": "ap_news",
        "headline": "Tech shares fall after Nvidia says new US controls on exports of AI chip will cost it $5.5 billion",
        "content": "BANGKOK (AP) — Shares in computer chipmakers slumped Wednesday after Nvidia said tighter U.S. government controls on exports of computer chips used forartificial intelligencewill cost it an extra $5.5 billion. The company, which announced Monday that it will produce its artificial intelligence super computers in theUnited States for the first time, said the government told it that its H20 integrated circuits and others of a similar bandwidth would be subject to the licensing requirements for the “indefinite future.” In a regulatory filing,Nvidia saidthe government said the controls addressed risks that the products “may be used in or diverted to, a supercomputer in China.” Shares of Nvidia and rival chipmaker Advanced Micro Devices each fell about 6% in morning trading Wednesday. AP correspondent Donna Warder reports on a pre-market slump in stocks for computer chip makers following tighter controls on computer chip exports. AMD said in a regulatory filing Tuesday that the export controls could potentially result in a charge of around $800 million in “inventory, purchase commitments and related reserves.” The Commerce Department said Wednesday that its new export licensing requirements pertain to Nvidia’s H20, AMD’s MI308 chips “and their equivalents.” Commerce said it is “committed to acting on the President’s directive to safeguard our national and economic security.” Asian technology giants also saw big declines. Testing equipment maker Advantest’s shares fell 6.7% in Tokyo, Disco Corp. lost 7.6% and Taiwan’s TSMC dropped 2.4%.  The news of the new controls came after Sen. Elizabeth Warrenurged Commerce Secretary Howard Lutnickto impose restrictions on exports of Nvidia’s H20 and other advanced AI chips to China. “I write with great concern regarding reports that the Commerce Department has paused its plan to restrict the export of powerful advanced AI chips like Nvidia’s H20 to the People’s Republic of China (PRC),” Warren wrote in a letter posted on the website of the U.S. Senate’s Committee on Banking, Housing and Urban Affairs. It said former President Joe Biden had not included the H20 chips in controls his administration placed on exports of advanced AI chips. The emergence of China’sDeepSeekAI chatbot in January renewed concerns over how China might use the advanced chips to help develop its own AI capabilities. Nvidia said Mondayit has commissioned more than one million square feet of manufacturing space to build and test its specialized Blackwell chips in Arizona and AI supercomputers in Texas — part of an investment the company said will produce up to half a trillion dollars of AI infrastructure in the next four years. The announcement came after President Donald Trump and other officials saidtariff exemptionson electronics like smartphones and laptops were only a temporary reprieve until officials develop a new tariff approach specific to the semiconductor industry. Trump claimed Nvidia’s decision as a victory for his effort to expand manufacturing in the U.S.",
        "summary": "Nvidia announced that tighter U.S. government controls on exports of AI chips will cost the company an additional $5.5 billion. The controls specifically target Nvidia's H20 integrated circuits and similar products due to concerns about potential use in Chinese supercomputers. This news led to a 6% drop in Nvidia's stock price, as well as declines in shares of rival chipmaker AMD and other Asian technology companies.",
        "sentiment": {
            "company": "nvidia",
            "score": -0.7
        },
        "tags": [
            "nvidia",
            "amd",
            "costco",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris",
            "leidos",
            "dupont",
            "tsmc"
        ],
        "timestamp": "2025-04-16 10:21:31",
        "headline_tags": [
            "nvidia",
            "costco"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-ai-artificial-intelligence-tariffs-dcf48112ce98a7b61bfd32157359ce2f",
        "source": "ap_news",
        "headline": "Nvidia plans to manufacture AI chips in the US for the first time",
        "content": "LOS ANGELES (AP) — Nvidia announced Monday that it will produce itsartificial intelligencesuper computers in the United States for the first time. The tech giant said it has commissioned more than one million square feet of manufacturing space to build and test its specialized Blackwell chips in Arizona and AI supercomputers in Texas — part of an investment the company said will produce up to half a trillion dollars of AI infrastructure in the next four years. “The engines of the world’s AI infrastructure are being built in the United States for the first time,” Nvidia founder Jensen Huang said in a statement. “Adding American manufacturing helps us better meet the incredible and growing demand for AI chips and supercomputers, strengthens our supply chain and boosts our resiliency.” Nvidia’s announcement comes as the Trump administration has said thattariff exemptions on electronics like smartphones and laptops are only a temporary reprieveuntil officials develop a new tariff approach specific to the semiconductor industry. White House officials, including President Donald Trump himself, spent Sunday downplaying the significance of exemptions that lessen but won’t eliminate the effect of U.S. tariffs on imports of popular consumer devices and their key components. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” U.S. Commerce Secretary Howard Lutnick told ABC’s “This Week” on Sunday.  Nvidia said in a post on its website that it has started Blackwell production atTaiwan Semiconductor Manufacturing Co. chip plants in Phoenix. The Santa Clara, California-based chip company is also building supercomputer manufacturing plants in Texas — with Foxconn in Houston and Wistron in Dallas. Nvidia’s AI super computers will serve as the engines for AI factories, “a new type of data center created for the sole purpose of processing artificial intelligence,” the company said, adding that manufacturing in the U.S. will create “hundreds of thousands of jobs and drive trillions of dollars in economic security over the coming decades.” Mass production at both plants is expected to ramp up in the next 12-15 months, Nvidia said. The company also plans on partnering with Taiwan-based company SPIL and Amkor for “packaging and testing operations” in Arizona. In a statement Monday, the White House called Nvidia’s move “the Trump Effect in action.” Trump “has made U.S.-based chips manufacturing a priority as part of his relentless pursuit of an American manufacturing renaissance, and it’s paying off — with trillions of dollars in new investments secured in the tech sector alone,” the White House said. Earlier this year, Trump announced a joint venture investing up to $500 billion for infrastructure tied to artificial intelligence by a new partnership formed by OpenAI, Oracle and SoftBank. The new entity,Stargate, was tasked with building out data centers and the electricity generation needed for the further development of thefast-evolving AIin Texas, according to the White House. The initial investment is expected to be $100 billion and could reach five times that sum.",
        "summary": "Nvidia has announced plans to manufacture its AI chips in the United States for the first time, investing in manufacturing space in Arizona and Texas. This move is part of an effort to meet the increasing demand for AI chips and supercomputers, strengthen the supply chain, and enhance resiliency. The company aims to produce up to half a trillion dollars of AI infrastructure in the next four years, with founder Jensen Huang emphasizing the significance of American manufacturing.",
        "sentiment": {
            "company": "nvidia",
            "score": 0.8
        },
        "tags": [
            "nvidia",
            "amd",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris",
            "leidos",
            "dupont",
            "tsmc"
        ],
        "timestamp": "2025-04-14 13:43:59",
        "headline_tags": [
            "nvidia",
            "amd",
            "tsmc"
        ]
    },
    {
        "url": "https://apnews.com/article/facebook-instagram-meta-ai-europe-c785dc3591ae3c49543c435fc15379fb",
        "source": "ap_news",
        "headline": "Meta says it will resume AI training with public content from European users",
        "content": "LONDON (AP) — Social media company Meta said Monday that it will start using publicly available content from European users to train its artificial intelligence models, resuming workput on holdlast year after activists raised concerns about data privacy. The company, which owns Facebook and Instagram, said that it would train its AI systems using public posts and comments shared by adult users in the 27-nation European Union. “People’s interactions with Meta AI — like questions and queries — will also be used to train and improve our models,” the company said in ablog post. Meta is making the move after launching its Meta AI assistant last month for European users, long after it rolled out to the United States and other major markets. The company’s AI training efforts had been hampered by stringent European Union data privacy laws, which give people control over how their personal information is used. Vienna-based group NOYB, led by activist Max Schrems, had complained to various national privacy watchdogs about Meta’s AI training plans and urged them to stop the company before it started training its next generation of AI models. Meta noted that a panel of EU privacy regulators in December “affirmed” that its original approach met legal obligations. The company said it won’t use private messages to train its AI model and repeated its point that it is merely following the example of rivals Google and OpenAI, “both of which have already used data from European users to train their AI models.” Meta said it will start notifying users in the EU about the training, and will include a link to a form where they can object at any time. “We’ll honor all objection forms,” the company said.",
        "summary": "Meta, the parent company of Facebook and Instagram, announced that it will resume AI training using publicly available content from European users after a pause due to privacy concerns raised by activists. The company plans to train its AI models using public posts and comments from adult users in the European Union, as well as interactions with its Meta AI assistant. Meta will notify EU users about the training and provide an option to object at any time.",
        "sentiment": {
            "company": "meta",
            "score": 0.2
        },
        "tags": [
            "alphabet",
            "meta",
            "warner_bros",
            "leidos"
        ],
        "timestamp": "2025-04-14 10:09:30",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/openai-chatgpt-countersues-elon-musk-31e3d238be1295ab23505b063693b58e",
        "source": "ap_news",
        "headline": "OpenAI countersues Elon Musk in legal dispute over ChatGPT maker’s business ambitions",
        "content": "OpenAI is suing Elon Musk for unfair competition and interfering with its business relationships with investors and customers, escalating a legal battle between the ChatGPT maker and the billionaire who helped bankroll the artificial intelligence startup a decade ago. The allegations against Musk were filed Wednesday in a federal court in California as a counterclaim to the Tesla CEO’s lawsuit against OpenAI, which is heading to a jury trial next year. Musk, an early OpenAI investor who now runs his own AI firm, xAI, along with Tesla, SpaceX, social media platform X and President Donald Trump’s Department of Government Efficiency, began a legal offensive against OpenAI and its CEO Sam Altman more than a year ago. He firstsued for breach of contractover what he said was the betrayal of itsfounding aims as a nonprofitresearch laboratory, and later expanded his claims. A federal judge in March denied Musk’s request for a court order blocking OpenAI from converting itself to afor-profit companybut said she could expedite a trial to considerMusk’s claims. She offered to hold a trial later this year, but it has been pushed back to March 2026. In this week’s counterclaim, OpenAI accuses Musk of making a “sham bid” in February to buy a controlling stake in the nonprofit. Musk and a group of investorsoffered $97.4 billionfor OpenAI’s assets, a number that OpenAI said Musk pulled from the character 974 Praf in the science fiction novel “Look to Windward” byScottish writer Iain Banks. Musk has also named some of his SpaceX machinery after ships in the book.  OpenAI said it “recognized the bid as a feint” but has repeatedly had to divert resources and “suffered harm as a result of Musk’s unlawful campaign of harassment, interference, and misinformation.” Musk attorney Marc Toberoff responded in an email late Wednesday and said that if OpenAI’s board of directors had “genuinely considered the bid, as they were obligated to do, they would have seen how serious it was.” “It’s telling that having to pay fair market value for OpenAI’s assets allegedly ‘interferes’ with their business plans,” Toberoff wrote. ———— The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "summary": "OpenAI is counter-suing Elon Musk, accusing him of unfair competition and interfering with its business relationships. This legal battle stems from Musk's initial lawsuit against OpenAI for breach of contract over its transition to a for-profit company. Musk's bid to buy a controlling stake in OpenAI is also under scrutiny, with OpenAI alleging it was a \"sham bid\" based on a fictional character's name and causing harm through harassment and misinformation.",
        "sentiment": {
            "company": "tesla",
            "score": -0.5
        },
        "tags": [
            "tesla",
            "openai",
            "leidos"
        ],
        "timestamp": "2025-04-10 11:33:27",
        "headline_tags": [
            "tesla",
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-ai-data-center-pause-ohio-4d987fe8446fc9e6cda31d919f938911",
        "source": "ap_news",
        "headline": "Microsoft says it’s ‘slowing or pausing’ some AI data center projects, including $1B plan for Ohio",
        "content": "Microsoft said it is “slowing or pausing” some of its data center construction, including a $1 billion project in Ohio, the latest sign that the demand forartificial intelligence technologythat drove a massive infrastructure expansion might not need quite as many powerful computers as expected. The tech giant confirmed this week that it is halting early-stage projects on rural land it owns in central Ohio’s Licking County, outside of Columbus, and will reserve two of the three sites for farmland. “In recent years, demand for our cloud and AI services grew more than we could have ever anticipated and to meet this opportunity, we began executing the largest and most ambitious infrastructure scaling project in our history,” said Noelle Walsh, the president of Microsoft’s cloud computing operations, in a post on LinkedIn. Walsh said “any significant new endeavor at this size and scale requires agility and refinement as we learn and grow with our customers. What this means is that we are slowing or pausing some early-stage projects.” Microsoft didn’t say Wednesday what other projects it has slowed outside of Ohio, but in late December it revealed it was pausing the later phases of a large data centerproject in Wisconsin. Analysts with TD Cowen reported earlier this year that Microsoft was also scaling back some of its international data center expansion and canceling some leases in the U.S. for use of data centers operated by other companies.  Other analysts for months have tied some of the changes to a shift in Microsoft’s close relationship with its business partner OpenAI, maker of ChatGPT. “OpenAI was moving in one direction” by prioritizing the development of more advanced AI systems, which require vast computing resources to train on troves of data, while “Microsoft may not have been moving that same direction,” said Craig Ellis, director of research at B. Riley Securities. The two companies announced on Jan. 21 that they were altering the agreement that had made Microsoft the exclusive provider of OpenAI’s computing power, enabling the smaller company to build its own capacity, “primarily for research and training of models.” It was the same day that newly inaugurated President DonaldTrump touted OpenAI’s partnershipwith Oracle and SoftBank to pledge $500 billion in new AI infrastructure in the U.S., starting with adata center in Texas. Microsoft has long built data centers around the world to run its cloud computing services. The generative AI boom accelerated the demand for such facilities, both to train new AI systems and to keep them running as millions of people start using chatbots and other AI tools at work and home. The computing it takes to run AI tools is expensive and requires a large amount of electricity — so much so that Trump this week cited AI needs as part of the justification forusing his emergency authoritiesto boost the declining U.S. coal industry, a reliable but polluting energy source. Tech companies have also sought to tap into nuclear power, including aproposed Microsoft-backed revivalof the shuttered Three Mile Island plant in Pennsylvania, which would feed an electricity grid supplying data centers in Ohio as well as Virginia, the nation’sbiggest data center hub. Microsoft said it still plans to spend more than $80 billion globally to expand its AI infrastructure this fiscal year, which ends in June, and has already doubled its data center capacity over the past three years. “While we may strategically pace our plans, we will continue to grow strongly and allocate investments that stay aligned with business priorities and customer demand,” Walsh said. The Ohio pause nevertheless came as a disappointment to local officials. Licking County has also attracted data center investments from Microsoft rivals Google and Meta Platforms and a highly anticipated semiconductor factory from Intel, though the struggling chipmakerin February pushed backthe expected completion date for the project’s first stage to 2030.",
        "summary": "Microsoft is slowing or pausing some of its data center projects, including a $1 billion project in Ohio, due to lower demand for artificial intelligence technology. The company is halting early-stage projects in Ohio and other locations, indicating a need for agility and refinement in response to evolving customer needs. This decision follows a period of significant infrastructure scaling to meet growing demand for cloud and AI services.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.5
        },
        "tags": [
            "microsoft",
            "apple",
            "alphabet",
            "meta",
            "exxon",
            "chevron",
            "leidos"
        ],
        "timestamp": "2025-04-09 17:56:59",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-protest-employees-fired-israel-gaza-50th-anniversary-c5b3715fa1800450b8d0f639b492495e",
        "source": "ap_news",
        "headline": "Microsoft workers say they’ve been fired after 50th anniversary protest over Israel contract",
        "content": "Microsoft has fired twoemployees who interruptedthe company’s50th anniversary celebrationto protest its work supplying artificial intelligence technology to the Israeli military, according to a group representing the workers. Microsoft accused one of the workers in a termination letter Monday of misconduct “designed to gain notoriety and cause maximum disruption to this highly anticipated event.” Microsoft says the other worker had already announced her resignation, but on Monday it ordered her to leave five days early. The protests began Friday when Microsoft software engineer Ibtihal Aboussad walked up toward a stage where an executive was announcing new product features and a long-term vision for Microsoft’s AI ambitions. “You claim that you care about using AI for good but Microsoft sells AI weapons to the Israeli military,” Aboussad shouted at Microsoft AI CEO Mustafa Suleyman. “Fifty-thousand people have died and Microsoft powers this genocide in our region.” The protest forced Suleyman to pause his talk while it was being livestreamed from Microsoft’s campus in Redmond, Washington. Among the participants at the 50th anniversary of Microsoft’s founding were co-founder Bill Gates and former CEO Steve Ballmer. Microsoft said Suleyman calmly tried to de-escalate the situation. “Thank you for your protest, I hear you,” he said. Aboussad continued, shouting that Suleyman and “all of Microsoft” had blood on their hands. She also threw onto the stage a keffiyeh scarf, which has become a symbol of support for Palestinian people, before being escorted out of the event.  A second protester, Microsoft employee Vaniya Agrawal, interrupted a later part of the event. Aboussad, based at Microsoft’s Canadian headquarters in Toronto, was invited on Monday to a call with a human resources representative at which she was told she was being fired immediately, according to the advocacy group No Azure for Apartheid, which has protested the sale of Microsoft’s Azure cloud computing platform to Israel. An investigation by The Associated Pressrevealed earlier this yearthat AI models from Microsoft and OpenAI had been used as part of an Israeli military program to select bombing targets during the recent wars in Gaza and Lebanon. The story also contained details of an errant Israeli airstrike in 2023 that struck a vehicle carrying members of a Lebanese family, killing three young girls and their grandmother. In its termination letter, Microsoft told Aboussad she could have raised her concerns confidentially to a manager. Instead, it said she made “hostile, unprovoked, and highly inappropriate accusations” against Suleyman and the company and that her “conduct was so aggressive and disruptive that you had to be escorted out of the room by security.” Agrawal had already given her two weeks notice and was preparing to leave the company on April 11, but on Monday a manager emailed that Microsoft “has decided to make your resignation immediately effective today.” It was the most public but not the first protest over Microsoft’s work with Israel. In February, five Microsoft employees wereejected from a meetingwith CEO Satya Nadella for protesting the contracts. “We provide many avenues for all voices to be heard,” said a statement from the company Friday. “Importantly, we ask that this be done in a way that does not cause a business disruption. If that happens, we ask participants to relocate. We are committed to ensuring our business practices uphold the highest standards.” Microsoft had declined to say Friday whether it was taking further action, but Aboussad and Agrawal expected it was coming after both lost access to their work accounts shortly after the protest. Dozens of Google workers were fired last year after internal protests over a contract it also has with the Israeli government. Employee sit-ins at Google offices in New York and Sunnyvale, California targeted a $1.2 billion deal known as Project Nimbus providing AI technology to the Israeli government. The Google workers later filed a complaint with the National Labor Relations Board in an attempt to get their jobs back.",
        "summary": "Microsoft has fired two employees who disrupted the company's 50th-anniversary celebration to protest its AI technology supply to the Israeli military. The protesters accused Microsoft of contributing to a genocide in the region. The protest caused a pause in the event, with one protester throwing a keffiyeh scarf symbolizing support for Palestinians onto the stage. Microsoft's response included attempting to de-escalate the situation and ultimately firing the protesters.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.5
        },
        "tags": [
            "microsoft",
            "alphabet",
            "openai",
            "leidos",
            "broadcom"
        ],
        "timestamp": "2025-04-07 20:35:22",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-ai-protest-israel-gaza-50th-anniversary-fadcb37bcce7e067f896ec5502d187b6",
        "source": "ap_news",
        "headline": "Microsoft employees protest at 50th anniversary party over Israel contract",
        "content": "A pro-Palestinian protest by Microsoft employees interrupted the company’s50th anniversary celebrationFriday, the latest backlash over the tech industry’s work to supply artificial intelligence technology to the Israeli military. The protest began as Microsoft AI CEO Mustafa Suleyman was presenting product updates and a long-term vision for the company’s AI assistant product, Copilot, to an audience that included Microsoft co-founder Bill Gates and former CEO Steve Ballmer. “Mustafa, shame on you,” shouted Microsoft employee Ibtihal Aboussad as she walked toward the stage and Suleyman paused his speech. “You claim that you care about using AI for good but Microsoft sells AI weapons to the Israeli military. Fifty-thousand people have died and Microsoft powers this genocide in our region.” “Thank you for your protest, I hear you,” Suleyman said. Aboussad continued, shouting that Suleyman and “all of Microsoft” had blood on their hands. She also threw onto the stage a keffiyeh scarf, which has become a symbol of support for Palestinian people, before being escorted out of the event. A second protester, Microsoft employee Vaniya Agrawal, interrupted another part of the celebration during which Gates, Ballmer and current CEO Satya Nadella were on stage — the first public gathering since 2014 of the three men who have been Microsoft’s CEO. An investigation by The Associated Pressrevealed earlier this yearthat AI models from Microsoft and OpenAI had been used as part of an Israeli military program to select bombing targets during the recent wars in Gaza and Lebanon. The story also contained details of an errant Israeli airstrike in 2023 that struck a vehicle carrying members of a Lebanese family, killing three young girls and their grandmother.  In February, five Microsoft employees wereejected from a meetingwith Nadella for protesting the contracts. While the February event was an internal meeting, Friday’s protest was far more public — a livestreamed showcaseof the company’s pastand future. Some employees also rallied outside the event Friday. “We provide many avenues for all voices to be heard,” said a statement from the company Friday. “Importantly, we ask that this be done in a way that does not cause a business disruption. If that happens, we ask participants to relocate. We are committed to ensuring our business practices uphold the highest standards.” Microsoft declined to say whether it was taking further action. Aboussad told the AP she hasn’t yet heard anything from the company but she and Agrawal both lost access to their work accounts after the protest and have not been able to log back in, a possible indication that they were being fired.",
        "summary": "Microsoft employees protested during the company's 50th anniversary celebration over the tech giant's contract to supply AI technology to the Israeli military. The protest highlighted concerns about Microsoft's involvement in supporting the Israeli military's actions in the region. This incident follows previous internal protests and adds to the ongoing backlash within the company over its AI contracts.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.7
        },
        "tags": [
            "microsoft",
            "openai",
            "leidos"
        ],
        "timestamp": "2025-04-04 20:26:13",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/ai-data-centers-los-alamos-sandia-7431bea2ee491b7cf4b9aa012ac419f1",
        "source": "ap_news",
        "headline": "US energy department invites AI data center development at Los Alamos and other federal lands",
        "content": "The U.S. Department of Energy said it has identified16 federal sites, including storied nuclear research laboratories such as Los Alamos, where tech companies could build data centers in a push to accelerate commercial development of artificial intelligence technology. The sites are “uniquely positioned for rapid data center construction, including in-place energy infrastructure with the ability to fast-track permitting for new energy generation such as nuclear,” the agency said in a statement Thursday. The movefollows an executive ordersigned in January by outgoing President Joe Biden that sought to remove hurdles for AI data center expansion in the U.S. while also encouraging those data centers, which require large amounts of electricity, to be powered with renewable energy. While President Donald Trump has since sought to erase most of Biden’s signature AI policies, he made clear after returning to the White House that he had no interest in rescinding Biden’s data center order. “I’d like to see federal lands opened up for data centers,” Trump said in January. “I think they’re going to be very important.” The lands identified as potential sites include a number of national laboratories, such as the New Mexico-centered Los Alamos and Sandia laboratories and Oak Ridge in Tennessee. While the tech industry has long relied on data centers to run online services, from email and social media to financial transactions, new AI technology behind popular chatbots and generative AI tools requireseven more powerfulcomputation tobuild and operate.  A report released by the Department of Energy late last year estimated that the electricity needed for data centers in the U.S. tripled over the past decade and is projected to double or triple again by 2028 when it could consume up to 12% of the nation’s electricity. The United States, under both presidents, has been speeding up efforts to license and builda new generation of nuclear reactorsto supply carbon-free electricity. While Biden’s executive order focused on powering AI infrastructure with clean energy sources such as “geothermal, solar, wind, and nuclear,” Thursday’s statement from Trump’s energy department focused only on nuclear. But in a lengthy request for information sought from data center and energy developers, the agency outlines a variety of electricity sources available at each site, from solar arrays to gas turbines.",
        "summary": "The U.S. Department of Energy has identified federal sites, including Los Alamos, for tech companies to build data centers to accelerate AI technology development. This initiative aims to streamline permitting for new energy generation, including nuclear power. The move aligns with President Biden's executive order to facilitate AI data center expansion and promote renewable energy use. The tech industry's increasing reliance on data centers, especially for advanced AI applications, is driving up electricity consumption.",
        "sentiment": {
            "company": "exxon",
            "score": 0.2
        },
        "tags": [
            "exxon",
            "chevron",
            "nextera",
            "bp",
            "leidos"
        ],
        "timestamp": "2025-04-03 15:22:14",
        "headline_tags": [
            "exxon",
            "chevron"
        ]
    }
]