[
    {
        "url": "https://apnews.com/article/tesla-sales-recall-trump-byd-b6f5da15be491d16e3020598e3ddf861",
        "source": "ap_news",
        "headline": "Tesla sales fall by 49% in Europe even as the electric vehicle market grows",
        "content": "FRANKFURT, Germany (AP) — European sales of Tesla electric vehicles tumbled 49% in the first two months of the year compared with a year earlier even as overall sales of EVs grew, according to the European Automobile Manufacturers’ Association. There have been complaints about an aging lineup of vehicles from Tesla and also a significant backlash against CEO Elon Musk and hisaffiliation with the Trump administrationin the U.S. In Europe, Musk’sendorsement of Germany’s far-rightAlternative for Germany party in last month’s national electiondrew broad condemnation. Tesla faces increasing competition from major automakers as they ramp up EV production, including China’s BYD. On Tuesday, BYDreported a record777.1 billion yuan ($107 billion) in revenue for 2024 as sales of its electric and hybrid vehicles jumped 40%. Earlier this month, BYD announced anultra fast EV charging systemthat it says is nearly as quick as a fill up at the gas pump. Tesla sales for January and February slumped to 19,046 from 37,311 in the same period in 2024. That comes against the background of a 28.4% increase in sales of all battery-electric cars in Europe. German politicians and opinion media sharply criticized Musk over his support for the AfD, while Tesla vehicles and dealerships have been thetarget of protesters in the U.S. and Europeover the AfD endorsement and his role advising U.S. President Donald Trump in drastically reducing the size of the US federal government.  Tesla sales are falling globally, however. The company posted itsfirst annual sales dropin more than a dozen years in January. Tesla’s new Cybertruck has had multiple recalls including last week, when the company recalled nearly all of them because panels that run along the left and right side of the windshield can fly off when driving. It was the eighth recall of the Cybertruck since deliveries to customers began just over a year ago.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25 09:47:48",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-privacy-echo-7fb3c19fa7f664bde5c5be259f8b23ee",
        "source": "ap_news",
        "headline": "Amazon ends little-used privacy feature that let Echo users opt out of sending recordings to company",
        "content": "Amazon is ending a little-used privacy feature that let some users of its Echo smart speaker prevent their voice commands from going to the company’s cloud. Beginning on March 28, Amazon is ending the “Do Not Send Voice Recordings” option that kept audio from being sent to Amazon’s cloud and had it process locally on the device instead. In an email sent to customers who’d been using the option, Amazon said it made the decision to “no longer support this feature” as it expands Alexa’s capabilities with generative artificial intelligence features that rely on being processed in the cloud. While the change may sound alarming to some privacy-minded users, it was not widely used or available. It only worked on three devices: the 4th generation Echo Dot, the Echo Show 10 and the Echo Show 15 — and only for customers in the U.S. with devices set to English. Amazon said less than 0.03% of customers use it. People still have the option to prevent Alexa from saving voice recordings. Those who’d been using the “Do Not Send” feature as of March 28 will automatically be opted into the “Don’t save recordings” option, Amazon said. “The Alexa experience is designed to protect our customers’ privacy and keep their data secure, and that’s not changing. We’re focusing on the privacy tools and controls that our customers use most and work well with generative AI experiences that rely on the processing power of Amazon’s secure cloud,” Amazon said in a statement.",
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-19 18:39:33",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/france-meta-artificial-intelligence-lawsuit-copyright-168b32059e70d0509b0a6ac407f37e8a",
        "source": "ap_news",
        "headline": "French publishers and authors sue Meta over copyright works used in AI training",
        "content": "French publishers and authors said Wednesday they’re taking Meta to court, accusing the social media company of using their works without permission to train its artificial intelligence model. Three trade groups said they were launching legal action against Meta in a Paris court over what they said was the company’s “massive use of copyrighted works without authorization” to train its generative AI model. The National Publishing Union, which represents book publishers, has noted that “numerous works” from its members are turning up in Meta’s data pool, the group’s president, Vincent Montagne, said in a joint statement. Meta didn’t respond to a request for comment. The company has rolled out generative-AI powered chatbot assistants to users of its Facebook, Instagram and WhatsApp platforms. Montagne accused Meta of “noncompliance with copyright and parasitism.” Another group, the National Union of Authors and Composers, which represents 700 writers, playwrights and composers, said the lawsuit was necessary to protect members from “AI which plunders their works and cultural heritage to train itself.” The union is also worried about AI that “produces ‘fake books’ which compete with real books,” the union’s president, Francois Peyrony, said. The third group involved in the lawsuit, the Societe des Gens de Lettres, represents authors. They all demand the “complete removal” of data directories Meta created without authorization to to train its AI model.  Under the European Union’s sweeping Artificial Intelligence Act, generative AI systems must comply with the 27-nation bloc’s copyright law and be transparent about the material they used for training. It’s the latest example of the clash between the creative and publishing industries and tech companies over data and copyright. British musicians released asilent albumlast month to protest the U.K. government’s proposed changes toartificial intelligencelaws thatartists fearwill erode their creative control. Media and technology company Thomson Reuters recently won a legal battle against a now-defunct legal research firm over the question offair usein AI-related copyright cases, while other cases involving visual artists, news organizations and others are still working through U.S. courts.",
        "tags": [
            "amazon",
            "meta"
        ],
        "timestamp": "2025-03-12 09:57:46",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/turing-award-ai-reinforcement-learning-83db773712dd3abccd21e3782d9059ec",
        "source": "ap_news",
        "headline": "AI pioneers who channeled ‘hedonistic’ machines win computer science’s top prize",
        "content": "Teaching machines in the way that animal trainers mold the behavior of dogs or horses has been an important method for developing artificial intelligence and one that was recognized Wednesday with the top computer science award. Two pioneers in the field of reinforcement learning, Andrew Barto and Richard Sutton, are the winners of this year’s A.M. Turing Award, the tech world’s equivalent of the Nobel Prize. Research that Barto, 76, and Sutton, 67, began in the late 1970s paved the way for some of the past decade’s AI breakthroughs. At the heart of their work was channeling so-called “hedonistic” machines that could continuously adapt their behavior in response to positive signals. Reinforcement learning is what led a Google computer program to beat theworld’s best human playersof the ancient Chinese board game Go in 2016and 2017. It’s also been a key technique in improving popular AI tools like ChatGPT, optimizing financial trading and helping a robotic hand solve aRubik’s Cube. But Barto said the field was “not fashionable” when he and his doctoral student, Sutton, began crafting their theories and algorithms at the University of Massachusetts, Amherst. “We were kind of in the wilderness,” Barto said in an interview with The Associated Press. “Which is why it’s so gratifying to receive this award, to see this becoming more recognized as something relevant and interesting. In the early days, it was not.”  Google sponsors the annual $1 million prize, which was announced Wednesday by the Association for Computing Machinery. Barto, now retired from the University of Massachusetts, and Sutton, a longtime professor at Canada’s University of Alberta, aren’t the firstAI pioneers to winthe award named after British mathematician, codebreaker and earlyAI thinker Alan Turing. But their research has directly sought to answer Turing’s 1947 call for a machine that “can learn from experience” — which Sutton describes as “arguably the essential idea of reinforcement learning.” In particular, they borrowed from ideas in psychology and neuroscience about the way that pleasure-seeking neurons respond to rewards or punishment. In one landmark paper published in the early 1980s, Barto and Sutton set their new approach on a specific task in a simulated world: balance a pole on a moving cart to keep it from falling. The two computer scientists later co-authored a widely used textbook on reinforcement learning. “The tools they developed remain a central pillar of the AI boom and have rendered major advances, attracted legions of young researchers, and driven billions of dollars in investments,” said Google’s chief scientist Jeff Dean in a written statement. In a joint interview with the AP, Barto and Sutton didn’t always agree on how to evaluate the risks of AI agents that are constantly seeking to improve themselves. They also distinguished their work from the branch of generative AI technology that is currently in fashion — the large language models behind chatbots made by OpenAI, Google and other tech giants that mimic human writing and other media. “The big choice is, do you try to learn from people’s data, or do you try to learn from an (AI) agent’s own life and its own experience?” Sutton said. Sutton has dismissed what he describes as overblown concerns about AI’s threat to humanity, while Barto disagreed and said “You have to be cognizant of potential unexpected consequences.” Barto, retired for 14 years, describes himself as a Luddite, while Sutton is embracing a future he expects to have beings of greater intelligence than current humans — an idea sometimes known as posthumanism. “People are machines. They’re amazing, wonderful machines,” but they are also not the “end product” and could work better, Sutton said. “It’s intrinsically a part of the AI enterprise,” Sutton said. “We’re trying to understand ourselves and, of course, to make things that can work even better. Maybe to become such things.”",
        "tags": [
            "apple",
            "alphabet",
            "openai"
        ],
        "timestamp": "2025-03-05 07:12:57",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/indycar-openai-ganassi-altman-7068d7785e20d8db37a7c8153b2caa20",
        "source": "ap_news",
        "headline": "Chip Ganassi Racing partners with OpenAI in first motorsports venture for AI company",
        "content": "ST. PETERSBURG, Fla. (AP) — Chip Ganassi Racing on Friday said it has partnered on a strategic research collaboration with OpenAI — a deal that makes the two-time reigning IndyCar championship winning team the first to bring in a partner from the artificial intelligence field. It is also OpenAI’s first collaboration in motorsports. “Racing has always been a proving ground for innovation, and we’re excited to explore how our AI technology can contribute alongside the incredible talent at Chip Ganassi Racing,” said Sam Altman, the CEO of OpenAI. “IndyCar is a sport where every detail counts, and we’re eager to see how advanced technology can support the team’s expertise in pushing performance forward.” Ganassi’s race teams plan to utilize OpenAI’s artificial intelligence technology to maximize performance on the racetrack and in the front office by using the company’s software engineering and research capabilities. Ganassi teams will work with OpenAI’s engineers. “Over the years, we have had the good fortune of partnering with some of the most iconic brands in the world, but I am not sure there is one that is more important right now than OpenAI,” Ganassi said. “Sam and his team have been amazing at helping us try to maximize the power of artificial intelligence to make us better both on and off the racetrack. We look forward to continuing to attack business and racing challenges with the folks at OpenAI, some of the smartest and most creative people around.” AP auto racing:https://apnews.com/hub/auto-racing",
        "tags": [
            "openai"
        ],
        "timestamp": "2025-02-28 17:14:27",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/democrats-influencers-digital-strategy-new-media-podcasts-04776c7db3984606289df74fbc0203c5",
        "source": "ap_news",
        "headline": "Democrats’ new digital strategy tops trending charts but also draws mockery from allies and foes",
        "content": "WASHINGTON (AP) — For weeks, Democratic lawmakers have met with and mimicked figures they believe may offer them a path back to power in Washington: online influencers and content creators.  Hours before President Donald Trump’sjoint addressto Congress this month, Senate Democrats huddled with a dozen online progressive personalities who have millions of followers. House Democrats were introduced, without staff, to 40 content creators who Democratic leaders said could help them grow their audience online.  An earlier tutorial session in February featured online personalities like the YouTube commentator Brian Tyler Cohen.  The result has been a burst of Democratic online content, including direct-to-camera explainers in parked cars, scripted vertical videos, podcast appearances and livestreams — some topping trending charts online, others drawing mockery from liberal allies and Republicans in Congress. Malcolm Kenyatta, center, a member of the Pennsylvania House of Representatives, poses with DNC content creators Kory Aversa, from left, Johnny Palmadessa and Alexander Pearlman at the Democratic National Convention, Aug. 22, 2024, in Chicago. (AP Photo/Pablo Martinez Monsivais, File)   But while the Democratic Party islargely dividedover the path forward after last year’s election losses, party leaders agree that, no matter the message, how they connect with voters in the digital media landscape will be key to a political comeback.   A post shared by Cory Booker (@corybooker)   More than a dozen Democratic senators, asked about the party’s digital strategy, pointed to Sen.Cory Bookerof New Jersey as the architect of their new push.  “We’ve seen tremendous growth of Democratic senators now. They’re engaging in the tools and strategies necessary to elevate their voice in a new, changing media market, where legacy media is not the place that people get their news now,” Booker said. “We’re just weeks into this, but just by making key changes ... we’re seeing a massive growth in engagement with the content that our senators are creating, and we’ve only just begun.”   Booker said he’s aiming for Democratic senators to double online engagement with their content over the next year — and early metrics have been noticeable. Democratic senators racked up more than 87 million views on content they published in response to Trump’s joint address to Congress, according to Booker’s office.   Hey@HouseDemocrats, we fixed this for you!https://t.co/8j9PzwF7l4pic.twitter.com/ogHTclsu7w   Not all of that online engagement is positive. After more than two dozen Democratic senators posted identical scripted videos knocking Trump’s speech, saying he should have addressed the cost of living and his support for billionaire adviserElon Musk, conservatives mocked them as inauthentic and out of touch.  “They are all actors reading a script,” Musk wrote on X, the social media platform he owns.  There’s no doubt that Democrats are playing catch-up. Trump and his fellow Republicans built a digital operation that fed on bombast and celebrity, and it’s a strategy they’vetaken with themto the White House. Official government accounts are new filled with right-wing memes, cinematic videos and pugnacious statements.  The Democratic embrace of influencers has also yielded mixed early results. Democrats were ridiculed online after a food and wellness influencer who attended the House Democrats’ creators event created a “Choose Your Fighter” video collage of Democratic congresswomen for Women’s History Month.  The White House posted a video in response that read “America chose its fighters last November,” and the Pentagon, normally known for being studiously non-partisan, posted a video stating “We chose our fighters a long time ago.”  But Booker and other Democratic leaders don’t consider the sneers to be a downside. Missteps are to be expected, they say, but the path to Americans’ attention will require some discomfort from lawmakers.  “I do think that the caucus as a whole is trying to figure out how we show people that we are real people,” said Rep. Jasmine Crockett of Texas, one of the congresswomen featured in the viral “Fighter” video. Crockett, whose posts regularly garner millions of views online, said she was used to criticism for her often frank statements and was more interested in combating perceptions that Democrats are “elitist” or “robotic.”  “I didn’t like the jumping, I’m going to be honest, though,” Crockett added about the viral “Choose Your Fighter” video.   The richest man in the world called Social Security a Ponzi scheme. Now, he's pushing to take away our seniors' benefits that they have EARNED through a lifetime of hard work.pic.twitter.com/kznNeajyOJ   Democrats adopted a more combative stance online in recent weeks asTrump’s moves to slash the federal workforcedrew protests from liberals and pushback at GOP town halls. Top Democratic digital operatives who worked for the 2024 presidential campaign of then-Vice President Kamala Harris have been in high demand, with many Democrats anticipating close 2026 races in which digital strategies may be key.  Some of the most prominent Democrats across the country have been engaging more in new media since the election. House Minority Leader Hakeem Jeffries of New York has touted the party’s message on progressive podcasts over the last month, including from the comedian Jon Stewart and the progressive outlet MeidasTouch. Clips of those videos were also lampooned online but garnered millions of views.  California Gov. Gavin Newsom, a potential Democratic presidential contender in 2028, haslaunched a podcastof his own on which he has welcomed close Trump allies like the right-wing activist Charlie Kirk and former Trump aide Steve Bannon to discuss hot-button political topics.  “We want to make sure we hit the podcasters that normally don’t have Democrats on there,” said Rep. Derek Tran, a Democrat from a competitive California House district. “The ones that are more right-leaning or independent, and be able to address a crowd and an audience that’s not typical for the Democratic base.” Content creators Kerry Robertson, from left, Sari Beth Rosenberg and Juan Acosta Macias are pictured during the Democratic National Convention in Chicago, Aug. 22, 2024. (AP Photo/Pablo Martinez Monsivais, File)       Some House Democrats have expressed frustration that the guidance from Democratic leaders about social media is too vague, while others grumble that leaders are too prescriptive in their approach to messaging on platforms they don’t intuitively understand. Meanwhile, Democratic strategists have cautioned lawmakers that garnering attention online is secondary to the goal of using social media as a tool in specific policy fights and campaigns.  “I think there’s a fine line before we’re being cringe and trying too hard and seeming too thirsty. I think the most important thing in any of this is being as authentic and genuine as we can be,” said Rep. Sara Jacobs, D-Calif.  “When it comes to authenticity, it also means leaning into what makes each of us unique. Like many of my colleagues probably should not be doing ‘get ready with me’ videos. It would look super cringe. But I’m a 36-year-old woman, and I do my makeup all the time, and I watch a lot of makeup tutorial videos, so it makes sense for me to do it,” said Jacobs.  Some Democrats think that the party’s messaging strategy hinges as much on the messengers as the medium it’s communicated on.  “If you know how to talk to people, it doesn’t matter what medium is going to exist,” said Sen. Ruben Gallego, a freshman Democratic senator from Arizona. “You could be the best freaking spokesperson in the world, but if you don’t know how to talk to working-class people, it doesn’t matter if you have the best TikTok following, it’s just not going to translate.”",
        "tags": [
            "apple",
            "alphabet",
            "amazon",
            "tesla"
        ],
        "timestamp": "2025-03-21 13:09:03",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/cybertruck-recall-tesla-elon-musk-nhtsa-8c517e21aa1119d74b9db39f6aca01b7",
        "source": "ap_news",
        "headline": "In latest blow to Tesla, regulators recall nearly all Cybertrucks",
        "content": "U.S. safety regulators on Thursday recalled virtually all Cybertrucks on the road, the eighth recall of the Tesla-made vehicles since deliveries to customers began just over a year ago. The National Highway Traffic Safety Administration’s recall, which covers more than 46,000 Cybertrucks, warned that an exterior panel that runs along the left and right side of the windshield can detach while driving, creating a dangerous road hazard for other drivers, increasing the risk of a crash. The stainless steel strip, called a cant rail assembly, between the windshield and the roof on both sides, is bound to the truck’s assembly with a structural adhesive, the NHTSA report said. The remedy uses an adhesive that’s not been found to be vulnerable to “environmental embrittlement,” the NHTSA said, and includes additional reinforcements. Tesla will replace the panel free of charge. Owner notification letters are expected to be mailed May 19, 2025. The recall of 46,096 Cybertrucks covers all 2024 and 2025 model years, manufactured from November 13, 2023, to February 27, 2025. The NHTSA order says that Tesla became aware of the problem early this year. Videos posted on social media showing people ripping the panels off of Cybertrucks with their hands have gone viral in recent days. The Cybertruck, which Tesla began delivering to buyers in late 2023, has been recalled eight times in the past 15 months for safety problems, includingonce in Novemberbecause a fault in an electric inverter can cause the drive wheels to lose power. Last April, the futuristic-looking trucks were recalled to fix acceleration pedals that can get stuck in the interior trim. Other recalls were related to windshield wipers and the display screen.  It’s the latest setback for the Elon Musk-owned electric automaker, which has come under attack since PresidentDonald Trumptook office and empowered Musk to oversee a new Department of Government Efficiency that’sslashing government spending. ATF investigators take apart and document a burned Tesla Cybertruck at a Tesla lot in Seattle, Monday, March 10, 2025. (AP Photo/Lindsey Wasson, File)  While no injuries have been reported, Tesla showrooms, vehicle lots, charging stations and privately owned cars have been targeted. Prosecutors in Coloradocharged a womanlast month in connection with attacks on Tesla dealerships, includingMolotov cocktails thrown at vehiclesand the words “Nazi cars” spray-painted on a building. And federal agents in South Carolina last week arrested a man they say set fire to Tesla charging stations near Charleston. An agent from the Bureau of Alcohol, Tobacco, Firearms and Explosives wrote in an affidavit that authorities found writings critical of the government and DOGE in his bedroom and wallet. Even before the attacks ramped up in recent weeks, Tesla has been struggling, facing increased competition from rival electric vehicles, particularly out of China. Though largely unaffected by Thursday’s recall announcement, Tesla shares have plummeted 42% in 2025, reflectingnewfound pessimismas sales crater around the globe. Un miembro del departamento de bomberos de Seattle inspecciona un Tesla Cybertruck en un estacionamiento de Tesla en Seattle, el lunes 10 de marzo de 2025. (AP Foto/Lindsey Wasson, Archivo)  With regard to Thursday’s recall, Cybertruck owners may contact Tesla customer service at 1-877-798-3752 and the National Highway Traffic Safety Administration Vehicle Safety Hotline at 888-327-4236, or go to nhtsa.gov.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-20 15:32:16",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://apnews.com/article/nhl-front-office-app-49b2f0421df504555bbc940bb861e4a2",
        "source": "ap_news",
        "headline": "NHL launches a front office iPad app to modernize roster, contract and salary cap info for teams",
        "content": "MANALAPAN, Fla. (AP) — The NHL has launched a front office app that modernizes the league’s roster, contract and salary cap information. The league worked with SAP to develop an app for Apple iPads that streamlines Central Registry data, cap and long-term injury status and no-trade and no-move clauses and lays it all out for general managers and league executives to access at their fingertips for the first time. Announced Thursday, GMs have been trying it out since late December. “Instead of traveling with a booklet of heavy — it looks like a magazine or a Bible, almost — having everything in one place on an iPad I think will just alleviate and make it easier and simpler to log on and check the status and sometimes your roster and how you can make transactions and stuff like that,” Philadelphia Flyers GM Daniel Briere told The Associated Press this week. The development comes eight years sincethe NHL put iPads in coaches’ and players’ handson benches during games. The hope is it will be used just as frequently to figure out trades, free agent signings and other moves. “The on-bench coaching app that we built together, that is a part of the game every single day and it’s built in a robust way that it can be part of the game every single day,” NHL chief operating officer Stephen McArdle said. “We’ve sort of done groundbreaking work on the coaching side. We’ve done groundbreaking work on the fan side with a lot of the statistical data that was powered many years ago by SAP when we re-did that (NHL.com stats) site, and now this is sort of the third leg of the stool with roster information.” Longtime hockey executive Don Waddell, in his first season as GM of the Columbus Blue Jackets, said it’s convenient to have “something to refer to quickly where you’re always asking those questions” about no-trade clauses and the like.  “And with any new app, it’s only going to continue to get better, so we’re excited about it,” Waddell said. “But I think the features that they’re offering right now is certainly something that we’re all going to be able to utilize.” The initial release of the SAP-NHL Front Office App is made up of three sections: — League view, which provides a high-level display of each team’s current and projected offseason cap situation, alerts for daily transactions with custom filters and a player watch list and draft grid of future picks with details on how they changed hands and conditions on selections. — Team view, which offers contract information for each player in the organization for the current season and the next eight. — Player view, which includes biographical information, contract details and PDFs, game logs and transaction history. McArdle said the idea was a result of the technology available combined with the needs expressed from organizations around the league. SAP VP of Global Sponsorships Dan Fleetwood pointed to the coaching app as the necessary first step to make this possible — and potentially speed up player movement around NHL. “It’s that type of a foundation that you need to really kind of grow and do something,” Fleetwood said. “We hope that it does power more trades or give people the ability to manipulate their rosters better.” In the aftermath of theWashington Capitals buyingand shuttering the popular CapFriendly site to make that their proprietary in-house data, places like PuckPedia and CapWages have emerged to fill the void for fans who at one point used CapGeek to look up or reimagine rosters. This app is for teams and teams only and expected to eventually be available on iPhone, but there is no plan to offer a version for the general public. “We’re currently focused on super-serving the clubs in the front office,” McArdle said. “There is so much information in this version that we think it is most appropriate for the front offices and for the clubs. Down the road, who knows, but right now it’s not our focus.” AP NHL:https://apnews.com/hub/nhl",
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-20 09:25:50",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-sues-cpsc-product-recalls-cbc117a5cc2c322bded2b3b93736121e",
        "source": "ap_news",
        "headline": "Amazon sues Consumer Product Safety Commission over recall order for hazardous products",
        "content": "NEW YORK (AP) —Amazonhas sued the U.S. Consumer Product Safety Commission for finding the e-commerce giantlegally responsiblefor the recalls of hundreds of thousands of products sold on its site. The independent federal agency ordered Amazon in January to take several actions, including notifying customers who bought more than 400,000 items covered by recalls and giving refunds to those who could prove the products were properly disposed of or destroyed. The order followed the commission’s unanimous determination last summer that Amazon was a “distributor” of faulty items sold on its website by third-party sellers and shipped through the company’s fulfillment service But Amazon has long disputed it qualifies as a “distributor” of products offered by other sellers. In its lawsuit filed on March 14, the company maintained it serves as a “third-party logistics provider” and therefore should not be held liable for recalls of products that were made, owned and sold by others. The commission sued Amazon in 2021 for allegedlydistributing hazardous items, accusing the company of puttingconsumer safetyat risk by failing to properly notify the public about recalled products that included defective carbon monoxide detectors and flammable children’s pajamas. Amazon said in its lawsuit that it issued previous recall notices and some refunds shortly after the CPSC raised safety concerns several years ago. The company argues the commission is an “unconstitutionally structured agency” that overstepped its authority with the new directive.  “The remedies ordered by the CPSC are largely duplicative of the steps we took several years ago to protect customers, which are the same steps we take whenever we learn about unsafe products,” Amazon said in a statement sent to The Associated Press. The Seattle-based company said it could not comment further on its lawsuit filed last week. Amazon and Elon Musk’s SpaceXalso have active lawsuits challenging the structure of the National Labor Relations Board as unconstitutional. Thetwo companies initiatedthe cases after the labor agency filed complaints against them in disputes about workers’ rights and union organizing. The Consumer Product Safety Commission declined to comment Wednesday on Amazon’s lawsuit complaint. In a Jan. 17 statement about the hazardous products order, Commissioner Richard L. Trumka Jr. said it was the CPSC’s job to “hold companies like Amazon accountable” and “no company is above the law.”",
        "tags": [
            "amazon",
            "tesla"
        ],
        "timestamp": "2025-03-19 18:52:32",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/meta-careless-people-bestseller-zuckerberg-bd010d09d5cfe5a4ff7dfd5419a56aa4",
        "source": "ap_news",
        "headline": "Controversial insider account by former Meta official has strong first-week sales",
        "content": "NEW YORK (AP) — A former Meta official’sexplosive insider accountsold 60,000 copies in its first week and reached the top 10 on Amazon.com’s best-seller list amid efforts by thesocial media giantto discredit the book. Released last week byFlatiron Books, a Macmillan imprint, Sarah Wynn-Williams’ “Careless People” alleges cruel and otherwise disturbing behavior byMark Zuckerberg,Joel Kaplan and other executives and describes Zuckerberg’s alleged efforts to win favor with Chinese officials. Meta has countered that Wynn-Williams, a former director of global public policy who left what was then Facebook in 2017, violated a severance agreement and wrote a book filled with inaccuracies. According to Flatiron, first week sales include print audio and digital editions. On Wednesday, “Careless People” ranked No. 3 on Amazon. In response to a complaint filed by Meta, emergency arbitrator Nicholas A. Gowen last week placed a hold on Wynn-Williams’ promoting the book or making further “critical claims” about her former employer. In his ruling, Gowen wrote that Meta had “established a likelihood of success on the merits of its contractual non-disparagement claim” against Wynn-Williams. Flatiron can still publish and promote “Careless People.” A statement from Meta praised the arbitrator’s decision, saying it “affirms that Sarah Wynn Williams’ false and defamatory book should never have been published.” Meta has otherwise called “Careless People” a “mix of out-of-date and previously reported claims about the company and false accusations about our executives.” Flatiron also issued a statement, saying it “was appalled by Meta’s tactics to silence our author through the use of a non-disparagement clause in a severance agreement.” The publisher added that the arbitrator had not addressed the allegations made by Wynn-Williams.  “The book went through a thorough editing and vetting process, and we remain committed to publishing important books such as this. We will absolutely continue to support and promote it,” the statement reads. Flatiron did not announce the book until just days before its release. Meta’s response has included queries to media outlets, among them The Associated Press, over their plans for coverage. Washington Post critic Ron Charles wrote last week that he had received repeated messages from Meta. “In my 27 years of reviewing and editing newspaper books sections, no company has ever done this with me,” he noted.",
        "tags": [
            "apple",
            "amazon",
            "meta"
        ],
        "timestamp": "2025-03-19 16:27:46",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-google-brussels-european-union-internet-8f1c2f1fda1d3ffeed50322df8093817",
        "source": "ap_news",
        "headline": "European Union lays out how Apple must open its tech up to competitors under bloc’s digital rules",
        "content": "LONDON (AP) — The European Union on Wednesday outlined the steps that Apple must take to open up its iPhone and iPad operating systems to work better with competing technologies. It’s the first time the EU has moved to compel a technology company to comply with the bloc’s digital Digital Markets Act — a wide-ranging set of regulations designed to prevent Big Tech “gatekeeper” companies from cornering markets. After the DMA took effect a year ago, the EU’s executive Commission moved swiftly toopen a raft of investigationsinto Big Tech companies. Brussels also opened two “specification proceedings” in September to spell out what Apple needs to do under the DMA, which aims to make digital markets “fairer” and “more contestable” by breaking up closed tech ecosystems that lock consumers into a single company’s products or services. In its legally binding decision, the commission detailed measures that the iPhone maker has to take involving nine connectivity features for its iOS operating system. The measures will give device and app makers better access to iPhone features that work with devices. For example, iPhone users will have “enhanced possibilities” to receive notifications on non-Apple smartwatches, including receiving pictures and the ability to reply to them. Users could also benefit from more seamless pairing of wireless headphones from other brands. Access to Apple’s wireless file transfer technology would let third-party developers create apps similar to the AirDrop feature.  The commission also laid out a second set of measures to make the process for software developers requesting access to iPhone features more transparent and effective. Among the changes are better access to technical documentation not yet available to third parties, it said. With its decision, Brussels is “providing regulatory certainty both to Apple and to developers,” the European Commission Executive Vice President Teresa Ribera said in a press release. “Effective interoperability” for will mean “better choice for consumers in the fast-growing market for innovative connected devices,” she said. European consumer group BEUC hailed the decision. “For too long, Apple has operated a walled garden around its products and prevented interoperability,” Director General Agustin Reyna said. Apple, however, voiced its unhappiness, saying it’s bad for the company’s products and for European users. “Today’s decisions wrap us in red tape, slowing down Apple’s ability to innovate for users in Europe and forcing us to give away our new features for free to companies who don’t have to play by the same rules,” the company said in a statement. Apple said it will continue to work with the European Commission to “help them understand our concerns on behalf of our users.” The Commission also said Wednesday that Google wasn’t doing enough to comply with DMA. Despite making changes, including removing flight listings, Google was still giving preference to its own services in search results, it said. Google is also failing to let app developers steer users to cheaper options outside its Google Play Store app marketplace, the commission said in preliminary findings. While it’s acceptable for Google to charge a fee for downloading an app in its app store, the company is charging fees that “go beyond what is justified,” for every purchase of digital goods or services, it said. Google said the EU findings will require the company to make even more changes to how it displays some search results, “which would make it harder for people to find what they are looking for and reduce traffic to European businesses. This is, quite simply, misguided.” The commission’s app store findings, meanwhile, “create a false choice between openness and security” and risk exposing Europe users to more “malware and fraud,” it added. Google now has the chance to reply to the findings. If the commission decides Google is in “non-compliance” with the DMA, it can issue a fine of up to 10% of the company’s annual global revenue. But officials have said that they want to avoid issuing blockbuster fines and instead negotiate with companies to get them to comply. The EU’s crack down on the global tech industry has irritated President Donald Trump, who recently blasted the bloc’s hefty antitrust fines for U.S. tech companies. Vice-President JD Vance, meanwhile, has railed against excessive AI regulation, in a rebuke aimed at the EU’s sweeping Artificial Intelligence Act. However, both companies have been under pressure in the U.S. too. Apple is facing a Justice Departmentantitrust lawsuitaccusing it of engineering an illegal smartphone monopoly. Meanwhile, federal antitrust regulators are seeking to break up Google after a federal judge ruled Google’s ubiquitous search engine has been illegally exploiting its dominance to squash competition and stifle innovation.",
        "tags": [
            "apple",
            "alphabet",
            "amazon"
        ],
        "timestamp": "2025-03-19 13:51:17",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-gtc-jensen-huang-ai-457e9260aa2a34c1bbcc07c98b7a0555",
        "source": "ap_news",
        "headline": "Nvidia CEO Jensen Huang unveils new Rubin AI chips at GTC 2025",
        "content": "Nvidia founder Jensen Huang kicked off the company’s artificial intelligence developer conference on Tuesday by telling a crowd of thousands that AI is going through “an inflection point.” At GTC 2025 — dubbed the “Super Bowl of AI” — Huang focused his keynote on the company’s advancements in AI and his predictions for how the industry will move over the next few years. Demand for GPUs from the top four cloud service providers is surging, he said, adding that he expects Nvidia’s data center infrastructure revenue to hit $1 trillion by 2028. Huang’s highly anticipated announcement revealed more details around Nvidia’s next-generation graphics architectures: Blackwell Ultra and Vera Rubin -- named for the famous astronomer. Blackwell Ultra is slated for the second half of 2025, while its successor, the Rubin AI chip, is expected to launch in late 2026. Rubin Ultra will take the stage in 2027. In a talk that lasted at over two hours, Huang outlined the “extraordinary progress” that AI has made. In 10 years, he said, AI graduated from perception and “computer vision” to generative AI, and now to agentic AI — or AI that has the ability to reason. “AI understands the context, understands what we’re asking. Understands the meaning of our request,” he said. “It now generates answers. Fundamentally changed how computing is done.” The next wave of AI, he said, is already happening: robotics.  Robotics fueled by so-called “physical AI” can understand concepts like friction and inertia, cause and effect, and object permanence, he said. “Each one of these phases, each one of these waves, opens up new market opportunities for all of us,” Huang said. The key to that physical AI, and many of Huang’s other announcements, was the concept of using synthetic data generation — AI or computer-created data — for model training. AI needs digital experiences to learn from, he said, and it learns at speeds that make using humans in the training loops obsolete. “There’s only so much data and so much human demonstration we can perform,” he said. “This is the big breakthrough in the last couple of years: reinforcement learning.” Nvidia’s tech, he said, can help with that type of learning for AI as it attacks or tries to engage in solving a problem, step by step. To that end, Huang announced Isaac GR00T N1, an open-source foundation model designed to assist in developing humanoid robots. Isaac GR00T N1 would be paired with an updated Cosmos AI model to help develop simulated training data for robots. Benjamin Lee, a professor of electrical and systems engineering at the University of Pennsylvania, said that the challenge in training robotics lies in data collection because training in the real world is time-consuming and expensive. A simulated environment has long been a standard for reinforcement learning, Lee said, so researchers can test the effectiveness of their models. “I think it’s really exciting. Providing a platform, and an open-source one, will allow more people to learn on reinforcement learning,” Lee said. “More researchers could start playing with this synthetic data — not just big players in the industry but also academic researchers.” Huang introduced the Cosmos series of AI models, which can generate cost-efficient photo-realistic video that can then be used to train robots and other automated services, at CES earlier this year. The open-source model, which works with the Nvidia’s Omniverse — a physics simulation tool — to create more realistic video, promises to be much cheaper than traditional forms of gathering training, such as having cars record road experiences or having people teach robots repetitive tasks. U.S. car maker General Motors plans to integrate Nvidia technology in its new fleet of self-driving cars, Huang said. The two two companies will work together to build custom AI systems using both Omniverse and Cosmos to train AI manufacturing models. The Nvidia head also unveiled the company’s Halos system, an AI solution built around automotive — especially autonomous driving — safety. “We’re the first company in the world, I believe, to have every line of code safety assessed,” Huang said. At the end of his talk, Huang an open-source physics engine for robotics simulation called Newton, which is being developed with Google DeepMind and Disney Research. A small, boxy robot named Blue joined him on stage, popping up from a hatch in the floor. It beeped at Huang and followed his commands, standing beside him as he wrapped up his thoughts. “The age of generalist robotics is here,” Huang said.",
        "tags": [
            "nvidia",
            "alphabet"
        ],
        "timestamp": "2025-03-18 17:24:30",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/google-alphabet-wiz-32-billion-e50fb41b9a84a1056a116f963e6efed0",
        "source": "ap_news",
        "headline": "Google to buy cybersecurity firm Wiz for $32 billion in the biggest deal in company’s history",
        "content": "SAN FRANCISCO (AP) —Googlehas struck a deal to buy cybersecurity firm Wiz for $32 billion in what would be the tech giant’s biggest-ever acquisition at the same time it’s facing a potential breakup of its internet empire. The proposed takeoverannounced Tuesdayis part of Google’s aggressive expansion into cloud computing during an artificial intelligence boom. The frenzy is driving demand for data centers that provide the computing power for AI technology and intensifying the competition in that space among Google and two other tech powerhouses, Microsoft and Amazon. If the all-cash transaction is approved by regulators, Wiz will join Google Cloud — an increasingly important part of its business separate from the search and advertising operations that account for most of the $350 billion annual revenue at Google’s parent company, Alphabet. With the advent of AI, however, the cloud division has become a rising star at Google. Annual revenue in the division was $26.3 billion in 2022, and soared 64% to $43.2 billion last year. Wiz, a five-year-old startup founded by four longtime friends who met in the Israeli army when they were still teenagers, is on track for an estimated $1 billion in revenue this year. After getting its start in Israel in 2020, Wiz now oversees an operation that makes security tools protecting the information stored in data centers from its current headquarters in New York. “Wiz and Google Cloud are both fueled by the belief that cloud security needs to be easier, more accessible, more intelligent, and democratized, so more organizations can adopt and use cloud and AI securely,” Wiz CEO Assaf Rappaportwrote in a blog post.  In a Tuesday conference call, Google CEO Sundar Pichai predicted Cloud division’s addition of Wiz will result in even better security at a lower cost than can be provided now. That prediction may have been aimed as much at regulators likely to scrutinize how the deal will affect competition and pricing, as much as at prospective customers. Google had been courting Wiz for some time before finally settling on a price that’s much richer than areported $23 billion bidthat was rejected last July. At that time, Wiz signaled it would instead pivot back to a previously-planned initial public offering. But recent volatility in the stock market has chilled the IPO market, and now Rappaport said Wiz expects to “innovate even faster” by becoming a part of Google. Wedbush analysts called Google’s move to buy Wiz “a shot across the bow” at other tech giants, particularly Microsoft and Amazon, who have already made big bets on cyber security as the fight to dominate cloud computing intensifies. Google had fallen behind its competition in the cloud space, Wedbush said, but the acquisition of Wiz could alter the parameters. The bid Tuesday easily eclipses the current largest acquisition in Google’s 26-year history — a $12.5 billion takeover of Motorola Mobility in 2012 that didn’t pay off the way that the Mountain View, California, company had hoped. The $32 billion purchase of Wiz would also go down as the biggest-ever cybersecurity acquisition and rank among the 20 most expensive takeovers of a software company in history, according to Mergermarket, a financial intelligence service. As often happens with high-priced acquisitions, investors reacted coolly to Tuesday’s news. Alphabet’s shares declined 2% to close at $160.67. Some of Google’s other acquisitions have turned into gold mines, most notably its $1.76 billion purchase of online video pioneer YouTube in 2006 and its $3.1 billion takeover of advertising technology platform DoubleClick in 2008. A $5.4 billion purchase of another security firm, Mandiant, in 2022 also helped fuel the recent growth of Google’s Cloud division, which posted an operating profit of $6.1 billion last year. Google’s DoubleClick deal is now part of an antitrust case filed by the U.S. Justice Department targeting Google’s technology for distributing ads across the internet. A rulingin that case, involving allegations that Google illegally abused its power to manipulate digital ad prices, is expected this year. Regulatorsin the U.S.andabroadare targeting Google on other fronts, too. Last year, a federal judge in another case brought by the Justice Department last year concluded Google had turned its ubiquitous search engineinto an illegal monopoly.The penalization phase of that trial begins next month. The Justice Department is seeking a rebuke that would include a requirement for Googleto sell its Chrome web browserand would ban the company from making agreements with Apple and other companies to make its search engine the default tool for finding online information on the iPhone and other devices. The Wiz deal will also get a close look from antitrust regulators. While many expect the Trump administration to welcome more dealmaking than occurred during the previous years, it has also expressed leeriness about Big Tech getting any bigger. Andrew Ferguson, the Trump administration’s Federal Trade Commission Chairman, has been particularly outspoken about his resolve to keep Big Tech on a short leash. The deal raises antitrust concerns due to the potential impact on standalone cyber security vendors, as well as potential disruption for bigger rivals. Still, Wedbush’s analysts note the industry is “ripe for consolidation” — which could pose “massive growth opportunities on the horizon heading into this AI Revolution.” Antitrust worries were also believed among the reasons Wiz called off sales talks with Google last year while President Joe Biden’s administration was seeking to block a variety of tech deals. Agreeing to a sale now indicates both Google and Wiz are more confident the deal will gain U.S. approval under the Trump administration, Mergermarket analysts Kevin Ketcham and Kevin McCaffrey wrote in a Tuesday note. “The two sides likely wouldn’t have struck the deal if they didn’t at least see a potential path to closing,” Ketcham and McCaffrey wrote. But the business watchdog group Demand Progress Education Fund urged the Trump administration to block Google’s takeover attempt. “It’s time to show the public whether they have the guts to step in and stop a big fish from being gobbled up by one of the biggest fishes in the pond,” said Emily Peterson-Cassin, the group’s director of corporate power. If they get the regulatory greenlight and meet several conditions spelled out in their agreement, Google and Wiz expect the deal to close in 2026. Grantham-Philips reported from New York.",
        "tags": [
            "microsoft",
            "apple",
            "alphabet",
            "amazon"
        ],
        "timestamp": "2025-03-18 16:32:37",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/stocks-markets-rates-nvidia-91a42e60248e389f1650bd744e6d9a2e",
        "source": "ap_news",
        "headline": "Stock market today: Wall Street falls sharply as Nvidia tumbles 8.5% and AI mania falters",
        "content": "NEW YORK (AP) — U.S. stock indexes fell sharply Thursday as Wall Street’s frenzy aroundartificial-intelligencetechnology faltered some more. The S&P 500 sank 1.6% for itsfifth dropin six days after setting anall-time high last week. Concerns aboutthe U.S. economy’s futurehave been behind much of the drop, including worries about howtariffspushed byPresident Donald Trumpcould worseninflation, and Wall Street’s main measure of health has lost all but 1.4% of its rally since Election Day. The Dow Jones Industrial Average dropped 193 points, or 0.4%, and the Nasdaq composite tumbled 2.8%. Weighing most heavily on the market was superstar stockNvidia, one of Wall Street’s most influential companies that’s been leading the market for years. After initially rising at the open of trading following abetter-than-expected profit report, Nvidia quickly slid to a loss of 8.5%. Better-than-expected earnings reports have become routine for Nvidia, whose chips are powering the surge intoartificial-intelligencetechnology, but this was the company’s first sinceDeepSeekshook theentire AI industry. AP business correspondent Damian Troise reports markets are off to a mixed start. After the Chinese upstart said it developed a large language model that can compete with the world’s best without using the most expensive chips, Wall Street had to question all the spending it assumed would go into Nvidia’s chips and the ecosystem that’s built around the AI boom, such as electricity to power large data centers.  Nvidia’s performance for the latest quarter, along with its forecasts for upcoming results, were “good enough to keep the debate moving in a positive direction,” according to analysts at UBS led by Timothy Arcuri. But it apparently wasn’t enough to send Nvidia’s stock higher, particularly given criticism that its price had already leaped too high, too quickly. After more than tripling two years ago, Nvidia’s stock more than doubled last year as its sales exploded. The market also soured on Salesforce, which fell 4% despite topping analysts’ profit expectations for the latest quarter. Several analysts called the performance solid, and the company continued to tout its AI offerings, but it gave a forecast for upcoming revenue that fell short of expectations. One AI-related company bucking the trend was Snowflake. The AI data cloud company rose 4.5% after delivering stronger profit and revenue for the latest quarter than analysts expected. It joined a range of stocks on the more staid end of Wall Street, ones that didn’t grab as many headlines as AI stocks in recent years. Despite the sharp loss for the overall S&P 500, close to 2 out of every 5 stocks in the index climbed. A 1.7% rise for Berkshire Hathaway, the company run by famed investor Warren Buffett, was one of the strongest upward forces on the index. The owner of Geico, BNSF railroad and other businesses has builta hoard of unused cashrecently. That could indicate Buffett, who’s famous for buying stocks when prices are low, may not see much worth purchasing in a market that critics say looks too expensive. Some investors have been waiting for other stocks to pick up the market’s leadership baton from Nvidia and the handful of big stocks that dominated for years. Nvidia alone accounted for a little more than 22% of the entire total return for the S&P 500 index last year. All told, the S&P 500 fell 94.49 points to 5,861.57 Thursday. The Dow Jones Industrial Average dropped 193.62 to 43,239.50, and the Nasdaq composite tumbled 530.84 to 18,544.42. In the bond market, Treasury yields swung following Trump’s latest announcement ontariffs. He said “the proposed TARIFFS scheduled to go into effect on MARCH FOURTH will, indeed, go into effect, as scheduled” for imports from Canada and Mexico. He also said he would add an additional 10% tariff on Chinese products on that date. Such moves could push up prices for U.S. households when inflation has already proven to be stubborn. Wall Street has been hoping the threats are merely leverage that Trump will use to negotiate with other countries before ultimately inflicting less pain on the economy than feared. But even if that proves to be the case, all the talk on tariffs has already gottenU.S. households to feel more nervousabout the economy. That’s dangerous because their strong spending has been a main reason the U.S. economy has avoided a recession. Such uncertainty also pressures the Federal Reserve, which has few if any tools to help an economy where growth is slowing and inflation is rising at the same time. Jeff Schmid, president of the Federal Reserve Bank of Kansas City, said in a speech Thursday that he has “become more cautious” in his hopes that inflation will continue to ease. He also said that discussions with people in his district suggest “elevated uncertainty might weigh on growth” for the economy. For now, at least, the U.S. economy appears to be in solid shape. The government on Thursday left alone its estimate for theU.S. economy’s performance during the last three months of 2024, though it raised its estimate for a measure of inflation during the quarter. A separate report saidmore U.S. workers applied for unemploymentbenefits last week. While the number is at a three-month high, it’s still nowhere close to where it’s been in past recessions. In the bond market, the yield on the 10-year Treasury edged up to 4.27% from 4.26% late Wednesday. In stock markets abroad, indexes were mixed across Europe and Asia. Germany’s DAX lost 1.1%, while Japan’s Nikkei 225 added 0.3%. AP Business Writers Matt Ott and Elaine Kurtenbach contributed.",
        "tags": [
            "nvidia"
        ],
        "timestamp": "2025-02-27 16:11:42",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/trump-economy-tariffs-stock-musk-business-8a5f28d9bb16e0b8a924d99ead0907fa",
        "source": "ap_news",
        "headline": "Trump halts doubling of tariffs on Canadian metals after Ontario suspends electricity price hikes",
        "content": "▶ Follow live updates onPresident Donald Trump and his administration WASHINGTON (AP) — PresidentDonald Trump‘s threat Tuesday to double hisplanned tariffson steel and aluminum from 25% to 50% for Canada led the provincial government of Ontario to suspend its planned surcharges on electricity sold to the United States. As a result, White House trade adviser Peter Navarro said the U.S. president pulled back on his doubling of steel and aluminum tariffs, even as the federal government still plans to place a 25% tariff on all steel and aluminum imports starting Wednesday. The drama delivered a win for Trump but also amplified concerns about tariffs that have roiled the stock market and stirred recession risks. Tuesday’s escalation and cooling in the ongoing trade war between the United States and Canada only compounded the rising sense of uncertainty of how Trump’s tariff hikes will affect the economies of both countries. President Donald Trump delivers remarks in the Oval Office of the White House in Washington, Friday, March 7, 2025. (Pool via AP)  Trump shocked markets Tuesday morning, saying the increase ofthe tariffsset to take effect Wednesday was a response to the 25% price hike thatOntario put on electricitysold to the United States. “I have instructed my Secretary of Commerce to add an ADDITIONAL 25% Tariff, to 50%, on all STEEL and ALUMINUM COMING INTO THE UNITED STATES FROM CANADA, ONE OF THE HIGHEST TARIFFING NATIONS ANYWHERE IN THE WORLD,” Trump posted on Truth Social. Ontario Premier Doug Ford said Tuesday afternoon that U.S. Commerce Secretary Howard Lutnick called him and Ford agreed to remove the surcharge. He said he was confident that the U.S. president would also stand down on his own plans for 50% tariffs on Canadian steel and aluminum.  Coils of steel are seen at the ArcelorMittal Dofasco Steel Plant in Hamilton, Ontario, Friday, Feb. 14, 2025. (Chris Young/The Canadian Press via AP)  “He has to bounce it off the president but I’m pretty confident he will pull back,” Ford said on Trump’s steel and aluminum tariff threat. “By no means are we just going to roll over. What we are going to do is have a constructive conversation.” After abrutal stock market selloffMonday and further jittersTuesday, Trump faces increased pressure to show he has a solid plan to grow the economy. So far the president is doubling down on tariffs and can point to Tuesday’s drama as evidence that taxes on imports are a valuable negotiating tool, even if they can generate turmoil in the stock market. AP Washington correspondent Sagar Meghani reports on a growing trade war with Canada. Trump suggested Tuesday that tariffs were critical for changing the U.S. economy, regardless of stock market gyrations. The U.S. president has given a variety of explanations for his antagonism of Canada. He has said that his separate 25% tariffs on all imports from Canada, some of which are suspended for a month, are about fentanyl smuggling and objections to Canada putting high taxes on dairy imports that penalize U.S. farmers. He also continued to call for Canadato become part of the United States, which has infuriated Canadian leaders. “The only thing that makes sense is for Canada to become our cherished Fifty First State,” Trump posted Tuesday. “This would make all Tariffs, and everything else, totally disappear.” IncomingCanadian Prime Minister Mark Carneysaid his government will keep tariffs in place until Americans show respect and commit to free trade after Trump threatened historic financial devastation for his country. Carney, who will be sworn in as Justin Trudeau’s replacement in coming days, said Trump’s latest tariffs are an attack on Canadian workers, families and businesses. “My government will keep our tariffs on until the Americans show us respect and make credible, reliable commitments to free and fair trade,” Carney said in a statement. Canadian officials are planning retaliatory tariffs in response to Trump’s specific steel and aluminum tariffs. Those are expected to be announced Wednesday. Carney was referring to an initial $30 billion Canadian (US$21 billion) worth of retaliatory tariffs that have been applied on items like American orange juice, peanut butter, coffee, appliances, footwear, cosmetics, motorcycles and certain pulp and paper products. Trump also has targeted Mexico with 25% tariffs because of his dissatisfaction over drug trafficking and illegal immigration, though he suspended the taxes on imports that are compliant with the 2020 USMCA trade pact for one month. Asked if Mexico feared it could face the same 50% tariffs on steel and aluminum as Canada, President Claudia Sheinbaum, said, “No, we are respectful.” Trump participated in a question and answer session Tuesday afternoon with the Business Roundtable, a trade association of CEOs that he wooed during the 2024 campaign with the promise of lower corporate tax rates for domestic manufacturers. But his tariffs on Canada, Mexico and China — with plans for more to possibly come on Europe, Brazil, South Korea, pharmaceutical drugs, copper, lumber and computer chips — would amount to a massive tax hike. The stock market’s vote of no confidence over the past two weeks puts the president in a bind between his enthusiasm for taxing imports and his brand as a politician who understands business based on his own experiences in real estate, media and marketing. “The tariffs are having a tremendously positive impact — they will have, and they are having.” Trump told the gathering of CEOs, saying the import taxes would cause more factories to relocate to the United States. Harvard University economist Larry Summers, President Bill Clinton’s treasury secretary, has put the odds of a recession at 50-50. The investment bank Goldman Sachs revised down its growth forecast for this year to 1.7% from 2.2% previously. It modestly increased its recession probability to 20% “because the White House has the option to pull back policy changes if downside risks begin to look more serious.” Trump has tried to assure the public that his tariffs would cause a bit of a “transition” to the economy, with the taxes prodding more companies to begin the yearslong process of relocating factories to the United States to avoid the tariffs. But he set off alarms in an interview broadcast Sunday in which he didn’t rule out a possible recession. The promise of great things ahead did not eliminate anxiety, with the S&P 500 stock index tumbling 2.7% on Monday in an unmistakable Trump slump that has erased the market gains that greeted his victory in November 2024. The S&P 500 index fell roughly 0.8% on Tuesday, paring some of the earlier losses after Ontario backed down on electricity surcharges. The Dow Jones Industrial Average lost 478 points, and the Nasdaq composite slipped 0.2%. Trump has long relied on the stock market as an economic and political gauge to follow, only to look past it as he remains determined so far to impose tariffs. When he won the election last year, he proclaimed that he wanted his term to be considered to have started Nov. 6, 2024, on Election Day, rather than his Jan. 20, 2025, inauguration, so that he could be credited for post-election stock market gains. Trump also repeatedly warned of an economic freefall if he lost the election. “If I don’t win you will have a 1929 style depression. Enjoy it,” Trump said at an August rally in Pennsylvania. Associated Press writer Fabiola Sanchez contributed to this report from Mexico City. Gillies reported from Toronto.",
        "tags": [
            "apple",
            "amazon",
            "meta"
        ],
        "timestamp": "2025-03-11 21:19:21",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-prime-ai-dubbing-movies-ccf67a44f86e60e69a2677650a05ab3a",
        "source": "ap_news",
        "headline": "Amazon is now testing AI-aided dubbing for some movies and series on Prime",
        "content": "Amazon is testing artificial intelligence-aided dubbing for select movies and shows offered on its Prime streaming service. The company said this week that the AI-assisted dubbing – which refers to the practice of replacing an original audio track with a translated language – will be offered for licensed titles that previously lacked dubbing, such as the 2003 animated film “El Cid: La Leyenda.” The Seattle-based company said its AI-aided dubbing service will be in English and Latin American Spanish. Initially, it will be offered for 12 licensed titles. Amazon says the program will take a hybrid approach, allowing “local processionals to collaborate with AI to ensure quality control.” Other tech companies have also introduced AI-powered dubbing into their platforms. Last year, YouTube released a feature that allows content creators to translate their videos into multiple languages. Meta, meanwhile, said in September that it was testing an AI tool that will automatically translate voices in Reels.",
        "tags": [
            "alphabet",
            "amazon",
            "meta"
        ],
        "timestamp": "2025-03-06 10:30:54",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/google-search-artificial-intelligence-overviews-c4061a38b5e186f7abc41ee011da329f",
        "source": "ap_news",
        "headline": "Google leans further into AI-generated overviews for its search engine",
        "content": "Google is updating its ubiquitous search engine with the next generation of its artificial intelligence technology as part of an effort to provide instant expertise amid intensifying competition from smaller competitors. The company announced Wednesday that it will feed itsGemini 2.0 AI modelinto its search engine so it can field more complex questions involving subjects such as computer coding and math. As has been the casesince last May, the AI-generated overviews will be placed above the traditional web links that have become the lifeblood of online publishers dependent on traffic referrals from Google’s dominant search engine. Google is broadening the audience for AI overviews in the U.S. by making them available to teenage searchers without requiring them to go through a special sign-in process to see them. The stage is also being set for what could turn out to be one of the most dramatic changes to the search engine’s interface since Google co-founders Larry Page and Sergey Brin started the company in a Silicon Valley garage during the late 1990s. Google is going to begin a gradual rollout of an “AI mode” option that will result in the search engine generating even more AI overviews. When search is in AI mode, Google is warning the overviews are likely to become more conversational and sometimes head down online corridors that result in falsehoods that the tech industry euphemistically calls “hallucinations.” “As with any early-stage AI product, we won’t always get it right,” Google product vice president Robby Stein wrotein a blog postthat also acknowledged the possibility “that some responses may unintentionally appear to take on a persona or reflect a particular opinion.”  More stringent guardrails are supposed to be in place to prevent AI mode from steering people in the wrong direction for queries involving health and finance. The need for additional fine tuning is one reason Google is initially only offering AI mode in its experimental Labs section, and only subscribers to its $20-per-month Google One AI Premium will be allowed to test it out at first. But these tests almost always result in the technology being released to all comers — a goal that Google is pursuing in response to AI-powered search engines from ChatGPT and Perplexity. Google’s amped-up usage of more sophisticated AI overviews is likely to amplify worries that the summaries will make web surfers even less likely to click on links to take them to sites with useful information on the topic. Those traffic referrals are one of the main ways that online publishers attract the clicks needed to sell the digital ads that help finance their operations. Google executives insist AI overviews are still driving traffic to other sites by driving up people’s curiosity so they engage in more queries to learn more, resulting in more clicks to other publishers. But those reassurances haven’t placated publishers who believe that Google will be the main beneficiary of AI overviews, further enriching an internet empire that already generates more than $260 billion in annual ad revenue. The expanded use of AI overviews also could expose Google to more allegations that it is abusing the power of a search engine that a federal judge last year foundto be an illegal monopolyin attempt to maintain its position as the internet’s main gateway. The U.S. Justice Department, which filed the monopoly claims against Google in 2020, is now proposinga partial breakup of the companythat would include the sale of its Chrome browser as part of its punishment. The hearings on the proposed penalties against Google, which may include digging deeper into its use of AI, are scheduled to begin next month in Washington D.C. Online educational online service Chegg already has amplified on that monopoly case with a lawsuit filed last month in the same Washington court accusing Google of improperly cribbing information from its site to present in its AI Overviews. Google has denied the allegations.",
        "tags": [
            "alphabet",
            "amazon",
            "openai"
        ],
        "timestamp": "2025-03-05 12:20:04",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://apnews.com/article/microsoft-openai-chatgpt-competition-britain-uk-e94a99716f7e226db2c7e98976832ac2",
        "source": "ap_news",
        "headline": "UK watchdog drops competition review of Microsoft’s OpenAI deal",
        "content": "LONDON (AP) — Britain’s competition watchdog said Wednesday it has dropped its review of Microsoft’s partnership with OpenAI, saying it’s satisfied that the deal doesn’t need a closer investigation under the country’s merger rules. The Competition and Markets Authority said that based on “available evidence,” the partnership between the U.S. tech giant and the ChatGPT maker doesn’t qualify for a merger investigation. “In particular the CMA does not consider there has been a change of control by Microsoft from material influence to de facto control over OpenAI,” the watchdog said in a statement. Microsoft was a big initial backer of OpenAI, plowing billions of dollars into the San Francisco-based startup in its early days. But since then OpenAI has attracted otherbig investorsincluding Japan’s Softbank and chipmaker Nvidia after its success with ChatGPT. The CMA has stepped up scrutiny of AI deals amid a wave of investment from Big Tech companies into startups working on generative artificial intelligence. Last year it approved anotherMicrosoft dealinvolving Inflection AI as well as partnerships with chatbot maker Anthropic by Google andAmazon.",
        "tags": [
            "nvidia",
            "microsoft",
            "alphabet",
            "amazon",
            "openai"
        ],
        "timestamp": "2025-03-05 09:21:27",
        "headline_tags": [
            "microsoft",
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/elon-musk-openai-lawsuit-f5724e7ab07b5bed8292a1e8aa2ef695",
        "source": "ap_news",
        "headline": "Judge denies Elon Musk’s request to block OpenAI for-profit conversion but welcomes trial",
        "content": "OAKLAND, Calif. (AP) — A federal judge has denied Elon Musk’s request for a court order blocking OpenAI from converting itself to afor-profit companybut said she could expedite a trial to considerMusk’s claims against the ChatGPT makerand its CEO. U.S. District Judge Yvonne Gonzalez Rogers ruled late Tuesday that “Musk has not demonstrated likelihood of success on the merits” in his request for a preliminary injunction. She offered to hold a trial in her California courtroom as soon as this fall, “given the public interest at stake and potential for harm if a conversion contrary to law occurred.” Musk, an early OpenAI investor, began a legal offensive against the ChatGPT maker and CEO Sam Altman a year ago,suing for breach of contractover what he said was the betrayal of itsfounding aims as a nonprofit. He escalated the legal dispute late last year, adding new claims and defendants, including Microsoft, and asking for a court order that would stop OpenAI’s plans to convert itself into a for-profit business. Musk also added his own AI company, xAI, as a plaintiff, claiming that OpenAI was unfairly stifling business competition. He and a group of investors more recently made anunsolicited $97.4 billion bidto buy a controlling stake in the nonprofit — a move that undermined Musk’s “claim of irreparable harm,” the judge wrote. OpenAI said it welcomed the court’s decision.  “This has always been about competition,” a statement from the company said. “Elon’s own emails show that he wanted to merge a for-profit OpenAI into Tesla. That would have been great for his personal benefit, but not for our mission or U.S. interests.” Musk alleges in the lawsuit that the companies are violating the terms of his foundational contributions to the charity. He had invested about $45 million in the startup from its founding until 2018, his lawyer has said. Musk attorney Marc Toberoff said in a statement late Tuesday that he is pleased that the court offered an expedited trial on the core claims. “We look forward to a jury confirming that Altman accepted Musk’s charitable contributions knowing full well they had to be used for the public’s benefit rather than his own enrichment,” Toberoff said. Gonzalez Rogers in a hearing last month called it a “stretch” to claim “irreparable harm” to Musk, and she called the case “billionaires vs. billionaires.” She questioned why Musk invested tens of millions in OpenAI without a written contract. Toberoff responded that it was because the relationship between Altman and Musk at the time was “built on trust” and the two were very close. “That is just a lot of money” to invest “on a handshake,” the judge said. The dispute has roots in a 2017 internal power struggle at the fledgling startup that led to Altman becoming OpenAI’s CEO. Emails disclosed by OpenAI show Musk had also sought to be CEO and grew frustrated after two other OpenAI co-founders said he would hold too much power as a major shareholder and chief executive if the startup succeeded in its goal to achieve better-than-human AI known asartificial general intelligence. Musk haslong voiced concernsabout how advanced forms of AI could threaten humanity. Altman eventually succeeded in becoming CEO and has remained so except for a period in 2023 when he was firedand then reinstateddays later after the board that ousted him was replaced. Gonzalez Rogers, appointed by then-President Barack Obama in 2011, has handled a number of tech industry cases including Apple’sfight with Epic Games, though she said last month that Musk’s case is “nothing like” that one. That case was also the last time she granted a preliminary injunction, eight months before the case went to trial. O’Brien reported from Providence, Rhode Island. The Associated Press and OpenAI havea licensing and technology agreementthat allows OpenAI access to part of AP’s text archives.",
        "tags": [
            "microsoft",
            "apple",
            "amazon",
            "tesla",
            "openai"
        ],
        "timestamp": "2025-03-05 09:49:47",
        "headline_tags": [
            "tesla",
            "openai"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-ai-artificial-intelligence-f72da2deff83510987a0017e61eac335",
        "source": "ap_news",
        "headline": "Nvidia sales surge in the fourth quarter on demand for AI chips",
        "content": "LOS ANGELES (AP) — Nvidia on Wednesday reported a surge in fourth-quarter profit and sales as demand for its specialized Blackwell chips, which power artificial intelligence systems, continued to grow, sending the company’s stock higher after hours. For the three months that ended Jan. 26, the tech giant based in Santa Clara, California, posted revenue of $39.3 billion, up 12% from the previous quarter and 78% from one year ago. Adjusted for one-time items, it earned 89 cents a share. “Demand for Blackwell is amazing as reasoning AI adds another scaling law — increasing compute for training makes models smarter and increasing compute for long thinking makes the answer smarter,” Nvidia Founder Jensen Huang said in a statement. Nvidia has ramped up the massive-scale production of Blackwell AI supercomputers, Huang said, “achieving billions of dollars in sales in its first quarter.” “AI is advancing at light speed as agentic AI and physical AI set the stage for the next wave of AI to revolutionize the largest industries,” he said. Wednesday’s earnings report topped Wall Street expectations. Analysts had been expecting adjusted earnings of 85 cents a share on revenue of $38.1 billion, according to FactSet. Nvidia reported net income of $22.06 billion in the fourth quarter, beating analysts’ predictions of $19.57 billion. The tech giant expected sales to continue to grow, forecasting revenue of around $43 billion for the first quarter of fiscal 2026. Data center sales, which account for much of Nvidia’s revenues, were a core part of that uptick — fourth-quarter revenue was $35.6 billion, up 93% from one year ago.  The growth in the data center market comes as President Donald Trump has talked up a joint venture investing up to $500 billion for infrastructure tied to AI through a new partnership formed by OpenAI, Oracle and SoftBank. The Stargate project will start building out data centers and the energy generation needed for the further development of AI, according to the White House. Nvidia is a partner in that project. On an earnings call Wednesday afternoon, Nvidia Chief Financial Officer Colette Kress said that fourth-quarter Blackwell sales exceeded the company’s expectations. “We delivered $11 billion of Blackwell architecture revenue in the fourth quarter of fiscal 2025, the fastest product ramp in our company’s history,” Kress said. “Blackwell sales were led by large cloud service providers which represented approximately 50% of our data center revenue.” The poster child of the AI boom, Nvidia has grown into the second-largest company on Wall Street — it is nowworth over $3 trillion— and the stock’s movement carries more weight on the S&P 500 and other indexes than every company except Apple. Two years ago, Nvidia’s market value was below $600 billion. Nvidia and other companies benefiting from the AI boom have been a major reason the S&P 500 has climbed to record after record recently, with the latest coming last week. Their explosion of profits has helped to propel the market despite worries about stubbornly high inflation and possible pain coming for the U.S. economy from tariffs and other policies of President Donald Trump. But those tariffs are still “an unknown,” Kress said, until Nvidia can better understand what the Trump administration’s plan is. “We are awaiting,” she said, adding that the company would follow any export controls or tariff rules. The fourth-quarter earnings are the company’s first report since Chinese company DeepSeek boasted it had developed a large language model that could compete with ChatGPT and other U.S. rivals, but was more cost-effective in its use of Nvidia chips to train the system on troves of data. The frenzy over DeepSeek caused $595 billion in Nvidia’s wealth to vanish briefly. But the company in a statement commended DeepSeek’s work as “an excellent AI advancement” that leveraged “widely-available models and compute that is fully export control compliant.” “DeepSeek R1 has ignited global enthusiasm,” Huang said on Wednesday’s earnings call. “It’s an excellent innovation, but even more importantly, it has open-sourced a world-class reasoning AI model. Nearly every AI developer is applying R1, or chain of thought and reinforcement learning techniques like R1, to scale their models’ performance.” Speaking to investors, Huang said the “next wave” of AI is coming with “agentic AI for enterprise, physical AI for robotics and sovereign AI as the different regions build out their AI for their own ecosystems.” “We’re in the center of much of this development,” Huang said.",
        "tags": [
            "nvidia",
            "apple",
            "openai"
        ],
        "timestamp": "2025-02-26 18:51:47",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/amazon-alexa-fee-ai-assistant-017c17bddfa6742d1e78873cdda3663f",
        "source": "ap_news",
        "headline": "Amazon’s new AI-powered Alexa promises to be your ‘best friend in a digital world’ for a monthly fee",
        "content": "NEW YORK (AP) —Amazonon Wednesday unveiled agenerative-AIinfused Alexa that it says will allow thepopular voice assistantto have more personality, check a user’s tone and even plan romantic dates. But unlike before, when Alexa was offered for free on any Alexa-enabled devices, customers will have to pay Amazon a monthly fee of $19.99 for the revamped voice assistant, which it calls “Alexa+”. However, the generative-AI powered Alexa will be free for Prime members, who pay the company a monthly or annual fee for free delivery and other perks. At a media event held in New York City, Amazon executives showed off the update to the ten-year old digital assistant with the new features aimed at boosting sales and interactions with Alexa-enabled devices. The company says Alexa+ is able to have conversations with a more natural, humanlike flow and can learn more about a user — such as dietary preferences or allergies — the more it’s used. “I’m not just an assistant, I’m your new best friend in the digital world,” Alexa+ said during an onstage demo on Wednesday. At the event, Panos Panay, Amazon’s senior vice president of devices & services, listed off the other things the voice assistant can now do, such as create study plans, text a babysitter and call an Uber ride for a friend. He and other company executives also said Alexa can fetch videos from Ring cameras — such as checking whether a user’s dog was walked that day — and is able to remember handwritten recipes, emails and other documents shared with it. “She’s smarter than she’s ever been before, but she’s also approachable,” Panay said.  Alexa is built into products such as smart speakers, Amazon’s Fire TVs and earbuds. The Seattle-based tech giant launched its popular voice assistant in 2014 alongside its first Echo device, which responds to voice commands. Panay said Amazon has sold more than 600 million Alexa-enabled devices and that user engagement grew 20% last year compared to 2023. Some market estimates have shown Alexa holds the largest market share among voice assistants. The revamped Alexa uses large language models, including some developed by Amazon and others by Anthropic, the generative AI startup the tech giant has poured billions into. Alexa+ has a “model-agnostic system,” allowing it to select the best AI model for the tasks it wants to complete, said Daniel Rausch, Amazon’s vice president for Alexa and Echo. Amazon says it will kick off “early access” of Alexa+, currently only available in English, in the U.S. next month — starting with users who own or purchase some of its newest Echo Show devices, which feature onscreen displays of Alexa responses. After opting in, those eligible users will then see Alexa+ start working across compatible devices, as well as on their web browser and app, the company said. Amazon will later roll out the update in “waves” internationally and to more devices. Some of the new features are only built for products with screens. Alexa+ will not reach certain older Echo models — but Amazon says owners of those devices can continue to use the original assistant. And users who simply prefer using the original Alexa can continue doing so, pera FAQfrom the company. Amazon’s announcement came more than a yearafter the company teased an early versionof an AI-infused Alexa at a media event held to show off new devices. At the time, Amazon had said it was working on a “speech-to-speech” model that would allow Alexa to exhibit humanlike attributes, such as laughter and phrases like “uh-huh” during conversations. During the demo on Wednesday, Amazon highlighted features it had previously kept under lid. In one exchange, Panay showed the new Alexa a video of the crowd in the room to test a feature that apparently allows it to sense the surrounding mood. Panay asked Alexa+ if the crowed “looked pumped” to which it responded the room full of journalists were “paying attention to you and excited.” Like its predecessor, Alexa+ is enabled when users say the voice assistant’s name — but executives on Wednesday said users now only have to say that wake word once before having a prolonged, back and forth exchange. Still, demonstrators would occasionally say “Alexa” again if it seemed like the voice assistant didn’t catch something. Amazon competes in the smart speaker market with other tech giants, including Apple and Google. Though it has had success in selling devices, the company’s other goal — driving Amazon purchases through Alexa — has been more challenging to pull off. Amazon has said Alexa customers have used their device to shop. However, many rely on it mostly for menial tasks, such as playing music, asking questions or checking the weather. A subscription fee for the revamped Alexa will allow the company to offset costs related to AI development and help its devices operations become more profitable. This story was corrected to show that is Panos Panay is Amazon’s senior vice president, not vice president, of devices & services.",
        "tags": [
            "apple",
            "alphabet",
            "amazon",
            "openai"
        ],
        "timestamp": "2025-02-27 09:01:57",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-chips-revenue-deepseek-apple-1063d50f560f48c04fb97539d566c46e",
        "source": "ap_news",
        "headline": "Nvidia posted another strong quarterly report. What to know, by the numbers",
        "content": "Wall Street once again fixated on an earnings report fromNvidia, the main player in the artificial intelligence mania. The chipmaker reported earnings after the bell Wednesday that topped analyst forecasts, and shares added 2% in after-hours trading, perhaps indicating that Wall Street quietly hoped for even better results. This is Nvidia’s first earnings report since a Chinese upstart,DeepSeek, upended the artificial-intelligence industry by saying it has developed a large language model that can compete with big U.S. rivals without having to use the most expensive chips. Nvidia’s market value saw a one-day drop of nearly $600 billion after the news came out. Here’s a look at Nvidia, by the numbers. Nvidia’s total market value as of the close Wednesday, before the release of its earnings report. That’s second in the S&P 500 behind Apple ($3.611 trillion). Microsoft is third with a market value just below $3 trillion ($2.972 trillion). Two years ago, Nvidia’s market value was below $600 billion. The one-day drop in Nvidia shares on Jan. 27 after DeepSeek’s revelation called into question all the spending Wall Street had assumed would go into not only Nvidia’s chips but also the ecosystem that’s built around the AI boom. The stock rose more than 170% in 2024. Nvidia’s revenue for the fourth quarter, easily topping Wall Street’s estimate and up 78% from last year’s fourth quarter.  Nvidia’s revenue for the fiscal year that ended in January 2025. That was more than double its revenue for fiscal 2024 and more than four times its receipts the year before that. That’s approximately how much of the S&P 500’s gain for last year could be attributed to Nvidia alone, according to S&P Dow Jones Indices. By comparison, Amazon accounted for about 6% of the gain.Nvidia replaced Intel in the Dow Jones Industrial Averagein November. That’s how many dozen eggs one could buy with Nvidia’s market value of $3.215 trillion, using the average price of $4.95 per dozen for January from the Federal Reserve. Egg prices have spiked due to an outbreak of bird flu, and supplies of eggs have run short in some areas.",
        "tags": [
            "nvidia",
            "microsoft",
            "apple",
            "amazon"
        ],
        "timestamp": "2025-02-26 17:13:33",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/israel-palestinians-ai-technology-microsoft-gaza-lebanon-90541d4130d4900c719d34ebcd67179d",
        "source": "ap_news",
        "headline": "Microsoft workers protest sale of AI and cloud services to Israeli military",
        "content": "WASHINGTON (AP) — Five Microsoft employees were ejected from a meeting with the company’s chief executive for protesting contracts to provide artificial intelligence and cloud computing services to the Israeli military.  The protest on Monday came after an investigation by The Associated Pressrevealed last weekthat sophisticated AI models from Microsoft and OpenAI had been used as part of an Israeli military program to select bombing targets during the recent wars in Gaza and Lebanon. The story also contained details of an errant Israeli airstrike in 2023 that struck a vehicle carrying members of a Lebanese family, killing three young girls and their grandmother.  Microsoft CEO Satya Nadella was speaking about new products at an employee town hall meeting at the company’s corporate campus in Redmond, Washington. Workers standing about 15 feet to his right then revealed T-shirts that when they stood side-by-side spelled out the question “Does Our Code Kill Kids, Satya?”  Photos and videoof the incident, which was live streamed throughout the company, shows Nadella kept speaking and did not acknowledge the protesters. Two men quickly tapped the workers on the shoulders and ushered them out of the room.  “We provide many avenues for all voices to be heard,” Microsoft said in a statement provided to the AP. “Importantly, we ask that this be done in a way that does not cause a business disruption. If that happens, we ask participants to relocate. We are committed to ensuring our business practices uphold the highest standards.”     Microsoft did not answer Tuesday when asked whether the employees involved in the protest would face disciplinary action. The company also previously declined to comment about the AP’s Feb. 18 story about its contracts with the Israeli military.  In October, Microsoftfired two workersfor helping organize an unauthorized lunchtime vigil for Palestinian refugees at its headquarters. Microsoft said at the time that it ended the employment of some people “in accordance with internal policy” but declined to give details.  A group of workers has been raising concerns within the company for months about Microsoft providing services to the Israeli military through its Azure cloud computing platform. Some employees at the company have also spoken out in support of Israel andsaid those supporting Palestinians have made them feel unsafe.  The AP’s investigation included exclusive details drawn from internal company data and documents, including that the usage of AI models by the Israeli military through Azure increased nearly 200 times after the Oct. 7, 2023, attack by Hamas militants. Microsoft CEO Satya Nadella speaks at the Microsoft Ignite conference, Nov. 19, 2024, in Chicago. (AP Photo/Charles Rex Arbogast, File)   The AP’s report was shared and discussed among Microsoft employeeson social mediaand within the company’s internal systems. In a community forum designated for employees to raise concerns with senior leadership, an employee shared links to the AP report. More than a dozen others questioned whether the company was violating itsstated principles to defend human rightsand not to let its AI models be used to harm people, according to screenshots reviewed by the AP.  Abdo Mohamed, a researcher and data scientist who was one of the Microsoft workers fired over the October vigil, said the company is prioritizing profits over its own human rights commitments.  “The demands are clear,” said Mohamed, who works with a group of Microsoft workers called No Azure for Apartheid. “Satya Nadella and Microsoft executives need to answer to their workers by dropping contracts with the Israeli military.”   Contact AP’s global investigative team at[email protected]or https://www.ap.org/tips/",
        "tags": [
            "microsoft",
            "openai"
        ],
        "timestamp": "2025-02-25 18:43:52",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://apnews.com/article/nvidia-jensen-huang-artificial-intelligence-ai-9566689191825de4d83900603e0355c4",
        "source": "ap_news",
        "headline": "Why Nvidia’s earnings are important to the entire U.S. stock market",
        "content": "LOS ANGELES (AP) — Sales of Nvidia’s artificial intelligence chip Blackwell will be top of mind when the company releases its latest financial results Wednesday, with analysts eyeing future demand amid a Chinese upstart’s claim that it can train competitive AI models using far fewer resources. Wall Street expects Nvidia to report fourth-quarter adjusted earnings of 85 cents per share on revenue of $38.08 billion, according to FactSet. The company’s net income is expected to reach $19.58 billion. What happens with Nvidia matters for the entire U.S. stock market. The chip company has grown into the second-largest company on Wall Street, which means the stock’s movement carries more weight on the S&P 500 and other indexes than every company except Apple. The tech giant, based in Santa Clara, California, is nowworth over $3 trillion. Nvidia and other companies benefiting from the AI boom have been a major reason the S&P 500 has climbed to record after record recently, with the latest coming last week. Their explosion of profits has helped to propel the market despite worries about stubbornly high inflation and possible pain coming for the U.S. economy from tariffs and other policies of President Donald Trump. Nvidia alone accounted for more than a fifth of all of the S&P 500 index’s total return last year. None of the other 499 companies in the index came close. If Nvidia can’t keep up its momentum, particularly when critics say its stock price has climbed too much and too quickly, Americans holding S&P 500 index funds in their 401(k) and other investing accounts could be set for pain.  The fourth-quarter earnings will be the company’s first report since Chinese company DeepSeek boasted it had developed a large language model that could compete with ChatGPT and other U.S. rivals, but was more cost-effective in its use of Nvidia chips to train the system on troves of data. The frenzy over DeepSeek caused $595 billion in Nvidia’s wealth to briefly vanish. But the company in a statement commended DeepSeek’s work as “an excellent AI advancement” that leveraged “widely-available models and compute that is fully export control compliant.” Nvidia had carved out an early lead in the AI applications race, partly because of founder and CEO Jensen Huang’s successful bet on the chip technology used to fuel the industry. The company is no stranger to big bets. Nvidia’s invention of the graphics processor unit, or GPU, in 1999 helped spark the growth of the PC gaming market and redefined computer graphics. Nvidia will release its quarterly earnings after the market closes Wednesday. —— Associated Press writer Stan Choe contributed to this report.",
        "tags": [
            "nvidia",
            "apple",
            "openai"
        ],
        "timestamp": "2025-02-25 04:00:08",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://apnews.com/article/apple-low-cost-iphone-artificial-intelligence-1fc43f8b839d7995763fbe939f5de290",
        "source": "ap_news",
        "headline": "Apple unveils a souped-up and more expensive version of its lowest priced iPhone",
        "content": "Apple has released a sleeker and more expensive version of its lowest priced iPhone in an attempt to widen the audience for a bundle of artificial intelligence technology that the company has been hoping will revive demand for its most profitable product lineup. The iPhone 16e unveiled Wednesday is the fourth-generation of a model that’s sold at a dramatically lower price than the iPhone’s standard and premium models. The previous bargain-bin models were called the iPhone SE, with the last version coming out in 2022. Like the higher-pricediPhone 16 lineup unveiled last September, the iPhone 16e includes the souped-up computer chip needed to process an array of AI features that automatically summarize text, audio and create on-the-fly emojis while smartening up the device’s virtual assistant, Siri. It will also have a more powerful battery and camera. All those upgrades will translate into a higher starting price for an iPhone 16e at $600, a 40% increase from $430 for the last iPhone SE. But iPhone 16e will be more affordable than the cheapest standard iPhone 16 at $800. The new phone will be available in stores Feb. 28, but can be pre-ordered beginning Friday. “We’re so excited for iPhone 16e to complete the lineup as a powerful, more affordable option to bring the iPhone experience to even more people,” said Kaiann Drance, an Apple vice president in charge of promoting a device lineup that accounts for more than half of the company’s revenue.  But Apple is also trying to balance its desire to offer a more affordable iPhone that will lure more people into its sphere of product against its self interest in maximizing its profits from selling higher price products, according to Forrester Research analyst Dipanjan Chatterjee. “The problem with a lower-end product in a luxury portfolio is that you want it to be good but not so good as to cannibalize the crown jewels,” Chatterjee said. Although Apple has been hyping itsforay into AI since last June, the complete set of features still haven’t been released in the U.S. and the technology still isn’t even available in some parts of the world. The delays in making the iPhone’s AI — dubbed “Apple Intelligence’” — more widely available through free software updates dinged the Cupertino, California, company during the past holiday whensales of the device dipped slightlyfrom their 2023 levels. Apple has primarily been losing the ground in China, where it hasn’t yet specified when the iPhone’s AI technology will be available. But the company recently struck an AI partnership with Alibaba in China that could pave the way for the technology coming to iPhones in that country this spring. Besides being able to handle AI for the first time, the iPhone 16e has a different look from previous SE models. It boasts a 6.1-inch display screen, slightly larger than the 4.7-inch display on SE model and no longer has a home screen button like the SE had. The new iPhone 16e will rely include a facial recognition option for unlocking the device, just like the higher priced models do. Apple’s shares edged higher Wednesday to close at $244.87, below the stock’s peak of roughly $260 reached in late December.",
        "tags": [
            "apple"
        ],
        "timestamp": "2025-02-19 16:26:46",
        "headline_tags": [
            "apple"
        ]
    }
]