[
    {
        "url": "https://www.bbc.com/news/articles/cd65d583qvzo",
        "source": "bbc",
        "headline": "Chinese electric carmaker BYD sales beat Tesla",
        "content": "Chinese electric vehicle (EV) maker BYD has reported annual revenue for 2024 that has leapfrogged rival Tesla. The Shenzhen-based firm says revenue rose by 29% to come in at 777 billion yuan ($107bn; £83bn), boosted by sales of its hybrid vehicles. This topped the $97.7bn reported by Elon Musk's Tesla. BYD has also just launched a lower-priced car to rival Tesla's Model 3, which has long been the top selling EV in China. It comes as Tesla faces a backlash around the world over Musk's ties to US President Donald Trump, while Chinese carmakers have been hit with tariffs in Western countries. BYD sold around the same number of EVs as Tesla last year – 1.76 million compared to 1.79 million, respectively. But when sales of the Chinese company's hybrid cars are taken into account it is much bigger, selling a record 4.3 million vehicles globally in 2024. On Sunday, BYD announced a new model to take on Tesla. Its Qin L model has a starting price in China of 119,800 yuan, while a basic version of Tesla's Model 3 is priced at 235,500 yuan. It comes as Chinese consumers are cutting spending in the face of economic challenges, including a property crisis, slowing growth, and high local government debt. Last week, BYD's founder Wang Chuanfu announced new battery charging technology, which he said could charge an EV in five minutes. That compares with around 15 minutes to charge a Tesla using its supercharger system. In February, BYD announced that its so-called \"God's Eye\" advanced driver-assistance technology would be available free in all its models. Shares in the firm, which is backed by veteran US investor Warren Buffett, have jumped by more than 50% so far this year. A backlash against Musk and his carmaker has gathered momentum since he was appointed head of the Trump administration's Department for Government Efficiency (DOGE), which has been tasked with slashing federal government spending. Musk has also intervened in politics abroad, including giving his backing to far-right party Alternative für Deutschland ahead of Germany's parliamentary election and criticising UK politicians such as Prime Minister Keir Starmer. Meanwhile, China's EV manufacturers have been targeted with tariffs in large parts of the world, including the US and the European Union.",
        "tags": [
            "amazon",
            "tesla"
        ],
        "timestamp": "2025-03-25 03:24:09",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c0kglle0p3vo",
        "source": "bbc",
        "headline": "Meta considers charging for ad-free Facebook and Instagram in the UK",
        "content": "Facebook and Instagram owner Meta is considering a paid subscription in the UK which would remove adverts from its platforms. Under the plans, people using the social media sites could be asked to pay for an ad-free experience if they do not want their data to be tracked. It comes as the companyagreed to stop targeting ads at a British womanlast week following a protracted legal battle. Meta already provides ad-free subscriptions for Facebook and Instagram users in the EU, starting from €5.99 (£5) a month. A spokesperson for the firm said the company was \"exploring the option\" of offering a similar service in the UK. They said the firm was \"engaging constructively\" with the UK data watchdog about the subscription service, following a consultation in 2024. The Information Commissioner's Officepreviously saidit expected Meta to consider data protection concerns before it launched an ad-free subscription. Meta says personalised advertising allows its platforms to be free at the point of access. Guidance issued by the regulator in January states thatusers must be presented with a genuine free choice. Social media platforms such as Meta heavily rely on ad revenues, and the company says personalised advertising allows its platforms to be free. Advertising accounted for more than 96% of its revenuein its latest quarterly financial results. Other social platforms including Snapchat, TikTok and X (formerly Twitter) have also looked to ad-free options as a way to raise more money through subscriptions. A number of online services, such as news publishers, are asking users to either pay up or consent to being tracked while using the platform for free. The Guardianbecame the latest UK publisher to start doing this in March, following in the footsteps of the Daily Mirror, the Independent and others. The advertising model, known as \"consent or pay\", has become increasingly popular. Publishers say they have no choice due to growing pressures on their finances, while  campaigners say it is unfair to users to ask them to pay up in exchange for not being targeted with ads. And \"consent or pay\" models may fall foul of data protection law in the UK if a user's consent has not been \"freely given\", according to the ICO. \"If organisations choose to adopt a 'consent or pay' model, they must demonstrate the model is compliant with UK data protection law,\" a spokesperson told the BBC. \"This means that, among other data protection standards, organisations must demonstrate that people can freely give their consent to processing of their personal information for personalised advertising.\" Users of Facebook and Instagram in the EU have been able to subscribe in order to avoid adverts on their feedssince October 2023. Meta initially launched its ad-free subscriptions at the cost of €9.99 a month. But it reduced its prices and said it would provide a way for users not willing to pay to opt to see adverts which are \"less personalised\",in response to regulatory concerns. It said the users will still see ads, but they may be \"less relevant\" to their interests. But social media expert Matt Navarra said he thinks an ad-free subscription would see limited uptake in the UK, which he says has been the case in the EU. \"Most users would rather pay with their data than part with real cash,\" he told the BBC. He said Meta's plans may instead represent an attempt to future-proof against further regulation by offering a choice. \"This is Meta building a safety net for a future where data collection gets a lot messier,\" he said. \"We're entering the era where people have to choose between money and privacy and for now, most will keep scrolling for free.\"",
        "tags": [
            "meta"
        ],
        "timestamp": "2025-03-24 15:45:53",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cewk49j7j1po",
        "source": "bbc",
        "headline": "The man with a mind-reading chip in his brain - thanks to Elon Musk",
        "content": "Having a chip in your brain that can translate your thoughts into computer commands may sound like science fiction - but it is a reality for Noland Arbaugh. In January 2024 - eight years after he was paralysed - the 30-year-old became the first person to get such a device from the US neurotechnology firm, Neuralink. It was not the first such chip - a handful of other companies have also developed and implanted them - but Noland's inevitably attracts more attention because of Neuralink's founder: Elon Musk. But Noland says the important thing is neither him nor Musk - but the science. He told the BBC he knew the risks of what he was doing - but \"good or bad, whatever may be, I would be helping\". \"If everything worked out, then I could help being a participant of Neuralink,\" he said. \"If something terrible happened, I knew they would learn from it.\" Noland, who is from Arizona, was paralysed below the shoulders in a diving accident in 2016. His injuries were so severe he feared he might not be able to study, work or even play games again. \"You just have no control, no privacy, and it's hard,\" he said. \"You have to learn that you have to rely on other people for everything.\" The Neuralink chip looks to restore a fraction of his previous independence, by allowing him to control a computer with his mind. It is what is known as a brain computer interface (BCI) - which works by detecting the tiny electrical impulses generated when humans think about moving, and translating these into digital command, such as moving a cursor on a screen. It is a complex subject that scientists have been working on for several decades. Inevitably, Elon Musk's involvement in the field has catapulted the tech - and Noland Arbaugh - into the headlines. It's helped Neuralink attract lots of investment - as well as scrutiny over the safety and significance of what is an extremely invasive procedure. When Noland's implant was announced,experts hailed it as a \"significant milestone\", while also cautioning that it would take time to really assess - especially given Musk's adeptness at \"generating publicity for his company.\" Musk was cagey in public at the time, simply writing in a social media post: \"Initial results show promising neuron spike detection.\" In reality, Noland said, the billionaire - who he spoke to before and after his surgery - was far more optimistic. \"I think he was just as excited as I was to get started,\" he said. Nonetheless, he stresses that Neuralink is about more than its owner, and claims he does not consider it \"an Elon Musk device\". Whether the rest of the world sees it that way -especially given his increasingly controversial role in the US government- remains to be seen. But there is no questioning the impact the device has had on Noland's life. When Noland awoke from the surgery which installed the device, he said he was initially able to control a cursor on a screen by thinking about wiggling his fingers. \"Honestly I didn't know what to expect - it sounds so sci-fi,\" he said. But after seeing his neurons spike on a screen - all the while surrounded by excited Neuralink employees - he said \"it all sort of sunk in\" that he could control his computer with just his thoughts. And - even better - over time his ability to use the implant has grown to the point he can now play chess and video games. \"I grew up playing games,\" he said - adding it was something he \"had to let go of\" when he became disabled. \"Now I'm beating my friends at games, which really shouldn't be possible but it is.\" Noland is a powerful demonstration of the tech's potential to change lives - but there may be drawbacks too. \"One of the main problems is privacy,\" said Anil Seth, Professor of Neuroscience, University of Sussex. \"So if we are exporting our brain activity [...] then we are kind of allowing access to not just what we do but potentially what we think, what we believe and what we feel,\" he told the BBC. \"Once you've got access to stuff inside your head, there really is no other barrier to personal privacy left.\" But these aren't concerns for Noland - instead he wants to see the chips go further in terms of what they can do. He told the BBC he hoped the device could eventually allow him to control his wheelchair, or even a futuristic humanoid robot. Even with the tech in its current, more limited state, it hasn't all been smooth sailing though. At one point, an issue with the device caused him to lose control of his computer altogether, when it partially disconnected from his brain. \"That was really upsetting to say the least,\" he said. \"I didn't know if I would be able to use Neuralink ever again.\" The connection was repaired - and subsequently improved - when engineers adjusted the software, but it highlighted a concern frequently voiced by experts over the technology's limitations. Neuralink is just one of many companies exploring how to digitally tap into our brain power. Synchron is one such firm, which says its Stentrode device aimed at helping people with  motor neurone disease requires a less invasive surgery to implant. Rather than requiring open brain surgery, it is installed into a person's jugular vein in their neck, then moved up to their brain through a blood vessel. Like Neuralink, the device ultimately connects to the motor region of the brain. \"It picks up when someone is thinking of tapping or not tapping their finger,\" said chief technology officer Riki Bannerjee. \"By being able to pick up those differences it can create what we call a digital motor output.\" That output is then turned into computer signals, where it is currently being used by 10 people. One such person, who did not want his last name to be used, told the BBC he was the first person in the world to use the device with Apple's Vision Pro headset. Mark said this has allowed him to virtually holiday in far-flung locations - from standing in waterfalls in Australia to strolling across mountains in New Zealand. \"I can see down the road in the future a world where this technology could really, really make a difference for someone that has this or any paralysis,\" he said. But for Noland there is one caveat with his Neuralink chip - he agreed to be part of a study which installed it for six years, after which point the future is less clear. Whatever happens to him, he believes his experience may be merely scratching the surface of what might one day become a reality. \"We know so little about the brain and this is allowing us to learn so much more,\" he said. Additional reporting by Yasmin Morgan-Griffiths.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-23 01:04:10",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c204yvv1eexo",
        "source": "bbc",
        "headline": "Tesla vandals face up to 20 years in prison, says attorney general",
        "content": "US Attorney General Pam Bondi said on Thursday that three defendants accused of vandalism targeting Elon Musk's Tesla electric vehicle company could face up to 20 years in prison. Bondi said the damage to Tesla cars, dealerships and charging stations was \"domestic terrorism\". Arrests and charges against the three suspects were previously announced by prosecutors. Tesla dealerships across the country have been targeted in a wave of protests, but also vandalism and arson attacks, in response to Musk's influence over the Trump administration. There is no specific US law against domestic terrorism, but prosecutors can request longer prison sentences if convicted criminals have a terrorism-related motive. Trump and Musk have called the attacks domestic terrorism, too. Supporters of the administration have also reportedly been \"swatted\" – subjected to armed police raids after hoax emergency calls. A statement from the Department of Justice on Thursday did not name the suspects in the Tesla vandalism. However, the details of the three cases outlined in the news release match arrests and charges previously announced by prosecutors. The suspects include Lucy Nelson, 42, who was charged with possession of a destructive device and malicious destruction of property after being spotted near the site of a Tesla dealership in Colorado. The dealership had been targeted with a Molotov cocktail attack and graffiti which caused damage of between $5,000 and $20,000, according to a criminal complaint. That suspect has pleaded not guilty. Adam Matthew Lansky, 41, was charged with possession of a destructive device after Molotov cocktails were thrown at a Tesla dealership in Salem, Oregon. He has yet to enter a plea and will face a preliminary hearing in April. The third, 24-year-old Daniel Clarke-Pounder, was charged with arson after allegedly throwing Molotov cocktails at Tesla charging stations in North Charleston, South Carolina, and spray-painting the car park. In a statement, Bondi said: \"The days of committing crimes without consequence have ended. \"Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.\" The attorney general said the three suspects could face between five and 20 years in prison if convicted. The BBC attempted to contact lawyers for the three defendants.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-21 01:20:20",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c0kgydkr516o",
        "source": "bbc",
        "headline": "Man files complaint after ChatGPT said he killed his children",
        "content": "A Norwegian man has filed a complaint after ChatGPT falsely told him he had killed two of his sons and been jailed for 21 years. Arve Hjalmar Holmen has contacted the Norwegian Data Protection Authority and demanded the chatbot's maker OpenAI is fined. It is the latest example of so-called \"hallucinations\", where artificial intelligence (AI) systems invent information and present it as fact. Mr Holmen says this hallucination is damaging to him. \"Some think that there is no smoke without fire - the fact that someone could read this output and believe it is true is what scares me the most,\" he said. OpenAI says this case relates to a previous version of ChatGPT and it has since updated its models. Mr Holmen was given the false information after he used ChatGPT to search for: \"Who is Arve Hjalmar Holmen?\" The response he got from ChatGPT included: \"Arve Hjalmar Holmen is a Norwegian individual who gained attention due to a tragic event. \"He was the father of two young boys, aged 7 and 10, who were tragically found dead in a pond near their home in Trondheim, Norway, in December 2020.\" Mr Holmen said the chatbot got their age gap roughly right, suggesting it did have some accurate information about him. Digital rights group Noyb, which has filedthe complainton his behalf, says the answer ChatGPT gave him is defamatory and breaks European data protection rules around accuracy of personal data. Noyb said in its complaint that Mr Holmen \"has never been accused nor convicted of any crime and is a conscientious citizen\". ChatGPT carries a disclaimer which says: \"ChatGPT can make mistakes. Check important info.\" Noyb says that is insufficient. \"You can't just spread false information and in the end add a small disclaimer saying that everything you said may just not be true,\" Noyb lawyer Joakim Söderberg said. OpenAI said in a statement: \"We continue to research new ways to improve the accuracy of our models and reduce hallucinations. \"While we're still reviewing this complaint, it relates to a version of ChatGPT which has since been enhanced with online search capabilities that improves accuracy.\" Hallucinations are one of the main problems computer scientists are trying to solve when it comes to generative AI. These are when chatbots present false information as facts. Earlier this year, Applesuspended its Apple Intelligencenews summary tool in the UK after it hallucinated false headlines and presented them as real news. Google's AI Gemini has alsofallen foul of hallucination- last year it suggested sticking cheese to pizza using glue, and said geologists recommend humans eat one rock per day. It is not clear what it is in the large language models - the tech which underpins chatbots - which causes these hallucinations. \"This is actually an area of active research. How do we construct these chains of reasoning? How do we explain what what is actually going on in a large language model?\" said Simone Stumpf, professor of responsible and interactive AI at the University of Glasgow. Prof Stumpf says that can even apply to people who work behind the scenes on these types of models. \"Even if you are more involved in the development of these systems quite often, you do not know how they actually work, why they're coming up with this particular information that they came up with,\" she told the BBC. ChatGPT has changed its model since Mr Holmen's search in August 2024, and now searches current news articles when it looks for relevant information. Noyb told the BBC Mr Holmen had made a number of searches that day, including putting his brother's name into the chatbot and it produced \"multiple different stories that were all incorrect\". They also acknowledged the previous searches could have influenced the answer about his children, but said large language models are a \"black box\" and OpenAI \"doesn't reply to access requests, which makes it impossible to find out more about what exact data is in the system.\"",
        "tags": [
            "apple",
            "openai"
        ],
        "timestamp": "2025-03-21 11:37:19",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
        "source": "bbc",
        "headline": "Google agrees to pay $28m in racial bias lawsuit",
        "content": "Google has agreed to pay $28m (£21.5m) to settle a lawsuit that claimed white and Asian employees were given better pay and career opportunities than workers from other ethnic backgrounds, a law firm representing claimants says. The technology giant confirmed it had \"reached a resolution\" but rejected the allegations made against it. The case filed in 2021 by former Google employee, Ana Cantu, said workers from Hispanic, Latino, Native American and other backgrounds started on lower salaries and job levels than their white and Asian counterparts. The settlement has been given preliminary approval by Judge Charles Adams of the Santa Clara County Superior Court in California. The case brought by Ms Cantu against Google relied on a leaked internal document, which allegedly showed that employees from some ethnic backgrounds reported lower compensation for similar work. The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers. The class action lawsuit was filed for at least 6,632 people who were employed by Google between 15 February 2018 and 31 December 2024, according to Reuters news agency. Cathy Coble, one of the lawyers representing them, praised the \"bravery of both the diverse and ally Googlers who self-reported their pay and leaked that data to the media\". \"Suspected pay inequity is too easily concealed without this kind of collective action from employees,\" Ms Coble added. The technology giant denied that it had discriminated against any of its employees. \"We reached a resolution, but continue to disagree with the allegations that we treated anyone differently, and remain committed to paying, hiring, and levelling all employees fairly,\" a Google spokesperson told the BBC. Earlier this year, Google joined a growing list of US firms that are abandoning commitments to principles of diversity, equity, and inclusion (DEI) in their recruitment policies. Meta, Amazon, Pepsi, McDonald's, Walmart and others have also rolled back their DEI programmes. It comes as US President Donald Trump and his allies have regularly attacked DEI policies. Since his return to the White House, Trump has ordered government agencies and their contractors to eliminate such initiatives.",
        "tags": [
            "alphabet"
        ],
        "timestamp": "2025-03-19 04:50:20",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c9vy0m8ggz3o",
        "source": "bbc",
        "headline": "Apple encrypted data row hearing begins in secret",
        "content": "Apple's encrypted data case against the UK government has begun in secret at the Royal Courts of Justice. The Home Office has demanded the right to access data from Apple users that have turned on Advanced Data Protection (ADP), a tool that prevents anyone other than the user - including the tech giant - from reading their files. Apple says it is important for privacy - but the UK government says it needs to be able to access data if there is a national security risk. The BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public. But Friday's session of the Investigatory Powers Tribunal - which is hearing the matter - was held behind closed doors. It is not clear whether later phases of the case will be opened to the public - the BBC has submitted a written argument that it should be. As well as the BBC, journalists from the Guardian, the Telegraph, PA, Bloomberg, and Computer Weekly attended the Royal Courts of Justice but were not admitted into the court room. Sir James Eadie KC, who previously represented the government in significant cases such as Shamima Begum's citizenship appeal, was seen entering the hearing. On Thursday,five US politicians from across the political divide urged the courtto remove what they call the \"cloak of secrecy\" surrounding the row - which they say has major security implications. A group of civil liberties groups made a similar plea, saying barring the media would be an \"affront to the global privacy and security issues that are being discussed.\" The case is about balancing national security against privacy rights. ADP is end to end encrypted, meaning no-one can access files that have been secured with it apart from their owner. Other end to end encrypted services in the UK include Signal, Meta's WhatsApp, and Apple's iMessage. In February, it emerged the UK government was seeking the right to be able to access data protected in this way using powers granted to it under the Investigatory Powers Act. The Act allows it to compel firms to provide information to law enforcement agencies. Apple responded by pulling ADP in the UK and then launching legal action to challenge the government's demand. Apple says agreeing to what the UK is asking for it would require the creation of a so-called backdoor, a capability critics say would eventually be exploited by hackers. \"As we have said many times before, we have never built a backdoor or master key to any of our products or services and we never will,\"Apple says on its website. The Home Office has previously told the BBC: \"The UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy. \"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"",
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-14 17:20:31",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/ckgzm1lgv22o",
        "source": "bbc",
        "headline": "Google Chromecast users' fury at second day of TV streaming issue",
        "content": "Google says it is working to fix an issue which has left many Chromecast users unable to watch content on their televisions for a second day. The tech giant says it has sold more than 100m of these devices worldwide across various generations, with the issues specifically impacting the \"second generation\" model. Owners of these Chromecasts have been unable to connect them to their televisions - meaning they cannot use streaming services like Netflix and YouTube on the big screen - with Chromecast Audio devices also facing issues. And the company has warned users not to try to fix the problem themselves by performing a factory reset to affected devicesin a post on the Google Nest support forum. \"Do not factory reset your device - we will keep you all updated when the fix rolls out,\" it says. \"If you have already factory reset your device, we will provide instructions to set your device back up as soon as possible.\" But several social media users suggested Google's advice had come too late for some who had already reset their affected Chromecasts. \"Factory reset is literally the first thing I did when my Chromecast stopped working,\" wrote a user replying to Google on X. \"Google asking everyone to please not factory reset their Chromecast after hours when it's one of the most used fixes, is hilarious,\"said another. Google's Chromecast devices plug into TVs and allow users to stream content like web video and music wirelessly using a mobile device or laptop. It also provides the ability to display anything from inside a tab on its Chrome web browser. Customers first began to report issues affecting some Chromecasts and their ability to \"cast\" streaming content from devices to TVs on Sunday evening. Users trying to stream content were met with alerts which said the device could not be authenticated, its connection had failed, or the Chromecast itself was \"untrusted\". Googlesaid in August 2024it would be discontinuing Chromecast, replacing its 11-year-old device with a new Google TV system, but it promised to support existing devices with updates. According to a report by The Register,the issue may have been caused by an expired authentication certificate. The BBC has asked Google to confirm if this is indeed the case.",
        "tags": [
            "alphabet",
            "netflix"
        ],
        "timestamp": "2025-03-11 12:16:02",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c0l1kpz3w32o",
        "source": "bbc",
        "headline": "Grandmother gets X-rated message after Apple AI fail",
        "content": "A woman from Dunfermline has spoken of her shock after an Apple voice-to-text service mistakenly inserted a reference to sex - and an apparent insult - into a message left by a garage. Louise Littlejohn, 66, received a voicemail message on Wednesday from a Lookers Land Rover garage in Motherwell inviting her to an event. An artificial intelligence (AI) powered service offered by Apple turned it into a text message which - to her surprise - asked if she been \"able to have sex\" before calling her a \"piece of ****\". Mrs Littlejohn told BBC News: \"Initially I was shocked - astonished - but then I thought that is so funny. The text was obviously quite inappropriate. \"The garage is trying to sell cars, and instead of that they are leaving insulting messages without even being aware of it. It is not their fault at all.\" Apple and the garage both declined to comment. An expert has told the BBC the AI system may have struggled in part because of the caller's Scottish accent, but far more likely factors were the background noise at the garage and the fact he was reading off a script. Mrs Littlejohn said she initially thought the call was a scam, but then recognised that the associated number was from the Motherwell area. She had bought a car from the same garage a few years ago. The BBC has listened to the audio left by the garage worker and confirmed it was a conventional business call. The transcription is so jumbled it's hard to decipher where it went wrong, but the reference to \"sex\" may have in fact been when the caller mentioned the \"sixth\" of March. The BBC has removed the name of the garage employee: \"Hi Mrs Littlejohn, it is ____ here from Lookers Land Rover in Lanarkshire. I hope you are well. Just a wee call to see if you have received your invite to our new car INAUDIBLE event that we do have on between the sixth and tenth of March. \"Just a wee call to see if it is something you were looking to come along to, and to see if we can confirm an appointment slot that would be suitable for yourself. If it is something you would be interested in, feel free to give me a call on ____, ask for myself ____ INAUDIBLE. Thank you.\" On Apple's website, it detailshow their voicemail transcriptionis limited to voicemails in English received on an iPhone with iOS 10 operating system or later, and the transcription \"depends on the quality of the recording\". Peter Bell, a professor of speech technology at the University of Edinburgh, listened to the message left for Mrs Littlejohn. He suggested it was at the \"challenging end for speech-to-text engines to deal with\". He believes there are a number of factors which could have resulted in rogue transcription: \"All of those factors contribute to the system doing badly, \" he added. \"The bigger question is why it outputs that kind of content. \"If you are producing a speech-to-text system that is being used by the public, you would think you would have safeguards for that kind of thing.\" Many people in Scotland will remember a sketch from the BBC comedy show Burnistoun, when two Scottish men get trapped after the voice-activated lift can't understand their accents. It has hundreds of millions of views online, and tapped into a feeling some Scots have about voice technology. In 2016, Scots were asked to work with voice recognition technology in a bid to help mobile phonesdecipher the accent better. For Prof Bell, the Scottish accent may have had an impact here along with all other factors, but - with ideal audio conditions - problems that technology will have with the Scottish accent are \"a thing of the past\". However, this not the first time that Apple's speech tools have recently hit the headlines for the wrong reasons. A few weeks ago, thetech giant said it was working to fixits speech-to-text tool after some social media users found that when they spoke the word \"racist\" into their iPhones it typed it out as \"Trump\". Apple alsosuspended its AI summariesof news headlines after it displayed false notifications on stories.",
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-07 17:15:19",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://www.bbc.com/news/videos/cy7gzk8d2r0o",
        "source": "bbc",
        "headline": "BBC Verify: Why has Google Maps renamed the Gulf of Mexico?",
        "content": "No content found",
        "tags": [
            "alphabet"
        ],
        "timestamp": "2025-02-11 17:27:54",
        "headline_tags": [
            "alphabet"
        ]
    }
]