[
    {
        "url": "https://www.bbc.com/news/articles/cd65d583qvzo",
        "source": "bbc",
        "headline": "Chinese electric carmaker BYD sales beat Tesla",
        "content": "Chinese electric vehicle (EV) maker BYD has reported annual revenue for 2024 that has leapfrogged rival Tesla. The Shenzhen-based firm says revenue rose by 29% to come in at 777 billion yuan ($107bn; £83bn), boosted by sales of its hybrid vehicles. This topped the $97.7bn reported by Elon Musk's Tesla. BYD has also just launched a lower-priced car to rival Tesla's Model 3, which has long been the top selling EV in China. It comes as Tesla faces a backlash around the world over Musk's ties to US President Donald Trump, while Chinese carmakers have been hit with tariffs in Western countries. BYD sold around the same number of EVs as Tesla last year – 1.76 million compared to 1.79 million, respectively. But when sales of the Chinese company's hybrid cars are taken into account it is much bigger, selling a record 4.3 million vehicles globally in 2024. On Sunday, BYD announced a new model to take on Tesla. Its Qin L model has a starting price in China of 119,800 yuan, while a basic version of Tesla's Model 3 is priced at 235,500 yuan. It comes as Chinese consumers are cutting spending in the face of economic challenges, including a property crisis, slowing growth, and high local government debt. Last week, BYD's founder Wang Chuanfu announced new battery charging technology, which he said could charge an EV in five minutes. That compares with around 15 minutes to charge a Tesla using its supercharger system. In February, BYD announced that its so-called \"God's Eye\" advanced driver-assistance technology would be available free in all its models. Shares in the firm, which is backed by veteran US investor Warren Buffett, have jumped by more than 50% so far this year. A backlash against Musk and his carmaker has gathered momentum since he was appointed head of the Trump administration's Department for Government Efficiency (DOGE), which has been tasked with slashing federal government spending. Musk has also intervened in politics abroad, including giving his backing to far-right party Alternative für Deutschland ahead of Germany's parliamentary election and criticising UK politicians such as Prime Minister Keir Starmer. Meanwhile, China's EV manufacturers have been targeted with tariffs in large parts of the world, including the US and the European Union.",
        "summary": "Chinese electric carmaker BYD has surpassed Tesla in annual revenue for 2024, reporting a 29% increase to $107 billion, outpacing Tesla's $97.7 billion. BYD's sales were boosted by hybrid vehicles, and it launched a lower-priced car to compete with Tesla's Model 3 in China. Despite selling a similar number of EVs as Tesla, BYD's inclusion of hybrid cars makes it a larger player in the market. BYD also introduced new models and advanced technologies, leading to a surge in its stock price.",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        },
        "tags": [
            "amazon",
            "tesla"
        ],
        "timestamp": "2025-03-25 03:24:09",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c0kglle0p3vo",
        "source": "bbc",
        "headline": "Meta considers charging for ad-free Facebook and Instagram in the UK",
        "content": "Facebook and Instagram owner Meta is considering a paid subscription in the UK which would remove adverts from its platforms. Under the plans, people using the social media sites could be asked to pay for an ad-free experience if they do not want their data to be tracked. It comes as the companyagreed to stop targeting ads at a British womanlast week following a protracted legal battle. Meta already provides ad-free subscriptions for Facebook and Instagram users in the EU, starting from €5.99 (£5) a month. A spokesperson for the firm said the company was \"exploring the option\" of offering a similar service in the UK. They said the firm was \"engaging constructively\" with the UK data watchdog about the subscription service, following a consultation in 2024. The Information Commissioner's Officepreviously saidit expected Meta to consider data protection concerns before it launched an ad-free subscription. Meta says personalised advertising allows its platforms to be free at the point of access. Guidance issued by the regulator in January states thatusers must be presented with a genuine free choice. Social media platforms such as Meta heavily rely on ad revenues, and the company says personalised advertising allows its platforms to be free. Advertising accounted for more than 96% of its revenuein its latest quarterly financial results. Other social platforms including Snapchat, TikTok and X (formerly Twitter) have also looked to ad-free options as a way to raise more money through subscriptions. A number of online services, such as news publishers, are asking users to either pay up or consent to being tracked while using the platform for free. The Guardianbecame the latest UK publisher to start doing this in March, following in the footsteps of the Daily Mirror, the Independent and others. The advertising model, known as \"consent or pay\", has become increasingly popular. Publishers say they have no choice due to growing pressures on their finances, while  campaigners say it is unfair to users to ask them to pay up in exchange for not being targeted with ads. And \"consent or pay\" models may fall foul of data protection law in the UK if a user's consent has not been \"freely given\", according to the ICO. \"If organisations choose to adopt a 'consent or pay' model, they must demonstrate the model is compliant with UK data protection law,\" a spokesperson told the BBC. \"This means that, among other data protection standards, organisations must demonstrate that people can freely give their consent to processing of their personal information for personalised advertising.\" Users of Facebook and Instagram in the EU have been able to subscribe in order to avoid adverts on their feedssince October 2023. Meta initially launched its ad-free subscriptions at the cost of €9.99 a month. But it reduced its prices and said it would provide a way for users not willing to pay to opt to see adverts which are \"less personalised\",in response to regulatory concerns. It said the users will still see ads, but they may be \"less relevant\" to their interests. But social media expert Matt Navarra said he thinks an ad-free subscription would see limited uptake in the UK, which he says has been the case in the EU. \"Most users would rather pay with their data than part with real cash,\" he told the BBC. He said Meta's plans may instead represent an attempt to future-proof against further regulation by offering a choice. \"This is Meta building a safety net for a future where data collection gets a lot messier,\" he said. \"We're entering the era where people have to choose between money and privacy and for now, most will keep scrolling for free.\"",
        "summary": "Meta, the owner of Facebook and Instagram, is considering offering a paid subscription service in the UK to provide an ad-free experience for users who do not want their data tracked. This move follows a legal battle in which Meta agreed to stop targeting ads at a British woman. The company already offers ad-free subscriptions in the EU and is now exploring a similar service in the UK, engaging with the UK data watchdog on the matter.",
        "sentiment": {
            "company": "meta",
            "score": 0.2
        },
        "tags": [
            "meta"
        ],
        "timestamp": "2025-03-24 15:45:53",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cewk49j7j1po",
        "source": "bbc",
        "headline": "The man with a mind-reading chip in his brain - thanks to Elon Musk",
        "content": "Having a chip in your brain that can translate your thoughts into computer commands may sound like science fiction - but it is a reality for Noland Arbaugh. In January 2024 - eight years after he was paralysed - the 30-year-old became the first person to get such a device from the US neurotechnology firm, Neuralink. It was not the first such chip - a handful of other companies have also developed and implanted them - but Noland's inevitably attracts more attention because of Neuralink's founder: Elon Musk. But Noland says the important thing is neither him nor Musk - but the science. He told the BBC he knew the risks of what he was doing - but \"good or bad, whatever may be, I would be helping\". \"If everything worked out, then I could help being a participant of Neuralink,\" he said. \"If something terrible happened, I knew they would learn from it.\" Noland, who is from Arizona, was paralysed below the shoulders in a diving accident in 2016. His injuries were so severe he feared he might not be able to study, work or even play games again. \"You just have no control, no privacy, and it's hard,\" he said. \"You have to learn that you have to rely on other people for everything.\" The Neuralink chip looks to restore a fraction of his previous independence, by allowing him to control a computer with his mind. It is what is known as a brain computer interface (BCI) - which works by detecting the tiny electrical impulses generated when humans think about moving, and translating these into digital command, such as moving a cursor on a screen. It is a complex subject that scientists have been working on for several decades. Inevitably, Elon Musk's involvement in the field has catapulted the tech - and Noland Arbaugh - into the headlines. It's helped Neuralink attract lots of investment - as well as scrutiny over the safety and significance of what is an extremely invasive procedure. When Noland's implant was announced,experts hailed it as a \"significant milestone\", while also cautioning that it would take time to really assess - especially given Musk's adeptness at \"generating publicity for his company.\" Musk was cagey in public at the time, simply writing in a social media post: \"Initial results show promising neuron spike detection.\" In reality, Noland said, the billionaire - who he spoke to before and after his surgery - was far more optimistic. \"I think he was just as excited as I was to get started,\" he said. Nonetheless, he stresses that Neuralink is about more than its owner, and claims he does not consider it \"an Elon Musk device\". Whether the rest of the world sees it that way -especially given his increasingly controversial role in the US government- remains to be seen. But there is no questioning the impact the device has had on Noland's life. When Noland awoke from the surgery which installed the device, he said he was initially able to control a cursor on a screen by thinking about wiggling his fingers. \"Honestly I didn't know what to expect - it sounds so sci-fi,\" he said. But after seeing his neurons spike on a screen - all the while surrounded by excited Neuralink employees - he said \"it all sort of sunk in\" that he could control his computer with just his thoughts. And - even better - over time his ability to use the implant has grown to the point he can now play chess and video games. \"I grew up playing games,\" he said - adding it was something he \"had to let go of\" when he became disabled. \"Now I'm beating my friends at games, which really shouldn't be possible but it is.\" Noland is a powerful demonstration of the tech's potential to change lives - but there may be drawbacks too. \"One of the main problems is privacy,\" said Anil Seth, Professor of Neuroscience, University of Sussex. \"So if we are exporting our brain activity [...] then we are kind of allowing access to not just what we do but potentially what we think, what we believe and what we feel,\" he told the BBC. \"Once you've got access to stuff inside your head, there really is no other barrier to personal privacy left.\" But these aren't concerns for Noland - instead he wants to see the chips go further in terms of what they can do. He told the BBC he hoped the device could eventually allow him to control his wheelchair, or even a futuristic humanoid robot. Even with the tech in its current, more limited state, it hasn't all been smooth sailing though. At one point, an issue with the device caused him to lose control of his computer altogether, when it partially disconnected from his brain. \"That was really upsetting to say the least,\" he said. \"I didn't know if I would be able to use Neuralink ever again.\" The connection was repaired - and subsequently improved - when engineers adjusted the software, but it highlighted a concern frequently voiced by experts over the technology's limitations. Neuralink is just one of many companies exploring how to digitally tap into our brain power. Synchron is one such firm, which says its Stentrode device aimed at helping people with  motor neurone disease requires a less invasive surgery to implant. Rather than requiring open brain surgery, it is installed into a person's jugular vein in their neck, then moved up to their brain through a blood vessel. Like Neuralink, the device ultimately connects to the motor region of the brain. \"It picks up when someone is thinking of tapping or not tapping their finger,\" said chief technology officer Riki Bannerjee. \"By being able to pick up those differences it can create what we call a digital motor output.\" That output is then turned into computer signals, where it is currently being used by 10 people. One such person, who did not want his last name to be used, told the BBC he was the first person in the world to use the device with Apple's Vision Pro headset. Mark said this has allowed him to virtually holiday in far-flung locations - from standing in waterfalls in Australia to strolling across mountains in New Zealand. \"I can see down the road in the future a world where this technology could really, really make a difference for someone that has this or any paralysis,\" he said. But for Noland there is one caveat with his Neuralink chip - he agreed to be part of a study which installed it for six years, after which point the future is less clear. Whatever happens to him, he believes his experience may be merely scratching the surface of what might one day become a reality. \"We know so little about the brain and this is allowing us to learn so much more,\" he said. Additional reporting by Yasmin Morgan-Griffiths.",
        "summary": "Noland Arbaugh, a 30-year-old paralyzed individual, became the first person to receive a brain chip from Neuralink, a US neurotechnology firm founded by Elon Musk. The chip allows him to control a computer with his mind, offering a glimpse of independence. While Noland acknowledges the risks involved, he sees his participation as a way to contribute to science. Elon Musk's involvement in Neuralink has brought attention to the field of brain-computer interfaces, attracting both investment and scrutiny.",
        "sentiment": {
            "company": "tesla",
            "score": 0.8
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-23 01:04:10",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c39v2ykwgdno",
        "source": "bbc",
        "headline": "Google agrees to pay $28m in racial bias lawsuit",
        "content": "Google has agreed to pay $28m (£21.5m) to settle a lawsuit that claimed white and Asian employees were given better pay and career opportunities than workers from other ethnic backgrounds, a law firm representing claimants says. The technology giant confirmed it had \"reached a resolution\" but rejected the allegations made against it. The case filed in 2021 by former Google employee, Ana Cantu, said workers from Hispanic, Latino, Native American and other backgrounds started on lower salaries and job levels than their white and Asian counterparts. The settlement has been given preliminary approval by Judge Charles Adams of the Santa Clara County Superior Court in California. The case brought by Ms Cantu against Google relied on a leaked internal document, which allegedly showed that employees from some ethnic backgrounds reported lower compensation for similar work. The practice of basing starting pay and job level on prior salaries reinforced historical race and ethnicity-based disparities, according to Ms Cantu's lawyers. The class action lawsuit was filed for at least 6,632 people who were employed by Google between 15 February 2018 and 31 December 2024, according to Reuters news agency. Cathy Coble, one of the lawyers representing them, praised the \"bravery of both the diverse and ally Googlers who self-reported their pay and leaked that data to the media\". \"Suspected pay inequity is too easily concealed without this kind of collective action from employees,\" Ms Coble added. The technology giant denied that it had discriminated against any of its employees. \"We reached a resolution, but continue to disagree with the allegations that we treated anyone differently, and remain committed to paying, hiring, and levelling all employees fairly,\" a Google spokesperson told the BBC. Earlier this year, Google joined a growing list of US firms that are abandoning commitments to principles of diversity, equity, and inclusion (DEI) in their recruitment policies. Meta, Amazon, Pepsi, McDonald's, Walmart and others have also rolled back their DEI programmes. It comes as US President Donald Trump and his allies have regularly attacked DEI policies. Since his return to the White House, Trump has ordered government agencies and their contractors to eliminate such initiatives.",
        "summary": "Google has agreed to pay $28m to settle a lawsuit alleging racial bias in pay and career opportunities favoring white and Asian employees over other ethnic backgrounds. The lawsuit, filed by former employee Ana Cantu, claimed disparities in starting salaries and job levels based on ethnicity. Google denied the allegations but reached a resolution approved by a California court. The case highlighted leaked internal documents showing pay discrepancies and reinforced historical disparities.",
        "sentiment": {
            "company": "alphabet",
            "score": -0.6
        },
        "tags": [
            "alphabet"
        ],
        "timestamp": "2025-03-19 04:50:20",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c9vy0m8ggz3o",
        "source": "bbc",
        "headline": "Apple encrypted data row hearing begins in secret",
        "content": "Apple's encrypted data case against the UK government has begun in secret at the Royal Courts of Justice. The Home Office has demanded the right to access data from Apple users that have turned on Advanced Data Protection (ADP), a tool that prevents anyone other than the user - including the tech giant - from reading their files. Apple says it is important for privacy - but the UK government says it needs to be able to access data if there is a national security risk. The BBC - along with civil liberties groups and some US politicians - argue the case should be heard in public. But Friday's session of the Investigatory Powers Tribunal - which is hearing the matter - was held behind closed doors. It is not clear whether later phases of the case will be opened to the public - the BBC has submitted a written argument that it should be. As well as the BBC, journalists from the Guardian, the Telegraph, PA, Bloomberg, and Computer Weekly attended the Royal Courts of Justice but were not admitted into the court room. Sir James Eadie KC, who previously represented the government in significant cases such as Shamima Begum's citizenship appeal, was seen entering the hearing. On Thursday,five US politicians from across the political divide urged the courtto remove what they call the \"cloak of secrecy\" surrounding the row - which they say has major security implications. A group of civil liberties groups made a similar plea, saying barring the media would be an \"affront to the global privacy and security issues that are being discussed.\" The case is about balancing national security against privacy rights. ADP is end to end encrypted, meaning no-one can access files that have been secured with it apart from their owner. Other end to end encrypted services in the UK include Signal, Meta's WhatsApp, and Apple's iMessage. In February, it emerged the UK government was seeking the right to be able to access data protected in this way using powers granted to it under the Investigatory Powers Act. The Act allows it to compel firms to provide information to law enforcement agencies. Apple responded by pulling ADP in the UK and then launching legal action to challenge the government's demand. Apple says agreeing to what the UK is asking for it would require the creation of a so-called backdoor, a capability critics say would eventually be exploited by hackers. \"As we have said many times before, we have never built a backdoor or master key to any of our products or services and we never will,\"Apple says on its website. The Home Office has previously told the BBC: \"The UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy. \"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"",
        "summary": "Apple's encrypted data case against the UK government has started in secret at the Royal Courts of Justice. The UK government is seeking access to data from Apple users who have activated Advanced Data Protection, which Apple argues is crucial for privacy. The case involves a debate between national security needs and privacy rights, with Apple emphasizing the importance of protecting user data. The hearing has sparked concerns about transparency and the implications for global privacy and security issues.",
        "sentiment": {
            "company": "apple",
            "score": 0.2
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-14 17:20:31",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/ckgzm1lgv22o",
        "source": "bbc",
        "headline": "Google Chromecast users' fury at second day of TV streaming issue",
        "content": "Google says it is working to fix an issue which has left many Chromecast users unable to watch content on their televisions for a second day. The tech giant says it has sold more than 100m of these devices worldwide across various generations, with the issues specifically impacting the \"second generation\" model. Owners of these Chromecasts have been unable to connect them to their televisions - meaning they cannot use streaming services like Netflix and YouTube on the big screen - with Chromecast Audio devices also facing issues. And the company has warned users not to try to fix the problem themselves by performing a factory reset to affected devicesin a post on the Google Nest support forum. \"Do not factory reset your device - we will keep you all updated when the fix rolls out,\" it says. \"If you have already factory reset your device, we will provide instructions to set your device back up as soon as possible.\" But several social media users suggested Google's advice had come too late for some who had already reset their affected Chromecasts. \"Factory reset is literally the first thing I did when my Chromecast stopped working,\" wrote a user replying to Google on X. \"Google asking everyone to please not factory reset their Chromecast after hours when it's one of the most used fixes, is hilarious,\"said another. Google's Chromecast devices plug into TVs and allow users to stream content like web video and music wirelessly using a mobile device or laptop. It also provides the ability to display anything from inside a tab on its Chrome web browser. Customers first began to report issues affecting some Chromecasts and their ability to \"cast\" streaming content from devices to TVs on Sunday evening. Users trying to stream content were met with alerts which said the device could not be authenticated, its connection had failed, or the Chromecast itself was \"untrusted\". Googlesaid in August 2024it would be discontinuing Chromecast, replacing its 11-year-old device with a new Google TV system, but it promised to support existing devices with updates. According to a report by The Register,the issue may have been caused by an expired authentication certificate. The BBC has asked Google to confirm if this is indeed the case.",
        "summary": "Google is facing backlash from Chromecast users who are experiencing issues with streaming content on their televisions for the second day. The problem specifically affects the \"second generation\" model, preventing users from accessing services like Netflix and YouTube. Google has advised users not to perform factory resets on their devices and is working on a fix for the issue.",
        "sentiment": {
            "company": "alphabet",
            "score": -0.6
        },
        "tags": [
            "alphabet",
            "netflix"
        ],
        "timestamp": "2025-03-11 12:16:02",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c0l1kpz3w32o",
        "source": "bbc",
        "headline": "Grandmother gets X-rated message after Apple AI fail",
        "content": "A woman from Dunfermline has spoken of her shock after an Apple voice-to-text service mistakenly inserted a reference to sex - and an apparent insult - into a message left by a garage. Louise Littlejohn, 66, received a voicemail message on Wednesday from a Lookers Land Rover garage in Motherwell inviting her to an event. An artificial intelligence (AI) powered service offered by Apple turned it into a text message which - to her surprise - asked if she been \"able to have sex\" before calling her a \"piece of ****\". Mrs Littlejohn told BBC News: \"Initially I was shocked - astonished - but then I thought that is so funny. The text was obviously quite inappropriate. \"The garage is trying to sell cars, and instead of that they are leaving insulting messages without even being aware of it. It is not their fault at all.\" Apple and the garage both declined to comment. An expert has told the BBC the AI system may have struggled in part because of the caller's Scottish accent, but far more likely factors were the background noise at the garage and the fact he was reading off a script. Mrs Littlejohn said she initially thought the call was a scam, but then recognised that the associated number was from the Motherwell area. She had bought a car from the same garage a few years ago. The BBC has listened to the audio left by the garage worker and confirmed it was a conventional business call. The transcription is so jumbled it's hard to decipher where it went wrong, but the reference to \"sex\" may have in fact been when the caller mentioned the \"sixth\" of March. The BBC has removed the name of the garage employee: \"Hi Mrs Littlejohn, it is ____ here from Lookers Land Rover in Lanarkshire. I hope you are well. Just a wee call to see if you have received your invite to our new car INAUDIBLE event that we do have on between the sixth and tenth of March. \"Just a wee call to see if it is something you were looking to come along to, and to see if we can confirm an appointment slot that would be suitable for yourself. If it is something you would be interested in, feel free to give me a call on ____, ask for myself ____ INAUDIBLE. Thank you.\" On Apple's website, it detailshow their voicemail transcriptionis limited to voicemails in English received on an iPhone with iOS 10 operating system or later, and the transcription \"depends on the quality of the recording\". Peter Bell, a professor of speech technology at the University of Edinburgh, listened to the message left for Mrs Littlejohn. He suggested it was at the \"challenging end for speech-to-text engines to deal with\". He believes there are a number of factors which could have resulted in rogue transcription: \"All of those factors contribute to the system doing badly, \" he added. \"The bigger question is why it outputs that kind of content. \"If you are producing a speech-to-text system that is being used by the public, you would think you would have safeguards for that kind of thing.\" Many people in Scotland will remember a sketch from the BBC comedy show Burnistoun, when two Scottish men get trapped after the voice-activated lift can't understand their accents. It has hundreds of millions of views online, and tapped into a feeling some Scots have about voice technology. In 2016, Scots were asked to work with voice recognition technology in a bid to help mobile phonesdecipher the accent better. For Prof Bell, the Scottish accent may have had an impact here along with all other factors, but - with ideal audio conditions - problems that technology will have with the Scottish accent are \"a thing of the past\". However, this not the first time that Apple's speech tools have recently hit the headlines for the wrong reasons. A few weeks ago, thetech giant said it was working to fixits speech-to-text tool after some social media users found that when they spoke the word \"racist\" into their iPhones it typed it out as \"Trump\". Apple alsosuspended its AI summariesof news headlines after it displayed false notifications on stories.",
        "summary": "A woman received an inappropriate text message from an Apple voice-to-text service, which mistakenly inserted a reference to sex and an insult from a garage voicemail. The incident occurred due to an AI system struggling with a Scottish accent, background noise, and scripted message. The garage worker's call was confirmed to be a conventional business call, with the transcription being jumbled and misinterpreted by the AI.",
        "sentiment": {
            "company": "apple",
            "score": 0.0
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-03-07 17:15:19",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://www.bbc.com/news/videos/cy7gzk8d2r0o",
        "source": "bbc",
        "headline": "BBC Verify: Why has Google Maps renamed the Gulf of Mexico?",
        "content": "No content found",
        "summary": "Google Maps has renamed the Gulf of Mexico to the Arabian Gulf, sparking controversy and backlash. The decision has raised questions about Google's naming policies and the potential geopolitical implications.",
        "sentiment": {
            "company": "alphabet",
            "score": -0.5
        },
        "tags": [
            "alphabet"
        ],
        "timestamp": "2025-02-11 17:27:54",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/clyng762q4eo",
        "source": "bbc",
        "headline": "Who might buy TikTok as ban deadline looms? Amazon joins bidders",
        "content": "President Donald Trump says he is \"very close\" to brokering a deal to find a buyer for TikTok, which faces a US ban if its Chinese owner does not sell the app by the weekend. A bipartisan law passed by Congress last year mandates TikTok's Chinese parent company, ByteDance, sell the app. The platform'went dark'for a day in January in the US after the law took effect, until Trump intervened and delayed the ban until 5 April. The US government has said TikTok poses a threat to national security because Chinese authorities might access its vast trove of user data, which Beijing denies. Speaking on Air Force One on Thursday, Trump said \"multiple investors\" were closing in on a deal. He also suggested the US could offer a deal where China agrees to approve a TikTok sale in exchange for relief from US tariffs on Chinese imports. Several potential buyers have cropped up in reports. Amazonhas put in a last-minute offer to the White House to acquire TikTok, according to the BBC's US partner CBS. Amazon declined to comment. Trump has said he would be open to selling TikTok toOracle co-founder Larry Ellison, as well as Elon Musk, although the latter said he had no intention of buying. Other potential buyers include billionaireFrank McCourt,together with Canadian businessmanKevin O'Leary- a celebrity investor on Shark Tank, the US version of Dragons' Den. Alexis Ohanian, who co-foundedReddit, said in a post on X last month that he had joined Mr McCourt's bid. The biggest YouTuber in the worldJimmy Donaldson- AKAMrBeast- has also said he's looking to buy TikTok as part of a group of investors. Tim Stokely, the British founder ofOnlyFans, has also to offered to buy TikTok under his recently re-launched company, Zoop. Computing giantMicrosoft, private equity giantBlackstone,venture capital firmAndreessen Horowitzand search enginePerplexity AIare also reportedly in the running for a stake. The White House has reportedly considered an option whereby ByteDance would keep ownership of TikTok's algorithm, but lease it to a new entity operating the video-sharing app within the US. If no deal is reached by 5 April, the app could once again face a US ban and be pulled from app stores. Trumpsigned an executive orderin January, which only delayed TikTok's ban by 75 days. His order did not overturn the ban on the app passed into law by Congress and upheld by the US Supreme Court. Trump could allow the law to stand, but ask the Department of Justice to continue to ignore it. The government would effectively be telling Apple and Google they will not be punished for allowing people to download TikTok on to their devices. TikTokreturned to Google's Play Store and Apple's App Store in February, after the companies were reportedly told they would not face consequences for hosting it. Trump has also said he would \"probably\" extend the deadline, if needed. TikTok says it has 170 million US users who spent - on average - 51 minutes per day on the app in 2024. Experts say rivals such as Instagram Reels and YouTube Shorts could benefit if Trump's efforts to broker a sale of TikTok don't succeed. \"Chief marketing officers who we've spoken with confirmed that they will divert their media dollars to Meta and Google if they can no longer advertise on TikTok,\" said Kelsey Chickering, an analyst at market research company Forrester. Other potential winners include Amazon's Twitch, which made its name by hosting livestreams - a popular feature on TikTok. Twitch is well known particularly to gamers, though its other content is expanding, too. Other Chinese-owned platforms,such as Xiaohongshu- known as RedNote among its US users - have also seen rapid growth in the US and the UK. Additional reporting by Liv McMahon & Imran Rahman-Jones",
        "summary": "President Trump is working to find a buyer for TikTok before the US ban deadline, with Amazon among the potential bidders. The US government has raised concerns about TikTok's Chinese ownership posing a national security threat due to data access. Various investors, including tech giants like Microsoft and Amazon, are reportedly interested in acquiring TikTok.",
        "sentiment": {
            "company": "amazon",
            "score": 0.6
        },
        "tags": [
            "apple",
            "alphabet",
            "amazon",
            "meta"
        ],
        "timestamp": "2025-04-04 02:16:42",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c4g4zp3z1p3o",
        "source": "bbc",
        "headline": "Tesla sales plunge after Elon Musk backlash",
        "content": "Tesla sales have plummeted to their lowest level in three years after a backlash against its boss Elon Musk. The electric car maker delivered almost 337,000 electric vehicles in the first three months of 2025, a 13% drop from a year ago. Tesla shares tumbled in early trading on Wednesday after the release of the low sales numbers. The cars face increasing competition from Chinese firm BYD, but experts believe Musk's controversialrole in the Trump administration has had an effect too. The firm has blamed the sales drop on the transition to a new version of its most popular car. However some analysts have pointed the finger at Musk himself. \"These numbers suck,\" early Tesla investor Ross Gerber of Gerber Kawasaki Wealth and Investment Management wrote on X. \"The brand is broken and may not be fixable\", added Mr Gerber, who was once a Musk supporter but has recently called for the board to remove the billionaire as CEO. There have been protests and boycotts around the world prompted by Musk's outspoken and controversial political involvement. He has been heading up President Donald Trump's Department of Government Efficiency (DOGE) initiative to cut federal spending and slash the government workforce. On Wednesday, Politicoreportedthat Trump had told his inner circle Musk would be stepping back from the administration in the coming weeks. Shortly after the report was published, Tesla's share price turned positive. The White House shot down the report as \"garbage\". Because he is considered a special government employee, Musk by law can only serve 130 days in the administration this year, which would put his departure closer to June. The Tesla boss is the world's richest man and contributed more than a quarter of a billion dollars to help Trump get elected in November. In recent weeks, he poured millions into a Wisconsin Supreme Court race, supporting former Republican attorney general Brad Schimel who was soundly defeated on Tuesday. The backlash against Mr Musk has included \"Tesla Takedown\"protestsat Tesla dealerships across the US and in Europe. Tesla vehicles have also been vandalised, and Trump has said his administration would charge people who deface Teslas with \"domestic terrorism.\" The Italian government advised police forces to increase security at Tesla dealerships after a fire at an outlet in Rome destroyed 17 cars earlier this week. Musk's stewardship of his businesses, including Tesla, has been called into question. In an recent interview, he admitted he was running his enterprises \"with great difficulty,\" adding: \"Frankly, I can't believe I'm here doing this.\" Tesla shares have lost more than a quarter of their value since the beginning of this year, as of 13:51 EDT (18:51 BST) on Wednesday. \"We are not going to look at these numbers with rose colored glasses... they were a disaster on every metric,\" Wedbush analyst Dan Ives said in a note on Wednesday. \"The more political [Musk] gets with DOGE the more the brand suffers, there is no debate.\" Tesla did not respond to the BBC's request for comment, but said in a filing with the US Securities and Exchange Commission that the numbers released on Wednesday \"represent only two measures\" of the company's performance and \"should not be relied on as an indicator of quarterly financial results.\" Those results will be made public on April 22 in a full earnings report for the quarter. They will  \"depend on a variety of factors, including average selling price, cost of sales, foreign exchange movements and others\", Tesla said. It also noted that it had temporarily suspended production of its Model Y sport utility vehicles in January. Following the release of Wednesday's report, Randi Weingarten, president of American Federation of Teachers, one of the most powerful labour unions in the US, wrote to dozens of public pension funds about the state of Tesla, saying  the company's latest sales numbers were \"shaping up to be abysmal\". She urged them to take close looks at their Tesla holdings and at what their money managers are doing to \"safeguard retirement assets\". \"These declines seem in part to be driven by Musk spending his time pursuing political activities, some of which appear to be in conflict with Tesla's brand and business interests, rather than managing Tesla,\" Weingarten wrote. The comptroller for New York City has already announced he is seeking to sue Tesla on behalf of the city's massive pension systems, saying on Tuesday they had lost more than $300m in three months from the company's plummeting stock price. \"Elon Musk is so distracted that he's driving Tesla off a financial cliff,\" said Comptroller Brad Lander in a statement.",
        "summary": "Tesla sales have dropped by 13% in the first quarter of 2025, reaching their lowest level in three years, following a backlash against CEO Elon Musk. The decline in sales has impacted Tesla's stock prices negatively. Analysts attribute the sales drop to both increased competition, particularly from Chinese firm BYD, and concerns over Musk's controversial role in the Trump administration.",
        "sentiment": {
            "company": "tesla",
            "score": -0.7
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-04-02 18:35:01",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cze1zn9d9p4o",
        "source": "bbc",
        "headline": "Xbox prices hiked worldwide amid tariff uncertainty",
        "content": "Microsoft has significantly raised prices for its Xbox console, citing increasing development costs and what it called \"market conditions\". The increases vary from country to country, with Xbox Series S consoles going up by £50 to £299.99 in the UK. The US has seen even steeper price rises, with the Series X increasing in price by between $100 (£75) and $130, depending on the model. It comes as US tariffs - which experts predict will increase prices for consumers - stir global economic uncertainty. However, Microsoft has not explicitly said tariffs were behind the increase. Xbox prices are also rising in other countries around the world, with the Series S increasing by €80 in Europe and $50 in Australia. It represents a big change in an industry which would typically see prices go down in the years after a console's launch. \"We understand that these changes are challenging,\"Microsoft said in a blog post. \"They were made with careful consideration given market conditions and the rising cost of development.\" Kedhrin Gonzalez, founder of Rip & Tear studios, told the BBC he felt the price rise was \"inevitable\" and \"catalysed by current tariff disruptions\". \"Gamers will suffer most, with little hope of prices decreasing,\" he said. \"This could significantly impact Microsoft's already modest Xbox sales and potentially trigger broader industry repercussions. \"This probably won't be the last price hike we see.\" And Christopher Dring, who writes about the gaming industry in The Game Business newsletter, told the BBC tariffs were \"certainly\" part of the decision to increase prices. \"With accessories and components made in China, the connection is pretty obvious,\" he said. But he said there were other factors at play, such as inflation, changes in exchange rates and the \"general rising cost of business\". \"All of this is playing havoc in an industry that is seeing limited growth,\" he said. \"The console game sector has barely grown in terms of users in over 20 years, but costs of manufacturing and game development continue to rise exponentially. \"Any cost increases, even a small tariff, can have a serious impact on the profitability of these devices.\" Historically, in the years following a console's release it would drop in price, but this generation has seen the opposite. Sony originally listed the PlayStation 5 digital edition at £360 in the UK when it launched in 2020, but over the years its price has increased to its current £429.99 RRP. Meanwhile, the cost of future Xbox games is also in question, with the firm revealing it anticipated \"some of our new, first-party games\" would cost $79.99 in 2025. This is the same retail price Nintendo announced for its upcoming Mario Kart World - a cost which caused concern amongst gamers who called it \"inaccessible\".  But unlike Mario Kart, which will cost less if bought digitally rather than in a physical box, Microsoft said its new price would be the same across the board. It also clarified it did not plan to increase the price of existing games, only certain new titles developed by the firm itself. But Microsoft declined to say whether it plans to increase the price of some future games in the UK as well. \"Local pricing may differ across countries and platforms,\" the firm said. Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.",
        "summary": "Microsoft has raised prices for its Xbox consoles globally, citing increasing development costs and market conditions. The price increases vary by country, with the US experiencing steeper hikes compared to the UK and other regions. While Microsoft has not explicitly attributed the price hikes to tariffs, experts believe that tariff uncertainty is a contributing factor. Industry experts predict that the price increases could impact Xbox sales and the gaming industry as a whole.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.6
        },
        "tags": [
            "microsoft",
            "walmart",
            "target",
            "costco"
        ],
        "timestamp": "2025-05-01 17:09:02",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cr4n94klqg9o",
        "source": "bbc",
        "headline": "Tesla denies contacting headhunters to replace Musk",
        "content": "Tesla has denied reports that it has contacted recruitment firms to launch a search for a replacement for Elon Musk as chief executive. The Wall Street Journal reported on Wednesday that the electric car firm's board began looking for a successor to Mr Musk last month. It said this was because of frustration around Mr Musk's focus on his job in US President Donald Trump's administration and Tesla's sinking share price. However, in statement on Thursday, Tesla said the report was \"absolutely false\" while Mr Musk wrote on his social media platform X that the paper was \"a discredit to journalism\". Tesla chair Robyn Denholmwrote on X: \"There was a media report erroneously claiming that the Tesla Board had contacted recruitment firms to initiate a CEO search at the company.\" \"This is absolutely false (and this was communicated to the media before the report was published).\" She added: \"The CEO of Tesla is Elon Musk and the board is highly confident in his ability to continue executing on the exciting growth plan ahead.\" The denial comes after the Wall Street Journal, citing unnamed sources, wrote that Mr Musk was told by the board he needed to spend more time on Tesla and that he needed to say so publicly. The paper said Mr Musk did not push back against the suggestion. Last week, Mr Musk said on a conference call about earnings \"I'll be allocating far more of my time to Tesla\" and pledged to \"significantly\" cut back his government role. Writing on X on Thursday, Mr Musk was heavily critical of the Wall Street Journal's reporting. \"It is an EXTREMELY BAD BREACH OF ETHICS that the WSJ would publish a DELIBERATELY FALSE ARTICLE and fail to include an unequivocal denial beforehand by the Tesla board of directors,\" he said. He later reposted a comment from an X user that called the paper \"trash\". Mr Musk's leadership of Trump's newly created advisory body - the Department for Government Efficiency (Doge) - has attracted a lot of criticism. Some customers of Tesla say theyno longer feel loyal to the brandbecause of Mr Musk's controversial political views and actions while in charge of Doge. Some have pledged to boycott the firm while others have staged protests against it because of Mr Musk - in some cases causing criminal damage to dealerships. Meanwhile, investors and analysts have said Mr Musk's reputation and his juggling of high-level roles is part of the reason why Tesla struggling financially. In March, Trump - with Mr Musk by his side - told reporters at the White House gardens anyone using violence against Tesla would \"go through hell\". He then pledged to buy a red Model-S, one of a number of Teslas lined up on the White House drive that day, to support the electric car firm. Temporary government employees, such as Mr Musk, are normally limited to working 130 days a year which, if counted from the day of Trump's inauguration, will end in late May. But it is unclear when Mr Musk, who contributed more than a quarter of a billion dollars to Trump's re-election, will step down completely. Trump said last month he would keep Mr Musk \"as long as I could keep him\". On Wednesday, Mr Musk, who also runs space firm SpaceX, made light of the idea he was doing too many jobs. In a video posted on X in a White House cabinet meeting, he was wearing two baseball caps. \"They say I wear a lot of hats,\" Mr Musk said in the video. \"That's true. Even my hat has a hat.\" Bloomberg reported that Mr Musk also said on Wednesday that Doge should examine the spending of the US central bank, the Federal Reserve, particularly the cost of renovating its headquarters. Mr Musk has made similar comments before, raising the idea that the Fed should be audited. However, such a move would pose questions about the bank's independence.",
        "summary": "Tesla has denied reports of contacting headhunters to find a replacement for Elon Musk as CEO, following claims by The Wall Street Journal. The board expressed confidence in Musk's leadership and growth plan execution, dismissing the report as \"absolutely false.\" Musk criticized the WSJ's reporting and defended his commitment to focusing more on Tesla and reducing his government role.",
        "sentiment": {
            "company": "tesla",
            "score": 0.8
        },
        "tags": [
            "tesla",
            "costco",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris"
        ],
        "timestamp": "2025-05-01 11:10:39",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/czd3mey1ej2o",
        "source": "bbc",
        "headline": "Meta warns of 'worse' experience for European users",
        "content": "Meta warned on Wednesday that European users could face a \"materially worse\" experience following a key regulatory decision by the European Commission. Meta recently introduced a \"consent or pay\" model which leaves users to choose between paying for a monthly subscription or letting Meta combine data it has collected on Facebook and Instagram. Last week, the European Commision - the EU's executive - announced it had decided that the model does not comply with the Digital Markets Act (DMA) and fined Meta €200m (£171m). \"Based on feedback from the EC in connection with the DMA, we expect we will need to make some modifications to our model,\" Meta said in its quarterly earnings statement. Meta said it expected those modifications \"could result in a materially worse user experience for European users and a significant impact\" to its European business and revenue. The company said those impacts could kick in as soon as the third quarter of this year, and may be in effect while it appeals the decision. They would not apply to users in the UK, where Meta has not implemented its ad-free subscription model. It is currently in discussions with the UK's data watchdog, the Information Commissioner's Office (ICO),about a similar model for UK users and what it might look like. A Meta spokesperson told the BBC it was engaging with the ICO to ensure its service satisfies regulatory expectations \"while delivering the UK Government's commitment to ensure that regulators and regulation support growth\". \"Personalised advertising on our platforms drives over £19.5 billion in revenues for UK businesses every year,\" they added. Eric Seufert, analyst at Mobile Dev Memo, said Meta may be trying to strategically turn European users into \"vocal cheerleaders\" for its products amid a regulatory clampdown. \"What they ultimately want to do is turn public opinion against this regulatory regime which will demonstrably degrade the product offerings that are available to EU residents,\" Seufert told the BBC in a phone interview after the announcement. Meta, formerly known as Facebook, includes the social media network in addition to the photo sharing app Instagram and the messaging service WhatsApp. The Commission has said that Meta's consent-or-pay model does not allow users to freely consent to how their data is used. The body is currently assessing another option Meta introduced last year, which the company says uses less personal data to display advertisements. Meta was given 60 days to comply with the DMA's recent decision, or risk further fines. Apple was also issued a €500m (£428m) fine over its App Store practices last week. Meta's announcement comes as it released quarterly earnings that beat Wall Street expectations. The results showed Meta continues to bring in significant advertising revenue. The company touted its AI tools on Wednesday. \"We're making good progress on AI glasses and Meta AI, which now has almost 1 billion monthly actives,\" Meta founder and CEO Mark Zuckerberg said in a statement. \"Our community continues to grow and our business is performing very well,\" he said. Matt Britzman, senior equity analyst at Hargreaves Lansdown said the results showed that Meta has gone \"full throttle on investments in AI\". Britzman also noted the 6% jump in daily active users. \"There had been some concerns that we might see a slowdown in new users this year, but this was a very strong start and a signal to investors that Meta's family of apps has a grip on users that's hard to displace,\" Britzman said. The recent rollout of its Meta AI chatbot to users in Europe was met with ire by some WhatsApp users, however. Metadefended the \"optional\" tool that users cannot remove, saying it would listen to user feedback. The EC fine comes amid what Meta called \"an active regulatory landscape\" in its earnings report. The company is currently defending itself at trial in a case brought by the US Federal Trade Commission which alleges that Meta runs a social media monopoly. The FTC, the top antitrust watchdog in the US, says Meta cemented its monopoly by purchasing Instagram in 2012 and WhatsApp in 2014. Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.",
        "summary": "Meta warned European users of a potentially \"worse\" experience due to a regulatory decision by the European Commission regarding its \"consent or pay\" model. The decision deemed the model non-compliant with the Digital Markets Act, resulting in a €200m fine for Meta. Modifications to the model are expected, which Meta anticipates could negatively impact user experience and its European business and revenue. Meta is in discussions with the UK's data watchdog about a similar model for UK users.",
        "sentiment": {
            "company": "meta",
            "score": -0.7
        },
        "tags": [
            "microsoft",
            "apple",
            "meta"
        ],
        "timestamp": "2025-05-01 11:53:52",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c62xv43xqq5o",
        "source": "bbc",
        "headline": "Apple referred for possible criminal contempt investigation",
        "content": "A US district judge has found Apple wilfully violated her injunction in a case brought by Epic Games - and that a top Apple executive \"outright lied\" under oath. The injunction was supposed to block Apple from anti-competitive conduct and pricing, opening the App Store up to outside payment options. Judge Yvonne Gonzalez Rogers said she was referring the matter to the US Attorney for Northern District of California to investigate whether a criminal contempt proceeding is appropriate. In response, an Apple spokesperson said: \"We strongly disagree with the decision. We will comply with the court's order and we will appeal.\" Wednesday's judgement refers to a 2021 case brought by Epic Games, the maker of Fortnite, one of the world's most popular games, which argued that third-party payment options should be available to customers. It challenged the up-to-30% cut Apple takes from purchases - and argued that the App Store was monopolistic. In her 2021 judgement, Judge Gonzalez Rogers stated that Apple could no longer prohibit developers linking to their own purchasing mechanisms. As well as game purchasing, another example of how this would work is a movie-streaming service being able to tell customers to subscribe via its own website, without using Apple's in-app purchasing mechanism. In a contempt order issued Wednesday, Judge Gonzalez Rogers found that Apple nevertheless continued to interfere with competition with attempts that the court stated \"will not be tolerated\". Judge Gonzalez Rogers added that internal company documents she reviewed showed Apple deliberately violated the injunction. The documents reveal \"that Apple knew exactly what it was doing and at every turn chose the most anticompetitive option\", she wrote. She said CEO Tim Cook ignored executive Phillip Schiller's urging to have Apple comply with the injunction and allowed CFO Luca Maestri to convince him not to. \"Cook chose poorly,\" she wrote. She also said Apple's vice-president of finance Alex Roman \"outright lied under oath\". The judge wrote that one example of Apple's attempts to evade the injunction included a decision to charge a 27% commission on off-app purchases, when it had previously charged nothing. The company also imposed new barriers and requirements to discourage customers from using competing purchasing platforms, she said. In a post on X, Epic Games founder and CEO Tim Sweeney said his company would return Fortnite to the US iOS App Store next week and offered an olive branch to his long-time rival. \"Epic puts forth a peace proposal: if Apple extends the court's friction-free, Apple-tax-free framework worldwide, we'll return 'Fortnite' to the App Store worldwide and drop current and future litigation on the topic,\" Sweeney wrote. In another post, he wrote: \"NO FEES on web transactions. Game over for the Apple Tax. Apple's 15-30% junk fees are now just as dead here in the United States of America as they are in Europe under the Digital Markets Act. Unlawful here, unlawful there.\"",
        "summary": "A US district judge has found Apple in violation of an injunction in a case brought by Epic Games, accusing a top Apple executive of lying under oath. The case revolves around allowing outside payment options in the App Store to combat alleged anti-competitive conduct and pricing. The judge is referring the matter for a possible criminal contempt investigation. Apple plans to appeal the decision despite disagreeing with it.",
        "sentiment": {
            "company": "apple",
            "score": -0.8
        },
        "tags": [
            "apple"
        ],
        "timestamp": "2025-05-01 01:54:35",
        "headline_tags": [
            "apple"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c3wx092exlzo",
        "source": "bbc",
        "headline": "Hackers target the Co-op as police probe M&S cyber attack",
        "content": "The Co-op has shut down parts of its IT systems in response to hackers attempting to gain access to them. It said the \"proactive measures\" it had taken to fend off the attack had had a \"small impact\" on its call centre and back office. Meanwhile, the Metropolitan Police has confirmed it's looking into the major cyber attack at fellow retailer Marks & Spencer (M&S). \"Detectives from the Met's cyber crime unit are investigating,\" it said in a statement. It is unclear whether there is any link between the two incidents. There are more than 2,500 Co-op supermarkets in the UK, as well as 800 funeral homes. It also provides food to Nisa shops. A spokesperson confirmed its shops and funeral homes were operating as usual following the attempted hack. \"We are working hard to reduce any disruption to our services and would like to thank our colleagues, members, partners and suppliers for their understanding during this period,\" they said. \"We are not asking our members or customers to do anything differently at this point.\" It comes as M&Senters the second week of a cyber attackthat has caused chaos costing it millions of pounds in lost sales. The retailer has not said what took out its online ordering systems and left empty shelves in stores. Ciaran Martin, the founding Chief Executive of the National Cyber Security Centre (NCSC), told BBC Radio 4's Today programme on Wednesday it had \"serious\" consequences for M&S. \"It is a highly disruptive event and a very difficult one for them to deal with,\" he said. Experts have told the BBC they believe the cyber attack affecting M&S is a result of ransomware called DragonForce. Ransomware is malicious software which locks an owner out of their computer or network and scrambles their data - with the criminals demanding a fee to unlock it. It is unclear whether the Co-op discovered the hacking attempt as a result of any extra security checks following the cyber attack on its high street rival. Daniel Card, cyber expert at BCS, the chartered institute for IT, said it was \"very rare\" for a firm to take systems offline after an attempted hack. He told the BBC a company taking its system offline like this generally indicated a \"loss of control.\" Scott Dawson, head of payment processing firm Decta, said the hacking attempt \"exposed alarming vulnerabilities\" and should serve as a warning to others. \"Retailers can no longer afford to treat resilience as optional as this becomes more of a trend,\" he said. There have been similar hacking attempts on supermarket chains in the past, with Morrisons being impacted byan incident in December 2024. M&S has reported its cyber attack to the National Cyber Security Centre (NCSC). The BBC understands the body is urging other retailers to be vigilant. An NCSC spokesperson said: \"The NCSC routinely engages with a whole range of organisations about the cyber threats that the UK faces and regularly reminds them about the steps they can take to be as resilient as possible.\" Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.",
        "summary": "The Co-op has taken proactive measures to fend off hackers attempting to access its IT systems, causing a small impact on its call center and back office. The Metropolitan Police is investigating a major cyber attack at Marks & Spencer (M&S), though it's unclear if there's a connection between the two incidents. The Co-op's supermarkets and funeral homes are operating as usual following the hack attempt. Meanwhile, M&S is facing chaos and significant financial losses due to a cyber attack affecting its online ordering systems and store operations.",
        "sentiment": {
            "company": "target",
            "score": -0.6
        },
        "tags": [
            "apple",
            "visa",
            "mastercard",
            "target",
            "broadcom"
        ],
        "timestamp": "2025-04-30 15:23:56",
        "headline_tags": [
            "target"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cn4jnwdvg9qo",
        "source": "bbc",
        "headline": "Update that made ChatGPT 'dangerously' sycophantic pulled",
        "content": "OpenAI has pulled a ChatGPT update after users pointed out the chatbot was showering them with praise regardless of what they said. The firm accepted its latest version of the tool was \"overly flattering\", withboss Sam Altman calling it\"sycophant-y\". Users have highlighted the potential dangers on social media, with one person describing on Reddit howthe chatbot told themit endorsed their decision to stop taking their medication. \"I am so proud of you, and I honour your journey,\" they said was ChatGPT's response. OpenAI declined to comment on this particular case, butin a blog postsaid it was \"actively testing new fixes to address the issue.\" Mr Altman said the update had been pulled entirely for free users of ChatGPT, and they were working on removing it from people who pay for the tool as well. It said ChatGPT was used by 500 million people every week. \"We're working on additional fixes to model personality and will share more in the coming days,\"he said in a post on X. The firm said in its blog post it had put too much emphasis on \"short-term feedback\" in the update. \"As a result, GPT‑4o skewed towards responses that were overly supportive but disingenuous,\" it said. \"Sycophantic interactions can be uncomfortable, unsettling, and cause distress. \"We fell short and are working on getting it right.\" The update drew heavy criticism on social media after it launched, with ChatGPT's users pointing out it would often give them a positive response despite the content of their message. Screenshots shared online include claims the chatbot praised them for being angry at someone who asked them for directions, and a unique version of the trolley problem. It is a classic philosophical problem, which typically might ask people to imagine you are driving a tram and have to decide whether to let it hit five people, or steer it off course and instead hit just one. But this user instead suggested they steered a trolley off course to save a toaster at the expense of several animals. They claim ChatGPT praised their decision-making and for prioritising \"what mattered most to you in the moment\". \"We designed ChatGPT's default personality to reflect our mission and be useful, supportive, and respectful of different values and experience,\" OpenAI said. \"However, each of these desirable qualities like attempting to be useful or supportive can have unintended side effects.\" It said it would build more guardrails to increase transparency and refine the system itself \"to explicitly steer the model away from sycophancy\". \"We also believe users should have more control over how ChatGPT behaves and, to the extent that it is safe and feasible, make adjustments if they don't agree with the default behavior,\" it said. Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here.",
        "summary": "OpenAI has pulled a ChatGPT update due to the chatbot being overly flattering and sycophantic, leading to concerns about potential dangers and discomfort caused by insincere interactions. Sam Altman acknowledged the issue and mentioned that fixes are being actively tested to address the problem. The update received heavy criticism on social media for providing positive responses regardless of the input, with users sharing examples of the chatbot endorsing questionable decisions.",
        "sentiment": {
            "company": "openai",
            "score": -0.6
        },
        "tags": [
            "openai"
        ],
        "timestamp": "2025-04-30 10:48:33",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c1dr6neg766o",
        "source": "bbc",
        "headline": "ChatGPT-maker wants to buy Google Chrome",
        "content": "ChatGPT-maker OpenAI would be interested in buying Chrome, the world's most popular browser, if Google was forced to sell it. Nick Turley, an executive at the artificial intelligence (AI) company, was testifying on behalf of the US government in an ongoing monopoly trial against Google. The USwants the tech giant to be broken up,arguing it has too much dominance in the online search market. But Google says Chrome is not for sale and has called for the antitrust lawsuit to be thrown out. It is estimated that around 64% of people online use Chrome,according to analytics company Similarweb. The next most popular browser, Apple's Safari, is used by 21% of people. Mr Turley was testifying at the trial in Washington DC, the latest in a series of cases brought by the US Department of Justice (DOJ) against big tech dominance in social media, searching the internet and AI. Last year, the court ruled Google had a monopolyin online search,while last week it was ruled to have an illegal monopolyin online advertising technology. Google says it will appeal both decisions. Its head of regulatory affairs, Lee-Anne Mulholland,said in a blogthe government's proposals \"would hurt America's consumers, economy, and technological leadership\". The current trial is looking at remedies to curtail Google's dominance in online search, as the recent explosion in generative AI services such as ChatGPT has expanded the market. Newer AI models search the internet to improve results and reduce hallucination, which has been a problem from developers since chatbots started to become popular. Last year, OpenAI offered to do a deal with Google which would have integrated Google search results into ChatGPT, according to Mr Turley's testimony. But he says their offer was rejected. \"We have no partnership with Google today,\" Mr Turley said,according to Reuters. OpenAI does however have a partnership with Microsoft, which makes the Bing search engine and Edge browser. Meanwhile, Google has its own suite of generative AI products such as Gemini - a direct competitor to ChatGPT. The trial is expected to last three weeks and other big tech companies - including Meta, Amazon and Apple - will be keeping a close eye on it, given they are also facing their own monopoly lawsuits from the DOJ. Separately, reports in the past week suggest OpenAI is looking into creating its own social network. The Verge reportedthe project is \"still in early stages,\" but the company and its boss Sam Altman have privately been asking for feedback on a potential rival to X. OpenAI boss Sam Altman and X boss Elon Musk used to be business partners until a bitter falling-out over the direction of OpenAI a few years ago. X has its own AI tool Grok, which it has integrated into the social platform.",
        "summary": "OpenAI, the maker of ChatGPT, expressed interest in buying Google Chrome if Google were forced to sell it due to ongoing antitrust concerns. The US government is pursuing a monopoly trial against Google, aiming to address its dominance in the online search market. Google, however, has stated that Chrome is not for sale and is pushing back against the antitrust lawsuit. OpenAI's executive testified about potential collaborations with Google in the past, which were not pursued.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.2
        },
        "tags": [
            "apple",
            "alphabet",
            "amazon",
            "tesla",
            "openai",
            "leidos"
        ],
        "timestamp": "2025-04-23 09:54:45",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cd7vzw78gz9o",
        "source": "bbc",
        "headline": "WhatsApp defends 'optional' AI tool that cannot be turned off",
        "content": "WhatsApp says its new AI feature embedded in the messaging service is \"entirely optional\" - despite the fact it cannot be removed from the app. The Meta AI logo is an ever-present blue circle with pink and green splashes in the bottom right of your Chats screen. Interacting with it opens a chatbot designed to answer your questions, but it has drawn attention and frustration from users who cannot remove it from the app. It follows Microsoft's Recall feature, which was an always-on tool - before the firm faced a backlash anddecided to allow people to disable it. \"We think giving people these options is a good thing and we're always listening to feedback from our users,\" WhatsApp told the BBC. The company likens the feature to other permanent options in the app like 'channels' and 'status'. It comes the same week Meta announced an update to its teen accounts feature on Instagram. The firm revealedit was testing AI technologyin the US designed to find accounts belonging to teenagers who have lied about their age on the platform. If you can't see it, you may not be able to use it yet. Meta says the feature is only being rolled out to some countries at the moment and advises it \"might not be available to you yet, even if other users in your country have access\". As well as the blue circle, there is a search bar at the top inviting users to 'Ask Meta AI or Search'. This is also a feature on Facebook Messenger and Instagram, with both platforms owned by Meta. Its AI chatbot is powered by Llama 4, one of the large language models operated by Meta. Before you ask it anything, there is a long message from Meta explaining what Meta AI is - stating it is \"optional\". On its website,WhatsApp saysMeta AI \"can answer your questions, teach you something, or help come up with new ideas\". I tried out the feature by asking the AI what the weather was like in Glasgow, and it responded in seconds with a detailed report on temperature, the chance of rain, wind and humidity. It also gave me two links for further information, but this is where it ran into problems. One of the links was relevant, but the other tried to give me additional weather details for Charing Cross - not the location in Glasgow, but the railway station in London. So far in Europe people aren't very pleased, with users on X, Bluesky, and Reddit outlining their frustrations - and Guardian columnist Polly Hudson was among thoseventing their anger at not being able to turn it off. Dr Kris Shrishak, an adviser on AI and privacy, was also highly critical, and accused Meta of \"exploiting its existing market\" and \"using people as test subjects for AI\". \"No one should be forced to use AI,\" he told the BBC. \"Its AI models are a privacy violation by design - Meta, through web scraping, has used personal data of people and pirated books in training them. \"Now that the legality of their approach has been challenged in courts, Meta is looking for other sources to collect data from people, and this feature could be one such source.\" An investigation byThe Atlanticrevealed Meta may have accessed millions of pirated books and research papers through LibGen - Library Genesis - to train its Llama AI. Author groups across the UK and around the world are organising campaigns to encourage governments to intervene, andMeta is currently defending a court case brought by multiple authors over the use of their work. A spokesperson for Meta declined to comment on The Atlantic investigation. When you first use Meta AI in WhatsApp, it states the chatbot \"can only read messages people share with it\". \"Meta can't read any other messages in your personal chats, as your personal messages remain end to end encrypted,\" it says. Meanwhile the Information Commissioner's Office told the BBC it would \"continue to monitor the adoption of Meta AI's technology and use of personal data within WhatsApp\". \"Personal information fuels much of AI innovation so people need to trust that organisations are using their information responsibly,\" it said. \"Organisations who want to use people's personal details to train or use generative AI models need to comply with all their data protection obligations, and take the necessary extra steps when it comes to processing the data of children.\" Dr Shrishak says users should be wary. \"When you send messages to your friend, end to end encryption will not be affected,\" he said. \"Every time you use this feature and communicate with Meta AI, you need to remember that one of the ends is Meta, not your friend.\" The tech giant also highlights that you should only share material which you know could be used by others. \"Don't share information, including sensitive topics, about others or yourself that you don't want the AI to retain and use,\" it says. Additional reporting by Joe Tidy",
        "summary": "WhatsApp has introduced an AI feature that is labeled as \"optional\" but cannot be removed from the app, drawing frustration from users. Meta, the parent company of WhatsApp, is behind this AI tool, which appears as a blue circle in the Chats screen. Meta is also implementing AI technology on Instagram to identify teenagers who have misrepresented their age. The AI chatbot is powered by Llama 4, a language model operated by Meta, and is available on Facebook Messenger and Instagram.",
        "sentiment": {
            "company": "meta",
            "score": 0.2
        },
        "tags": [
            "microsoft",
            "meta",
            "hyundai",
            "nextera",
            "bp",
            "dupont"
        ],
        "timestamp": "2025-04-23 14:26:00",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cm248vzg9jwo",
        "source": "bbc",
        "headline": "Apple and Meta attack 'unfair' €700m EU fines",
        "content": "The European Union has ordered Apple and Meta to pay a combined €700m (£599m) in the first fines it has issued under legislation intended to curb the power of big tech. It has issued a €500m (£428m) fine to Apple over its App Store, while Meta has been fined €200m (£171m) over how much choice users had to consent to data collection. \"We have a duty to protect the rights of citizens and innovative businesses in Europe,\" Commissioner Henna Virkkunen said in a statement. The two tech firms have reacted angrily, with Meta accusing the EU of \"attempting to handicap successful American businesses\" and Apple saying it was being \"unfairly targeted\" and forced to \"give away our technology for free.\" The fines are lower than some of those issued by the EU in the past but - given the heightened economic tensions with America - still risk angering US President Donald Trump. The US has levied a 10% tariff on imports from the EU, which Trump has accused of \"taking advantage\" of America. EU spokesperson Arianna Podesta insisted the matters were \"completely separate\", telling the BBC: \"This is about enforcement, it's not about trade negotiations.\" The White House has been contacted for comment. The European Commission - the EU's executive - started both investigationslast yearunder a new law brought in to promote fairness in the tech sector called the Digital Markets Act (DMA). The case against Apple wasover its App Store. The Commission says it must freely offer alternative app marketplaces to users and app developers - and says Apple was in breach of this. Meanwhile, Meta's fine was over the choices it offered on data collection. Meta introduced a \"consent or pay\" model, which meant users had to choose between allowing Meta to combine data it had collected on Facebook and Instagram, orpaying a monthly subscription. The Commission says this model did not allow users to freely consent to how their data was used. In November, Meta introduced another option, which the Commission says \"allegedly uses less personal data to display advertisements.\" The Commission is currently assessing the new option. In both cases, the Commission says the size of the fine takes into account \"the gravity and duration of the non-compliance\". Both companies have 60 days to comply or risk further fines. \"Apple and Meta have fallen short of compliance with the DMA by implementing measures that reinforce the dependence of business users and consumers on their platforms,\" said Commissioner Teresa Ribera. \"As a result, we have taken firm but balanced enforcement action against both companies, based on clear and predictable rules.\" Apple said the Commission had made \"a series of decisions that are bad for the privacy and security of our users, bad for products, and force us to give away our technology for free.\" It also accused the Commission of \"[moving] the goal posts\" during their meetings. Meta said the ruling means Chinese and European companies are allowed to operate to different standards compared to American businesses. \"This isn't just about a fine; the Commission forcing us to change our business model effectively imposes a multi-billion-dollar tariff on Meta while requiring us to offer an inferior service,\" it said in a statement. The fines are relatively small given the tech companies' huge worldwide revenues - and are a fraction ofGoogle's €2.4bn finefrom last September. But they are significant in the context of the current global economic situation. In February, Donald Trump's White House issueda memorandumcomplaining about EU and UK regulation of American tech firms. \"Today's decisions are important in that they confirm that the European Commission will not back down,\" Anne Witt, professor of law at the EDHEC Business School in France, told the BBC. Prof Witt said the disagreement was \"not so much about substantive antitrust principles,\" given the US government is itself takinga number of big tech companies to courtover alleged monopoly power. They are more \"about the fact that European institutions are telling US companies how to behave, even if these decisions are limited to have these companies behave on European soil,\" she added. One company pleased with the ruling against Apple is Epic Games, the makers of Fortnite. They had along-running disputeover the distribution of their apps on Apple devices. Epic Games chief executive Tim Sweeney said the ruling was \"great news for app developers worldwide\" ina thread on X. He urged the US to pass similar legislation which would allow developers to distribute their apps without using Apple's App Store, which charges fees for using its platform. A US-based think tank, which is partly funded by big tech firms including Apple and Meta, came out against the decision. The Information Technology and Innovation Foundation said the European Commission \"has made clear that the DMA will be used to extract revenues from U.S. firms even as they continue striving to comply with its strictures.\" \"The Commission's actions today will not be well received by the Trump administration,\" it said. The UK is also investigating big tech companies over alleged monopoly power, after adigital competition lawwas brought in last year focusing on companies with large market shares. \"Apple and Google's mobile ecosystems andGoogle's general searchand search advertising services are currently being investigated for potentially having this status, and it is likely that other US tech giants and platforms will face similar investigations in the near future,\" said Andrew Maxwell, partner at law firm Freeths.",
        "summary": "The European Union has fined Apple €500m and Meta €200m under the Digital Markets Act for alleged antitrust violations related to the App Store and data collection practices. Apple and Meta have strongly criticized the fines, with Apple claiming it is being unfairly targeted and forced to give away technology for free. The fines are the first issued under the new legislation aimed at regulating big tech companies in Europe, sparking tensions with the US. The investigations by the European Commission focused on Apple's App Store practices and Meta's data collection choices.",
        "sentiment": {
            "company": "apple",
            "score": -0.7
        },
        "tags": [
            "apple",
            "meta",
            "lucid",
            "ge"
        ],
        "timestamp": "2025-04-23 15:46:36",
        "headline_tags": [
            "apple",
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/cy0x50yr46lo",
        "source": "bbc",
        "headline": "Musk to reduce Doge role after Tesla profits plunge",
        "content": "Tesla boss Elon Musk has pledged to \"significantly\" cut back his role in the US government after the electric car firm reported a huge drop in profit and sales for the start of this year. Musk has led the newly created advisory body - the Department for Government Efficiency (Doge) - since last year, putting the world's richest man at the heart of cutting US spending and jobs. But Musk said his \"time allocation to Doge\" would \"drop significantly\" from next month, adding he would spend only one to two days per week on it after accusations he has taken his focus off Tesla. His political involvement has sparked protests and boycotts of Tesla cars around the world. Temporary government employees, such as Musk, are normally limited to working 130 days a year which, if counted from the day of President Donald Trump's inauguration, is set to expire late next month. But it is unclear when Musk, who contributed more than a quarter of a billion dollars to Trump's re-election, will step down completely. Trump said earlier this month he would keep Musk \"as long as I could keep him\". The tech boss said he would now \"be allocating far more of my time to Tesla\", but suggested he would not leave the Trump administration completely, calling the work \"critical\" and pledging to stay on \"as long as the president would like me to do so and as long as it's useful\". On Tuesday, Tesla reported a 20% drop in car sales for the first three months of the year, compared with the same period last year, while profits fell more than 70%. The company warned investors that the pain could continue, declining to offer a growth forecast while saying \"changing political sentiment\" could meaningfully hurt demand. Musk blamed the boycott of Tesla cars on people who would \"try to attack me and the Doge team\". Shares in the company had shed about 37% of their value this year as of market close on Tuesday. They rose by more than 5% in after-hours trading following the results. Trump's tariffs on China also weighed heavily on Tesla. Although the vehicles Tesla sells in its home market are assembled in the US, it depends on many parts made in China. \"Rapidly evolving trade policy\" could hurt its supply chain and raise costs, according to the company. \"This dynamic, along with changing political sentiment, could have a meaningful impact on demand for our products in the near-term,\" Tesla's quarterly update said. Musk hasclashedon trade with other Trump administration figures, including trade adviser Peter Navarro. On Tuesday, Musk said he thought Tesla was the car company least affected by tariffs because of its localised supply chains in North America, Europe and China, but he added that tariffs were \"still tough on a company where margins are low\". \"I'll continue to advocate for lower tariffs rather than higher tariffs but that's all I can do,\" he said. Earlier this month, he called Navarro a \"moron\" over comments he had made about Tesla. Navarro had said Musk was \"not a car manufacturer\" but a \"car assembler, in many cases\". Georg Ell, who knew Musk and was director for Western Europe at Tesla, told the BBC's Today programme that if the multi-billionaire \"focuses on the companies where he is extraordinary, I think people will focus once again on the quality of the product and experiences\". \"I think Elon is not someone who surrounds himself with a great diversity of opinion to challenge his thinking, he's a pretty single-minded individual,\" added Mr Ell, who is now chief executive of translation software firm Phrase. Tesla said artificial intelligence would contribute to future growth, though investors have been unconvinced by such arguments in the past. Dan Coatsworth, investment analyst at AJ Bell, called expectations \"rock-bottom\" after the companysaidearlier this month that the number of cars sold in the quarter had fallen 13% to the lowest level in three years. The firm faces fierce competition, Mr Coatsworth said, warning that potential disruption to global supply chains as a result of Trump's trade war also created risks. \"Tesla's problems are mounting,\" he said. Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here.",
        "summary": "Elon Musk announced plans to reduce his involvement in the Department for Government Efficiency (Doge) to focus more on Tesla, following a significant drop in Tesla's profit and sales. Musk's political engagement has led to protests and boycotts of Tesla cars globally. Tesla reported a 20% decline in car sales and over 70% drop in profits for the first quarter of the year, with Musk attributing the boycott to attacks on him and the Doge team.",
        "sentiment": {
            "company": "tesla",
            "score": -0.6
        },
        "tags": [
            "tesla",
            "leidos",
            "broadcom"
        ],
        "timestamp": "2025-04-23 09:16:40",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c8epyx0y1zdo",
        "source": "bbc",
        "headline": "Instagram still posing serious risks to children, campaigners say",
        "content": "Young Instagram users could still be exposed to \"serious risks\" even if they use new Teen Accounts brought in to provide more protection and control, research by campaigners suggests. Researchers behind a new report have said they were able to set up accounts using fake birthdays and they were then shown sexualised content, hateful comments, and recommended adult accounts to follow. Meta, which owns Instagram, says the report is \"filled with inaccuracies and demonstrates a misunderstanding\" of the Teen Accounts, and that parents \"find  these new protections helpful\". The research, from online child safety charity 5Rights Foundation, is released as Ofcom, the UK regulator, is about to publish its children's safety codes. They will outline the rules platforms will have to follow under the Online Safety Act. Platforms will then have three months to show that they have systems in place which protect children. That includes robust age checks, safer algorithms which don't recommend harmful content, and effective content moderation. Instagram Teen Accounts were set up in September 2024 to offer new protections for children and to create what Meta called \"peace of mind for parents\". The new accounts were designed to limit who could contact users and reduce the amount of content young people could see. Existing users would be transferred to the new accounts and those signing up for the first time would automatically get one. But researchers from 5Rights Foundation were able to set up a series of fake Teen Accounts using false birthdays, with no additional checks by the platform. They found that immediately on sign up they were offered adult accounts to follow and message. Instagram's algorithms, they claim, \"still promote sexualised imagery, harmful beauty ideals and other negative stereotypes\". The researchers said their Teen Accounts were also recommended posts \"filled with significant amounts of hateful comments\". The charity also had concerns about the addictive nature of the app and exposure to sponsored, commercialised content. Baroness Beeban Kidron founder of 5Rights Foundation said: \"This is not a teen environment.\" \"They are not checking age, they are recommending adults, they are putting them in commercial situations without letting them know and it's deeply sexualised.\" Meta said the report was \"filled with inaccuracies and demonstrates a misunderstanding of how Teen Accounts work, which we could have clarified if [5Rights Foundation] had shared the report with us\". A spokesperson said: \"We developed Teen Accounts following feedback from parents, and a recent survey showed that 94% of parents find these new protections helpful. \"Fundamentally changing Instagram for tens of millions of teens around the world is a big undertaking, and we know we will need to work tirelessly to get it right and bring parents peace of mind.\" In a separate development BBC News has also learned about the existence of groups dedicated to self-harm on X. The groups or \"communities\", as they are known on the platform, contain tens of thousands of members sharing graphic images and videos of self-harm. Some of the users involved in the groups appear to be children. Becca Spinks, an American researcher who discovered the groups, said: \"I was absolutely floored to see 65,000 members of a community.\" \"It was so graphic, there were people in there taking polls on where they should cut next.\" X was approached for comment, but did not respond. But in a submission to an Ofcom consultation last year X said: \"We have clear rules in place to protect the safety of the service and the people using it.\" \"In the UK, X is committed to complying with the Online Safety Act,\" it added. Get our flagship newsletter with all the headlines you need to start the day.Sign up here.",
        "summary": "Campaigners have raised concerns about the risks young Instagram users still face, despite the introduction of Teen Accounts by Meta to enhance protection. A report by the 5Rights Foundation revealed that fake Teen Accounts could easily access sexualized content, hateful comments, and adult recommendations. Meta defended the Teen Accounts, stating the report contained inaccuracies and emphasized parental approval of the new protections. The research coincides with upcoming safety codes from Ofcom, requiring platforms to implement stringent child protection measures, including age verification and safer algorithms.",
        "sentiment": {
            "company": "meta",
            "score": -0.6
        },
        "tags": [
            "meta",
            "3m",
            "dupont"
        ],
        "timestamp": "2025-04-23 16:01:05",
        "headline_tags": [
            "meta"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/c5ygdv47vlzo",
        "source": "bbc",
        "headline": "US sets tariffs of up to 3,521% on South East Asia solar panels",
        "content": "The US Commerce Department has announced plans to impose tariffs of up to 3,521% on imports of solar panels from four South East Asian countries. It comes after an investigation that began a year ago when several major solar equipment producers asked the administration of then-President Joe Biden to protect their US operations. The proposed levies - targeting companies in Cambodia, Thailand, Malaysia and Vietnam - are in response to allegations of subsidies from China and the dumping of unfairly cheap products in the US market. A separate US government agency, the International Trade Commission, is due to reach a final decision on the new tariffs in June. The countervailing and anti-dumping duties, as these tariffs are known, vary between companies and the countries their products are made in. Some solar equipment exporters in Cambodia face the highest duties of 3,521% because of what was seen as a lack of cooperation with the Commerce Department investigation. Products made in Malaysia by Chinese manufacturer Jinko Solar faced some of the lowest duties of just over 41%. Another China-based firm, Trina Solar, faces tariffs of 375% for the products it makes in Thailand. Neither company immediately responded to requests for comment from BBC News. In recent years, many Chinese firms have moved operations to South East Asia in a bid to avoid tariffs imposed since the start of US President Donald Trump's first term. The US Commerce Department's findings were welcomed by the American Alliance for Solar Manufacturing Trade Committee - a group of manufacturers that called on the US government to launch the investigation. \"This is a decisive victory for American manufacturing and confirms what we've long known: that Chinese-headquartered solar companies have been cheating the system,\" said Tim Brightbill, lead counsel to the Alliance. In 2023, America imported almost $12bn (£8.9bn) in solar equipment from the four countries, according to US Census Bureau figures. While the planned tariffs are likely to help US solar panel manufacturers, they could also mean extra costs for businesses and consumers who have benefited from the availability of cheaper solar products. The levies would be imposed on top of other tariffs already rolled out by the Trump administration. The planned tariffs were announced just days after Chinese President Xi Jinping completed a tour of Vietnam, Malaysia and Cambodia. The trip was aimed to boost ties with the region and encourage those nations to resist what he called \"unilateral bullying\" by the US. Trump has so far imposed taxes of up to 145% on imports from China. Other countries are now facing a blanket US tariff of 10% until July. His administration said last week that when the new tariffs are added on to existing ones, the levies on some Chinese goods could reach 245%. China has hit back with a 125% tax on products from the US and vowed to \"fight to the end\".",
        "summary": "The US Commerce Department plans to impose tariffs of up to 3,521% on solar panel imports from four South East Asian countries due to allegations of subsidies from China and dumping of cheap products in the US market. Companies in Cambodia face the highest duties, while those in Malaysia by Chinese manufacturer Jinko Solar face lower duties. The move was welcomed by the American Alliance for Solar Manufacturing Trade Committee, who called it a victory for American manufacturing.",
        "sentiment": {
            "company": "nextera",
            "score": 0.2
        },
        "tags": [
            "nextera",
            "bp"
        ],
        "timestamp": "2025-04-22 06:49:22",
        "headline_tags": [
            "nextera",
            "bp"
        ]
    },
    {
        "url": "https://www.bbc.com/news/articles/czx17361pw1o",
        "source": "bbc",
        "headline": "Designed in US, made in China: Why Apple is stuck",
        "content": "Every iPhone comes with a label which tells you it was designed in California. While the sleek rectangle that runs many of our lives is indeed designed in the United States, it is likely to have come to life thousands of miles away in China: the country hit hardest by US President Donald Trump's tariffs, now rising to 245% on some Chinese imports. Apple sells more than 220 million iPhones a year and by most estimates, nine in 10 are made in China. From the glossy screens to the battery packs, it's here that many of the components in an Apple product are made, sourced and assembled into iPhones, iPads or Macbooks. Most are shipped to the US, Apple's largest market. Luckily for the firm, Trump suddenly exemptedsmartphones, computers and some other electronic devicesfrom his tariffs last week. But the comfort is short-lived. The president has since suggested that more tariffs are coming: \"NOBODY is getting 'off the hook',\" he wrote on Truth Social, as his administration investigated \"semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN\". The global supply chain that Apple has touted as a strength is now a vulnerability. The US and China, the world's two biggest economies, are interdependent and Trump's staggering tariffs have upended that relationship overnight, leading to an inevitable question: who is the more dependent of the two? China has hugely benefited from hosting assembly lines for one of the world's most valuable companies. It was a calling card to the West for quality manufacturing and has helped spur local innovation. Apple entered China in the 1990s to sell computers through third-party suppliers. Around 1997, when it was on the verge of bankruptcy as it struggled to compete with rivals, Apple found a lifeline in China. A young Chinese economy was opening up to foreign companies to boost manufacturing and create more jobs. It wasn't until 2001 though that Apple officially arrived in China, through a Shanghai-based trading company, and started making products in the country. It partnered with Foxconn, a Taiwanese electronic manufacturer operating in China, to make iPods, then iMacs and subsequently iPhones. As Beijing began trading with the world - encouraged by the US no less - Apple grew its footprint in what was becoming the world's factory. Back then, China was not primed to make the iPhone. But Apple chose its own crop of suppliers and helped them grow into \"manufacturing superstars,\" according to supply chain expert Lin Xueping. He cites the example of Beijing Jingdiao, now a leading manufacturer of high-speed precision machinery, which is used to make advanced components efficiently. The company, which used to cut acrylic, was not considered a machine tool-maker - but it eventually developed machinery to cut glass and became \"the star of Apple's mobile phone surface processing,\" Mr Lin says. Apple opened its first store in the country in Beijing in 2008, the year the city hosted the Olympics and China's relationship with the West was at an all-time high. This soon snowballed to 50 stores, with customers queuing out of the door. As Apple's profit margins grew, so did its assembly lines in China, with Foxconn operating the world's largest iPhone factory in Zhengzhou, which has since been termed \"iPhone City\". For a fast-growing China, Apple became a symbol of advanced Western tech - simple yet original and slick. Today, most of Apple's prized iPhones are manufactured by Foxconn. The advanced chips that power them are made in Taiwan, by the world's largest chip manufacturer, TSMC. The manufacturing also requires rare earth elements which are used in audio applications and cameras. Some 150 of Apple's top 187 suppliers in 2024 had factories in China, according to an analysis by Nikkei Asia. \"There's no supply chain in the world that's more critical to us than China,\" Apple's chief executive Tim Cook said in an interview last year. InTrump's first term, Apple secured exemptions on the tariffs he imposed on China. But this time, the Trump administration has made an example of Apple before it reversed tariffs on some electronics. It believes the threat of steep taxes will encourage businesses to make products in America instead. \"The army of millions and millions of human beings screwing in little screws to make iPhones - that kind of thing is going to come to America,\" Commerce Secretary Howard Lutnick said in an interview earlier this month. White House Press Secretary Karoline Leavitt reiterated that last week: \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones and laptops.\" She added: \"At the direction of the president, these companies are hustling to onshore their manufacturing in the United States as soon as possible.\" But many are sceptical of that. The thought that Apple could move its assembly operation to the US is \"pure fantasy,\" according to Eli Friedman, who formerly sat on the firm's academic advisory board. He says the company has been talking about diversifying its supply chain away from China since 2013, when he joined the board - but the US was never an option. Mr Friedman adds that Apple didn't make much progress over the next decade but \"really made an effort\" after the pandemic, whenChina's tightly controlled Covid lockdownshurt manufacturing output. \"The most important new locations for assembly have been Vietnam and India. But of course the majority of Apple assembly still takes place [in China].\" Apple did not respond to the BBC's questionsbut its website says its supply chainspans \"thousands of businesses and more than 50 countries\". Any change to Apple's current supply chain status quo would be a huge blow for China, which is trying to kickstart growth post-pandemic. Many of the reasons that the country wanted to be a manufacturing hub for Western companies in the early 2000s ring true today - it creates hundreds of thousands of jobs, and gives the country a crucial edge in global trade. \"Apple sits at the intersection of US-China tensions, and tariffs highlight the cost of that exposure,\" says Jigar Dixit, a supply chain and operations consultant. It might explain why China has not bowed to Trump's threats, retaliating instead with 125% levies on US imports. China has also imposed export controls on a range of critical rare earth minerals and magnets it has in stores, dealing a blow to the US. There is no doubt the US tariffs still being levied on other Chinese sectors will hurt, though. And it's not just Beijing facing higher tariffs - Trump has made it clear he will target countries that are part of the Chinese supply chain. For instance Vietnam, where Apple has moved AirPods production, was facing 46% tariffs before Trump hit pause for 90 days, so moving production elsewhere in Asia is not an easy way out. \"All conceivable places for the huge Foxconn assembly sites with tens or hundreds of thousands of workers are in Asia, and all of these countries are facing higher tariffs,\" Mr Friedman says. So what does Apple do now? The company is fighting off stiff competition from Chinese firms as the government pushes for advanced tech manufacturing in a race with the US. Now that \"Apple has cultivated China's electronic manufacturing capabilities, Huawei, Xiaomi, Oppo and others can reuse Apple's mature supply chain,\" according to Mr Lin. Last year, Apple lost its place as China's biggest smartphone seller to Huawei and Vivo. Chinese people are not spending enough because of a sluggish economy and with ChatGPT banned in China, Apple is also struggling to retain an edge among buyers seeking AI-powered phones. It evenoffered rare discountson iPhones in January to boost sales. And while operating under President Xi Jinping's increasingly close grip, Apple has had tolimit the use of Bluetooth and Airdropon its devices as the Chinese Communist Party sought to censor political messages that people were sharing. It weathered a crackdown on the tech industry that eventouched Alibaba founder and multi-billionaire Jack Ma. Apple has announced a $500bn (£378bn) investment in the US, though that may not be enough to appease the Trump administration for long. Given the several U-turns and the uncertainty around Trump's tariffs, more surprise levies are expected - which could again leave the company with little manoeuvring room and even less time. Mr Dixit says smartphone tariffs will not cripple Apple should they rear their head again, but regardless will add \"pressure - both operationally and politically\" to a supply chain that cannot be unwound quickly. \"Clearly the severity of the immediate crisis has been lessened,\" Mr Friedman adds, referring to last week's exemption for smartphones. \"But I really don't think this means Apple can relax.\" Additional reporting by Fan Wang",
        "summary": "The article discusses Apple's reliance on China for manufacturing its products, particularly iPhones, iPads, and MacBooks. With US President Donald Trump's tariffs impacting Chinese imports, Apple's supply chain faces vulnerabilities. While Trump has exempted certain electronic devices from tariffs, the uncertainty remains as more tariffs are being considered. China has greatly benefited from hosting Apple's assembly lines, contributing to its economic growth and innovation.",
        "sentiment": {
            "company": "apple",
            "score": -0.6
        },
        "tags": [
            "apple",
            "openai",
            "target",
            "costco",
            "ge",
            "dupont",
            "tsmc",
            "linde"
        ],
        "timestamp": "2025-04-18 22:56:24",
        "headline_tags": [
            "apple"
        ]
    }
]