[
    {
        "url": "https://www.bbc.com/news/articles/cp816jrnynyo",
        "headline": "Warning retail job cuts ‘inevitable’ after Budget",
        "content": "High Street job losses are \"inevitable\", prices will rise, and shops will close because of tax rises in the Budget and other rising costs, a group of the biggest retailers in the UK is warning. Tesco, Amazon, Greggs, Next and dozens of other chains are urging the Treasury to reconsider some of the measures. In a letter to Chancellor Rachel Reeves , they said the \"cumulative burden\" of the Budget changes and other policies already in the pipeline will add billions in costs to a sector with a 3% to 5% profit margin. A Treasury spokesperson said it had had to \"make difficult choices to fix the foundations of the country\", while one union called the letter \"pathetic\". Bank of England governor Andrew Bailey told the Treasury Committee on Tuesday he had seen the letter and it was \"right\" to say jobs could be affected. He said the employer National Insurance (NI) tax rise from the Budget could mean higher inflation, lower wage growth, or higher unemployment, adding in written evidence to the committee the Bank will be \"gradual\" on interest rate cuts as a result. Measures in the Budget, in particular the employer NI increase , have been met with a tide of criticism from business, who argue it will hold back growth. But concerns have been loudest among retailers and hospitality businesses, where many young people find their first jobs. Firms in those sectors are also facing higher costs from next year's rise in the minimum wage . Though many individual retailers have already spoken out, this letter marks the first time so many have done so together. The 81 signatories of the letter range from big British retailers - such as Aldi, Asda, Boots, Currys, John Lewis, Lidl, Marks & Spencer, Primark and Sainsbury's - to charity shop group the British Heart Foundation and trade group Associated Independent Stores. The government has defended its tax rises as necessary to avoid cuts to public services, and the rise in the minimum wage, with a bigger boost for younger workers and apprentices, has been welcomed by trades unions. The letter from the businesses belonging to the British Retail Consortium (BRC) said: \"The sheer scale of new costs and the speed with which they occur create a cumulative burden that will make job losses inevitable, and higher prices a certainty.\" It calculated the changes would add over £7bn a year in costs, adding it would \"not be possible to absorb such significant cost increases over such a short timescale\". \"The effect will be to increase inflation, slow pay growth, cause shop closures, and reduce jobs, especially at the entry level.\" However, Nadine Houghton, GMB Union national officer, said larger businesses \"pleading poverty\" was \"utterly pathetic\". “Most of these companies’ fortunes are already subsidised by the taxpayer. They pay very low wages which then have to be topped up by in-work benefits,\" she added. “It’s only right that they should now contribute a bit more to rebuilding our country.” From next April, all large businesses will have to pay higher National Insurance Contributions (NICs) for every member of staff they employ. Employer NICs will start at a lower threshold than now, at £5,000 instead of £9,100, and the rate will rise from 13.8% to 15%. The BRC calculates this will cost British retailers £2.33bn a year. The rise in the minimum wage from April is set to cost the sector a further £2.73bn, the BRC letter said. In addition, from October 2025 a new packaging levy comes into force. Introduced by the previous government, the extended producer responsibility (EPR) scheme shifts the cost of recycling from local councils onto the companies that use the packaging. Smaller firms are exempt, but the new levy will cost the retail sector overall another £2bn, the BRC estimates. Retail analyst Catherine Shuttleworth said the Budget changes \"will in some cases wipe out profits and in most cases significantly reduce profits, which will in the short-to-medium term risk more jobs if retailers cannot find alternative ways to save costs\". Nick Stowe, the chief executive of High Street fashion stores Monsoon and Accessorize, told the BBC he was going to have to \"divert investment\" from opening more shops to protecting its current shops. Mr Stowe, who signed the BRC letter, said the sector was being forced into things which run counter to the government's growth agenda. Mark Neale, the boss of outdoor retailer Mountain Warehouse, who also signed the letter, told the BBC he would \"prefer to pay more tax by growing the business\". The letter from the retailers calls for the government to phase in the introduction of the NI changes and delay the start of the EPR. It urges the government to reduce business rates, a property-related tax which the BRC says will cost retailers an additional £140m a year after next April, though there is a 40% relief available for 250,000 premises. The Treasury said that thanks to exemptions for smaller businesses, \"more than half of employers will either see a cut or no change in their national insurance bills [and] there will be £22.6bn more for the NHS\". A business update from Begbies Traynor on Monday gave some weight to the BRC's warnings. The consultancy predicted more firms in financial difficulty would need its insolvency advice due to both the NI change and higher interest rates."
    },
    {
        "url": "https://www.bbc.com/news/articles/c9371zk1q6vo",
        "headline": "Trump to name Howard Lutnick for commerce secretary",
        "content": "Donald Trump is expected to name investor Howard Lutnick, the co-chair of his transition team, to lead the US commerce department, according to CBS News, the BBC's US partner. If confirmed, Lutnick would oversee a department that helps boost domestic manufacturing and US companies. It is often a key player in areas where business and national security interests collide, such as restricting technology exports to China or enacting tariffs to protect US steel. Lutnick, the chief executive of financial firm Cantor Fitzgerald, had also been in the running for treasury secretary, a more high-profile role. Trump has yet to make a decision about that post, which has sweeping authority in areas such as economic and tax policy. The fight has spilled into public view, with advisers such as billionaire Elon Musk promoting Lutnick for the position and criticising one of the alternative candidates, Scott Bessent, as too \"business as usual\". Commerce is smaller than the treasury department, with a workforce of about 50,000 people. Beyond its role in the US-China trade and tech war, its responsibilities include patent approvals, publishing economic data, and conducting the US census. Lutnick, a native of Long Island, New York, is a long-time Republican and supporter of Trump, with whom he overlapped in the New York social scene. He has explained his support for the president-elect by describing himself as a \"strong capitalist\" and saying Trump has a \"competitive growth model\". During the campaign, he served as a spokesman for some of Trump's most radical plans, including wide-ranging tariffs and the elimination of the income tax. His embrace of those views put him out of step with some on Wall Street, which has historically seen tariffs as bad for corporate America. Lutnick joined Cantor Fitzgerald right after his 1983 graduation from Haverford College, which he attended on scholarship. He lost both of his parents as a teenager - his mother to cancer and his father to a medical mistake. Within 10 years, he rose to be president and chief executive of the firm. It is known today in part for its investments in crypto and its affiliate in the property industry, the Newmark brokerage. Lutnick's public profile rose after the September 11 attacks, which killed more than 600 people working in the company’s offices that morning, including his brother. He was not at work because he was taking one of his children to kindergarten. Lutnick, who speaks with a New York accent and is known for his blustery style, wept on TV in the days after. Twenty years later, in an interview with the Wall Street Journal, he said the day was a dividing line in his life, “before 9/11 and after” and for years following “it was still so raw it felt like yesterday”."
    },
    {
        "url": "https://www.bbc.com/news/articles/c80l9lde5yjo",
        "headline": "Winter fuel cut to put 50,000 into poverty next year",
        "content": "An additional 50,000 pensioners will be living in relative poverty next year as a result of cuts to the winter fuel allowance, the government's own estimates have revealed. Earlier this year, Chancellor Rachel Reeves announced the £300 payment would be restricted to all but the poorest pensioners - those eligible for pension credit. In a bid to soften the impact of the cuts, the government launched a campaign to encourage eligible pensioners to apply for pension credit. In a letter clarifying the figures, Work and Pensions Secretary Liz Kendall said the estimates did not take into account any increased take-up of pension credit. She also said the figures have been rounded to the nearest 50,000 and noted that the numbers given for each year should not be added together. According to the estimates provided by the government, in the year ending March 2025, March 2026 and March 2028 there will be an additional 50,000 pensioners in relative poverty after housing costs. In the year ending March 2027, March 2029 and March 2030 an additional 100,000 pensioners would be in relative poverty after housing costs, the estimates say. Currently the government estimates 1.9 million pensioners - around 15% - are in relative poverty. The new estimates, published on Tuesday, suggest the cuts to the winter fuel payment would increase pensioner poverty by 0.5 percentage points. A person is considered to be living in relative poverty if they have less than 60% of the median income. In her letter, Kendall said the work and pensions department had written to 120,000 pensioners to encourage them to claim the pension credit to which they may be entitled. She added that the decision to cut the winter fuel payments was \"not a decision this government wanted or expected to take\". \"However, we were forced to take difficult decisions to balance the books in light of the £22bn black hole we inherited. \"Given the dire state of the public finances, it’s right that we target support to those who need it most.\" Helen Whately, the Conservatives' shadow work and pensions secretary, said: \"Finally the dam breaks and we get to see what Labour have known all along. \"Their winter fuel payment cuts are going to plunge 100,000 pensioners into poverty in the next few years. \"Clearly Keir Starmer feels like that's a price worth paying to make a political point. But I don't think those pensioners would agree with him.\" Daisy Cooper, the Liberal Democrats' Treasury spokesperson, said: “While the Conservatives undoubtedly left this government a dire fiscal inheritance, that's no excuse to push more pensioners into poverty as the temperature plummets.\" During a press conference in Brazil, where the prime minister is currently attending a G20 summit, Sir Keir Starmer was asked about the figures. He said that the state pension would rise by £470 in the spring and that pensioners would be better off. Earlier in the day, Scottish Labour leader Anas Sarwar diverged from Sir Keir by pledging to increase eligibility for pension credit if they formed the next government."
    },
    {
        "url": "https://www.bbc.co.uk/news/business-55992592",
        "headline": "What are cold weather payments and who can get them?",
        "content": "The first cold weather payments have been triggered for winter 2024. Some people in England, Wales and Northern Ireland are entitled to the payout after a prolonged period of below-zero temperatures. In Scotland, those on low incomes and benefits may receive a separate winter heating payment, which does not depend on how low the temperature falls. LIVE: Follow the latest updates as new weather warnings are issued Check the UK weather warnings in place The cold weather payment is a government benefit top-up to help with fuel bills , external . The average temperature in a local area must be zero degrees Celsius - or less - for seven days in a row, or be forecast to be below freezing for seven consecutive days. As at 19 November, the first payments had been triggered in 12 postcode areas in Cumbria, four in Northumberland, and two postcodes in the Scottish Borders which also cover part of England. Only eligible people who live in the English part of the postcode are entitled to a payment. The temperature needs to be recorded by the weather station nearest to your postcode. England and Wales: Enter your postcode here to check eligibility , external Northern Ireland: Enter your postcode here to check eligibility , external Just under 1.2 million payments were made in England and Wales between 1 November 2023 and 31 March 2024 , external after 31 qualifying periods of cold weather. To qualify, you must live in England, Wales or Northern Ireland. Payments are not age-related but you must already be receiving certain benefits, including: , external Pension Credit Income Support income-based Job Seekers' Allowance income-related Employment and Support Allowance Universal Credit - although there are certain exceptions Support for Mortgage Interest Each cold weather payment is paid for a seven-day period and is worth £25. More than one payment will be made during the course of the winter if there are enough periods of cold weather. The scheme runs between 1 November and 31 March each year. Hospital stays can affect payments. You should also tell Jobcentre Plus , external if you have a baby or if a child under five comes to live with you. In Scotland, the winter heating payment is worth £58.75 , external , and will be paid to those who are eligible from December 2024. What does an unheated room do to your body? How to keep warm during cold weather and other winter tips You do not have to do anything in order to get cold weather payments. The money should be paid automatically into the same bank or building society account as your benefits, within two weeks of the qualifying period of cold weather. If you do not receive a payment, you can contact the Pension Service , external or Jobcentre Plus , external . Cold weather payments do not affect other benefits. They are separate to the winter fuel payment , which is worth £200 or £300 depending on your individual circumstances. The rules on this have changed, and 2024 payments will only go to those on low incomes who receive certain benefits, including pension credit . How does the energy price cap work? What can I do if I can't pay my energy bill?"
    },
    {
        "url": "https://www.bbc.com/news/articles/czj71zyy934o",
        "headline": "Thousands of farmers protest against inheritance tax changes",
        "content": "Thousands of people have protested in London over changes to inheritance tax for farmers announced in the Budget. Among those marching in Whitehall was TV presenter Jeremy Clarkson, who said  \"it's the end\" for farmers, as he called for the government to change its mind. Prime Minister Sir Keir Starmer said he understood farmers' concerns and \"wants to support\" them but added \"the vast majority\" would be unaffected. From April 2026, inherited agricultural assets worth more than £1m, which were previously exempt, will be liable to the tax at 20% - half the usual inheritance tax rate. Other allowances could mean a couple who are married or in a civil partnership could pass on a farm worth as much as £3m.  However, many farmers argue that while they are asset rich - for example in terms of their land and livestock - they are cash poor and the changes would mean they would have to sell up to be able to pay the tax. The Metropolitan Police estimated more than 10,000 people took part in the protest to Whitehall. Ahead of the protest, around 1,800 National Farmers' Union (NFU) members met near Parliament as part of a mass lobby of MPs. The group's president, Tom Bradshaw, gave an impassioned speech describing the tax changes as destructive, a \"stab in the back\" for farmers, wrong and unacceptable. He told protesters the changes were the \"straw that broke the camel's back\". Later, speaking to Sky News, he said Labour had \"destroyed\" a \"contract\" between farming and the government dating back to World War Two. \"We'd love to pay more tax,\" Mr Bradshaw added. \"If we get proper margins from food production, and we end up swelling the Treasury coffers, bring it on. \"But at the moment the supply chain doesn't give us those returns that enables us to save the money to pay the inheritance tax that this government now wants to take.\" He added that Environment Secretary Steve Reed said when he was in opposition that Labour would not change agricultural property relief. Government research suggests that an average farm last year made a profit of about £45,300 - although that figure may be overstated as it is based on a survey that excluded farms that bring in the least money. The number of farms that could be affected by the inheritance tax change is also disputed. The government says it will affect the wealthiest 500 estates each year, but the NFU and the Country Land and Business Association (CLA) have estimated up to 70,000 farms could be affected. According to BBC Verify , the largest estimate relates to the total number that could ever be affected. But the number of farms likely to be impacted each year is set to be around 500. Reed told the Commons Rural Affairs Committee on Tuesday that many farmers protesting over the tax changes were \"wrong\" about the policy - and he rejected claims the government had underestimated how many people would be affected. \"Many of them, probably happily, are wrong because there are things that they can do to plan their tax affairs as most businesses or asset owners would do to limit their liability,\" he said. He said: \"The numbers I've heard bandied around are enormous and very, very frightening if people were to believe them.\" He acknowledged the changes would be \"unsettling\" and said he was \"listening\" to concerns, but insisted that most farmers would not face a hike. Among those attending Tuesday's events was Gloucestershire livestock farmer David Barton, who estimates his 400-cattle business - which has been in the family since 1913 - is worth around £5m. Mr Barton is worried the proposed changes to inheritance tax could see his son facing a £800,000 bill and said the Budget \"has just ripped the heart out of us\". He is now considering gifting his estate, which he believes would fall outside of inheritance tax if he does not die within seven years, but feared he was not in a financial position to stop working. Others at the protest said they would have to sell their farms to pay the tax bills. Jen, a seventh-generation farmer from Yorkshire, who did not give her surname, told the PA news agency: \"If the Budget goes through, then that means I won't be able to take her over my family farm because between me and my brother would have to sell up to be able to pay the tax. \"It's something we've both been passionate about from when we were little kids, ever since we could walk, always been involved - it's a lifestyle.\" The 24-year-old said they would have to pay approximately £1.2m. \"We have spoken to our accountant, solicitors, and once something happens to our parents - unless there is some change, unless there's something we can do - then it's not possible for us,\" she said. Jeremy Clarkson, who owns Diddly Squat Farm in Oxfordshire - which features in the Amazon series Clarkson's Farm - said he thought the change to inheritance tax was \"a very rushed last-minute decision\". \"I think we all make mistakes in life, and I think it's time for them to say 'you know what, we've cocked this one up a bit' and back down.\" BBC Newsnight’s Victoria Derbyshire asked Mr Clarkson at the protest about his motivation for attending the rally: “So, it’s not about you, it’s not about your farm and the fact you bought a farm to avoid inheritance tax?” Criticising the question as “Classic BBC\", Mr Clarkson said: \"I wanted to shoot... which comes with the benefit of not having to pay inheritance tax. Now I do. But people like me will simply put it [money] in a trust. \"And so long as I live for seven years, that's fine... But it's incredibly time consuming to have to do that. And why should all these people have to do that? Why should they?” Inheritance tax rules mean the amount people are liable to pay may vary. Speaking to broadcasters from the G20 summit in Rio de Janeiro, the prime minister insisted the \"vast majority\" of farms would be \"unaffected\" by the Budget changes. Sir Keir - who highlighted his childhood growing up in the countryside - said he \"gets\" farmers' concerns and said the government was using the Budget to invest in other areas which affect rural communities, such as hospitals, schools and housing. He said: \"I think it's very important for me to keep making the case that it's only farms and assets over £3m in a typical case of parents wanting to pass on to their children, and therefore, for that reason, I'm confident that the vast majority of farms will not be affected.\" He said £5bn had been pledged over two years \"in farming and food sustainability. That's hugely important for farmers, an additional amount for flooding that impacts them and on disease outbreak\". When asked if the government would reconsider the policy, the prime minister's official spokesperson replied: \"No - we have set out the reasons we have taken this difficult decision and why we believe it's a fair and proportional approach.\"  Shortly before the rally ended, Conservative Party leader Kemi Badenoch took to the stage to loud cheers as she pledged to reverse what she called “the family farms tax”, which she said would \"destroy farming as we know it”. The Liberal Democrats said it was \"utter rubbish\" to say only 500 of the UK's wealthiest farmers' estates would be affected each year. The party's environment spokesman, Tim Farron, told BBC Breakfast: \"The only way that people can pay the inheritance is get rid of the farm - so corporates buy it. \"It's cruel, it's unfair, it's also incredibly stupid\"."
    },
    {
        "url": "https://www.bbc.com/news/articles/c62g03ln7z4o",
        "headline": "Chocolate makers stoke boom for Indian cocoa beans",
        "content": "If it hadn't been for the squirrels, George Matthew's attempt to become a cocoa bean producer might have failed. His farming career began in the 1970s when he inherited a rubber plantation in the the southern Indian state of Kerala , which he managed alongside his career as a doctor. It was a bad time to inherit a rubber plantation, falling rubber prices meant it kept losing money. So, 10 years ago Dr Matthew decided to experiment with cocoa trees, hoping they would generate some funds to support the rest of the farm. He bought some saplings and planted them. It didn't go well. \"It was not that successful - most of the saplings died,\" he says. Squirrels appeared to be making the situation worse by grabbing cocoa bean pods and eating them. But those raids had an unexpected benefit -  cocoa seeds were spread all over the farm. \"All the scattered seeds soon grew in to plants and they were much healthier and stronger than the saplings I had planted,\" says Dr Matthew. \"The trick was in sowing the seeds,\" he realised. Today Mr Matthews has 6,000 cocoa trees on his 50 acres of land. \"I think it was the best decision I have made,\" he says. Despite having several regions with weather conditions suitable for cocoa trees, India only accounts for 1% of the world's cocoa bean production. Global production is currently dominated by West Africa, where Côte d'Ivoire and Ghana between them produce more than half of the world's annual output . Indian growers can only supply a quarter of the beans needed by Indian makers of chocolate and other confectionary. \"The challenge is that it is grown in very fragmented small holdings, so it does not get the kind of attention cocoa should get,\" says Renny Jacob, chairman of India Cocoa, a private company that has been growing and processing cocoa beans for more than 30 years. In particular he says that Indian farmers are poor at handling beans after they have been harvested. Once removed from their pods, beans go through a fermentation process at the farm, which can make a huge difference to their flavour. \"Cocoa fermentation is a critical process in the production of chocolate, transforming raw cocoa beans into a form suitable for chocolate making,\" says Sarin Partrick, chief executive of India Cocoa. \"This complex process involves several stages and the activity of various micro-organisms, which help develop the beans' flavour, aroma, and colour,\" he says. To raise the quantity and quality of cocoa bean production, the government has introduced several initiatives. It is investing in schemes to develop hybrid cocoa plants, that are more productive than existing varieties. In addition there are schemes to train farmers on the latest techniques for growing and processing beans. “There is a vast opportunity for Indian farmers to enter into cocoa cultivation and avail the benefits,\" says Dr Femina, who works in the government department tasked with developing cocoa production. Business is also investing in new cocoa tree vareities. Dr Minimol J.S., is the head of cocoa research at Kerala Agriculture University and is working with Cadbury to develop hybrid cocoa trees. In the project's orchard existing high-performing varieties are cross-bred with exotic species. So far the programme has come up with 15 new varieties. \"These are India's first hybrid, disease-resistant seeds,\" she says. \"The seeds are drought tolerant varieties, and have withstood temperatures of even 40C, which is usually not possible,\" she adds. The hybrids are also much more productive than traditional varieties. \"The global average production is 0.25 kilogram per year per tree. \"In Kerala, we get 2.5 kilograms per year per tree. In Andhra and Telangana, we are even getting a yield of four or five kilograms per tree per year,\" she says. India's production of cocoa beans has risen significantly. This year it hit 110,000 tonnes, up 40% from 2015. But it's still not enough to meet demand from local chocolate and confectionary makers. India's Cocoa Board estimates the demand from industry is rising at 15% per year. Founded in 2019, Kocoatrait is one of a new generation of Indian chocolate makers. Based in the east coast city of Chennai, the company only uses Indian cocoa beans. One reason for that is that locally sourced beans have a much smaller carbon footprint than beans that have been shipped from another continent. In addition, says Kocoatrait founder Nitin Chordia, Indian beans are cheaper than imports and have a distinctive flavour. Mr Chordia also runs an agricultural school, where  farmers are shown the latest innovations in fermenting and drying beans. \"We are constantly focussing on improving the post-harvest practices for cocoa farmers in India,\" he says. He adds that Indian farmers need to be producing higher quality beans. \"We are not able to compete with international players in the bulk cocoa bean segment,” he says. While there has been improvement, Indian producers have some way to go. \"Over the last decade, in the fine-flavour cocoa bean segment, India has started to get noticed... but it will be several years before all Indian fine flavour cocoa beans reach a stage of large-scale international recognition.\" Back in Kerala, Dr Matthew reflects on his decade as a cocoa farmer. \"It's a tricky plant,\" he says. \"Last year I had no yield. So no farmer can depend solely on cocoa - one has to plant other trees along with it.\" Despite the challenges, he's optimistic. \"The future is bright, with huge demand.\" \"I have been approached by a multi-national company to sell my production to them, so I will be making a good profit.”"
    },
    {
        "url": "https://www.bbc.com/news/articles/cy4g193qezno",
        "headline": "Google reacts angrily to report it will have to sell Chrome",
        "content": "Google has said it would harm consumers and businesses if it is forced to sell Chrome, the world's most popular web browser. The US Department of Justice (DOJ) will propose the measure to a judge on Wednesday, Bloomberg has reported . Judge Amit Mehta ruled Google operates an online search monopoly in August , and has been considering what remedies or penalties to impose. The DOJ has not commented on the report - but Google has made clear it is a proposal it opposes. \"The DOJ continues to push a radical agenda that goes far beyond the legal issues in this case,\" said Google executive Lee-Anne Mulholland in a statement. Google will also reportedly be asked to establish new measures around its artificial intelligence, Android operating system and use of data. \"The government putting its thumb on the scale in these ways would harm consumers, developers and American technological leadership at precisely the moment it is most needed,” Ms Mulholland added. Chrome is the most used browser worldwide - with web traffic tracker Similarweb placing its global market share at  64.61% in October. Meanwhile Google search corners an almost 90% share of the global search engine market as of October, according to Statcounter . It is the default engine in Chrome as well as on many smartphone browsers, including Safari on iPhones. Judge Mehta said in his ruling in August that the default search engine was \"extremely valuable real estate\" for Google. \"Even if a new entrant were positioned from a quality standpoint to bid for the default when an agreement expires, such a firm could compete only if it were prepared to pay partners upwards of billions of dollars in revenue share,\" he wrote. The DOJ had been expected to provide its final proposed remedies to the court by Wednesday. It said in an October filing documenting initial proposals it would be considering seeking a break-up of Google. Potential remedies \"that would prevent Google from using products such as Chrome, Play [its app store], and Android to advantage Google search and Google search-related products\" were among its considerations, it said then. Google has previously denied operating a monopoly in online search. In response to the DOJ's filing in October, Google said \"splitting off\" parts of its business like Chrome or Android would \"break them\". \"Breaking them off would change their business models, raise the cost of devices, and undermine Android and Google Play in their robust competition with Apple’s iPhone and App Store,\" the company said. It also said it would make it harder to keep Chrome secure. Revenues from Google's search and advertising businesses rose by 10% to $65.9bn, according to the company's latest quarterly results . Chief executive Sundar Pichai said the company's AI search tools were now being accessed by millions of users. Investors have been keeping a close eye on Google's share price on Tuesday, following reports of the DOJ's proposed remedies."
    },
    {
        "url": "https://www.bbc.com/news/articles/cr5m1gl3drlo",
        "headline": "Mulberry cuts jobs in ‘rebuild’ after poor sales",
        "content": "The boss of luxury retail company Mulberry says he needs to \"rebuild the business\", after sales dropped by almost a fifth in the past six months. The Somerset-based designer company told shareholders group revenues fell by 19% to £56.1m  in the six months prior to 28 September. It added sales were challenging in the face of a \"difficult trading environment and uncertain macroeconomic trends\". Newly appointed CEO, Andrea Baldo, says he has a \"refreshed business strategy\" and has cut 85 roles as part of the shake-up. The cuts, which impact about a quarter of its 350-strong workforce, have predominantly impacted its London design headquarters, as well as some Somerset office workers. Mulberry is among several firms to have been hit hard by a sharp decline in luxury spending worldwide. Revenues from its wholesale and franchise business dropped by 46% to £5.4 million, as it was particularly affected by partners in Italy and Denmark reducing their orders due to tough conditions. Meanwhile, UK revenues fell by 14% to £31.3 million amid \"low consumer confidence\". The company also saw pre-tax losses widen to £15.7 million for the period, compared with a £12.8 million loss a year earlier. It comes a month after Mike Ashley's Frasers Group - which owns a roughly 37% stake in the company - ditched plans for a £111 million takeover offer. Mr Baldo said: \"There is no question that our industry is facing a period of significant uncertainty, driven by a challenging and volatile macroeconomic environment that is impacting consumer confidence in several markets, particularly in our home country. \"However, with the teams' efforts on cost-cutting, a strengthened balance sheet, a renewed brand-first approach and a refreshed business strategy - details of which I'll share in due course - I am confident we are making the right moves to bring Mulberry back to profitability.\" Follow BBC Somerset on Facebook and X . Send your story ideas to us on email or via WhatsApp on 0800 313 4630 ."
    },
    {
        "url": "https://www.bbc.com/news/articles/c7487y7x0vwo",
        "headline": "Popular weight-loss drug Wegovy goes on sale in China",
        "content": "Novo Nordisk has launched its weight-loss drug Wegovy in China after it was approved by local health authorities in June. It is set to intensify competition with rival Eli Lilly, whose popular weight-loss treatment also got the green light months ago but has yet to go on sale in the world's second largest pharmaceutical market. More than 180 million people live with obesity in China, which has a population of 1.4 billion. According to Chinese business news website Yicai, a dose of four Wegovy injections will cost 1,400 yuan (£153; $194), a fraction of the drug's price in the United States. Yicai's report says patients in China will have to pay the full price for the treatment, as the drug has not been included in the national healthcare insurance. Research suggests that Wegovy patients can lose more than 10% of their body weight. In a post on Chinese app, WeChat, Novo Nordisk said its treatment \"will provide a safe and effective weight loss option for overweight and obese patients in China\". Aimed at people who are severely overweight, Wegovy's active ingredient is a medicine called semaglutide, which helps control blood sugar, lowers appetite, and makes patients feel fuller. It is also the active ingredient in sister drug Ozempic, which is used to treat type 2 diabetes. However, there can be side effects for some users, such as nausea and vomiting, and research shows that patients often put weight back on after stopping treatment. Wegovy went on sale in the US in 2021 where a month's supply currently costs $1,349. Fuelled by a social media buzz and celebrity users including Elon Musk, the drug has since been flying off pharmacy shelves around the world. The UK's Medicines and Healthcare products Regulatory Agency has asked doctors to be alert for patients who may be misusing obesity injections , such as Wegovy. It followed reports that some people who were not obese became sick, after using the jabs for weight loss. Wegovy's popularity has turned its maker, Novo Nordisk, into Europe's most valuable company. It currently has a total market value of of more than $440bn."
    },
    {
        "url": "https://www.bbc.com/news/articles/crr91exlwd8o",
        "headline": "Seven-year-old gets job offer from Russian IT firm",
        "content": "A Russian software company has invited a seven-year-old coding prodigy to join its management team, as soon as he is old enough to take up paid employment. Sergey from the Russian city of St Petersburg has built a name for himself, uploading videos that explain how to write software since he was five. On the strength of those videos, the information security firm Pro32 sent him a written job offer, for the post of head of corporate training. Under Russian law, Sergey would not be able to take up any paid role until he is 14. But Pro32's chief executive Igor Mandik told the BBC World Service he had spoken to Sergey's parents about finding ways to collaborate in the meantime. \"His father, Kirill, was surprised and said that [they were] really happy and looking forward [to when] Sergey would be able to join the company,\" Mr Mandik said.  On his videos, Sergey appears fresh-faced and smiling enthusiastically. Speaking in Russian and sometimes in slightly broken English, he goes through coding challenges step-by-step. His YouTube channel has more than 3,500 subscribers, interested in learning programming languages Python and Unity, or who want to hear more about neural networks, which underlie many artificial intelligence tools. Mr Mandik said Sergey showed not only remarkable developer skills but also \"equally unique\" skills in teaching. \"For me, he is kind of a Mozart.\" \"I'm absolutely sure that when he reaches 14, he'll be a guru of teaching and a guru of developing, and that is why we're really looking forward to this time,\" he said. Not just coders, but salesmen, accountants and others at Moscow-based Pro32 could learn from Sergey, Mr Mandik said. No promises have been made over pay, as yet, given that the going rate is likely to change significantly. \"We have to wait for seven years,\" Mr Mandik said. \"Then we will definitely start a conversation about his salary.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cgej0z30yqzo",
        "headline": "British Airways says 'tech issue' resolved after delays",
        "content": "British Airways passengers were left stranded on the tarmac in multiple airports in the UK and internationally after a \"technical issue\" disrupted operations. The problems , which the airline says have now been solved, started at around 17:00 on Monday, with passengers posting on social media that they were standing in the cold waiting to find out what was happening to their flights. BA said a problem that affected some of its computer systems had caused the delays. \"We’ve apologised to customers for delays to their flights and ensured they were able to reach their destinations as planned,\" the airline said in a statement. In an earlier update on the disruption, the company said no flights had been cancelled. Downdetector, a website that logs complaints with websites that are not working, indicated a sharp increase in problems with the BA site after 17:00. It is not clear how widespread the disruption was, but it was reported to have affected flights globally, as well as some domestic UK flights. Travel expert and journalist Simon Calder estimated the problems could have affected tens of thousands of passengers, although the delays seemed to be limited to one or two hours for affected flights. One passenger wrote on X that they were \"being made to stand on the tarmac in a very cold Verona waiting for an already delayed flight\". Travellers in Hamburg, Naples, Lyon and Dusseldorf also reported delays. Others said they were trying to check in for flights and the \"systems are down\" or that technical problems had prevented them from booking flights. Sources within the airline suggest the situation is being brought under control, but there are concerns that delays this evening could have a knock-on effect on Tuesday's flights. Some travellers commenting on social media said they had been told that pilots were unable to generate loading data for their aircraft and have been struggling to get through to colleagues by phone.  A spokesperson for Heathrow Airport said it was aware of the technical problems at BA, but that its own systems were operating normally. It is not the first time BA has faced severe disruption due to an IT failure. In May last year, flights were grounded. A similar thing happened in spring 2017, disrupting Bank Holiday plans, and in February 2020."
    },
    {
        "url": "https://www.bbc.com/news/articles/cn8l5798z95o",
        "headline": "'Holiday lets are pricing us out of homes'",
        "content": "The Derbyshire Dales takes up much of the Peak District National Park, and sits near four major UK cities - Manchester, Sheffield, Derby and Nottingham. Due to its prime location and natural beauty, it has become a popular spot for families, visitors and tourists alike - particularly since the coronavirus pandemic with fewer people travelling abroad. But like residents in Cornwall and Yorkshire , families in this similarly idyllic part of England are struggling to get a foot on the housing ladder, with a rising number of properties being used as second homes and holiday lets. One family told the BBC that the housing shortage - affecting availability and affordability - has pushed them to the point of \"giving up\". The irony is not lost on Dee Goddard, who grew up \"down south\", when she says that she originally moved to the area because \"we thought it would be a cheaper option\". The 31-year-old has lived in the Derbyshire Dales, in the village of Curbar, with her son and husband Baris for a couple of years. Dee and her husband, who both work at the University of Sheffield, currently spend more than 50% of their income on rent and council tax, excluding bills, so saving for the future - as well as finding a suitable home to buy - has proven \"very difficult\". \"We have a one-year-old son, we'd love for him to grow up here, all our friends are here, we're very embedded in the local community, we attend church here, but it's really difficult to find anything that's affordable,\" she says. Dee says before the coronavirus pandemic, it was much easier to find somewhere to raise a family. \"I have notifications on my phone of the properties that become available, and there are just so few,\" she says. \"At the moment it's just impossible - we're being priced out.\" The average house price in the Dales last year was £350,548, according to the UK House Price Index, compared to £270,733 in the neighbouring High Peak, which is also a tourist hotspot. And recent figures from Derbyshire Dales District Council show there were 35,595 residential properties in the area in May 2024. In October, 1,053 of these were second homes, while 1,302 were holiday lets. However, in some villages in the Dales, the Local Democracy Reporting Service (LDRS) says second homes and holiday lets make up a quarter of all residential units. The LDRS also recently quoted a report in The Times and Inside Airbnb, which found the district had one of the strongest concentrations of Airbnbs in the Midlands. Dee says: \"Tourism benefits everyone - there's local jobs promoted by tourism - but at what cost? \"A couple of the houses near us are all holiday homes, so it's really quiet. There aren't people at the play group for me to hang out with, because there aren't people here. \"We have to think about the balance between tourism and people actually living in the villages that give them their soul and heart, because people otherwise are going to be visiting and there will be no village community for them to enjoy.\" She added: \"I think we're at the point of giving up already. It's really sad to think of, because all our friends are here, and you imagine your child going to the school near where you live.\" Three miles away, the head teacher of Eyam CE Primary School - Oona Gilbertson - is concerned about falling pupil numbers in recent years. The school currently has 70 children. She says: \"We get quite a few people who look round the school, who think they are going to move into the local area. \"Then, they cannot find anywhere to rent and certainly cannot find anywhere to buy, and they have to go elsewhere. That makes it difficult to predict how many children we are going to have in the school the following year and that affects the budget.\" While there is clearly an appetite from families to buy, plenty of others want to holiday in the Dales and are looking for places to stay. Among those are self-catered holiday homes, and Justin Heslop - the director of Peak Venues - has about 75 of them across the Peak District. He says: \"The self-catering holiday cottage market is essential to the local economy and area. \"There are thousands of people who come every week, as we know when you're at home, you're not going out to the cafes, pubs, restaurants three or four times a week, but the people that come to holiday cottages do - and I think without those, the businesses would be really struggling.\" Visit Peak District and Derbyshire claims tourism is worth £2.89bn to the Peak District and Derbyshire, supporting 28,000 direct jobs. Speaking about his properties, Justin says his firm's unique selling point is catering for large celebrations. He says: \"We realised that there were some big properties that no-one really wants because of energy costs etc., and if you've got a party for 30 or 40 people, you can't do that in your own home, so I don't think we're necessarily taking houses off the market for the people that need them.\" A number of measures and restrictions have been suggested, including Derbyshire Dales District Council voting to increase council tax for people with second homes - but not holiday cottages. Other restrictions - backed by the previous Conservative government - would make it mandatory for homeowners to apply for planning permission to turn their property into a holiday let. The district council has urged the new Labour administration to bring this legislation to the House of Commons. Meanwhile, Airbnb has also backed proposed rule changes, but claimed travel via the US online rental platform had generated £26m and supported more than 425 jobs in the Dales last year. Justin believes that measures would balance things out. \"A lot of people came into this market in Covid, when there was a lot of demand because people were not going abroad,\" he says. \"With the registration... it needs to be really thought [out] and not us v them, it wants to be people from my industry and people from the authorities looking at what can be done best.\" One district councillor told a recent meeting he was aware of a property owner who spends just two days a year in the area, living the rest of the time in Chicago. Fellow district councillor Peter O'Brien, who represents the Hathersage ward, said the authority had urged the new Labour government and Deputy Prime Minister Angela Rayner - who has the housing brief as part of her portfolio - to bring the previously-proposed legislation into operation. He says: \"At the moment there is no restriction on anyone turning their house into a holiday home or a second home. In places like Eyam, we have got somewhere between 15% and 20% of the dwellings not in permanent habituation.\" He says if people had to apply for planning permission to turn a property into a holiday home, it would \"give control\" to communities to get the right balance between providing accommodation, housing for local people and encouraging tourism. \"Tourism is a vital part of our local economy, but if we let it go too far in that direction, we end up with our communities being hollowed out,\" he says. In a statement to the BBC, the Ministry of Housing, Communities and Local Government said: \"We know large numbers of holiday lets can have significant impacts on areas like Derbyshire. That is why we are introducing a registration scheme for short-term lets and removing tax incentives for landlords to protect communities. \"However, we recognise that more needs to be done, which is why we are considering additional powers for councils to enable them to respond to pressures created by short-term lets.\" In response, Peter O'Brien pledged to continue to press the government to use planning laws to regulate the holiday home industry. For Dee Goddard, she hopes people in the future will not be in her position. \"The holiday homes themselves aren't that bad, it's just the number of them,\" she says. \"The question really is - what do the holiday homes lead to? And if they lead to more empty villages, our schools closing down, then it's not worth it.\" Additional reporting by Eddie Bisknell, Local Democracy Reporter Follow BBC Derby on Facebook , on X , or on Instagram . Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210."
    },
    {
        "url": "https://www.bbc.com/news/articles/cg7g3ykm7p8o",
        "headline": "UK-India trade talks to re-launch in the new year",
        "content": "Free trade talks between India and the UK will be relaunched in the new year, Downing Street has announced. The news comes after Sir Keir Starmer met Indian prime minister Narendra Modi at the G20 summit in Brazil. A post-Brexit deal could unlock valuable markets for British cars, Scottish whisky, and financial services worth billions of pounds, with India on course to become the third largest economy in the world by 2050. However, the UK has been locked in more than a dozen rounds of negotiations since 2022, with key sticking points around relaxing visa rules and lowering fees for Indian students and professionals going to the UK. UK exports to India are worth £16.6 billion and the trading relationship with India was worth £42 billion in the 12 months before June 2024. Sir Keir has been meeting world leaders over the two-day summit of the 20 biggest global economies, and is expected to unveil new trade and industrial strategies in the coming weeks. He said the latest round of talks with India will focus on security, education, technology, and climate change. \"Boosting economic growth is key to improving living standards for working people,\" he said. \"A new trade deal with India will support jobs and prosperity in the UK – and represent a step forward in our mission to deliver growth and opportunity across our country.\" Business and trade secretary Jonathan Reynolds described India as a \"vital trading partner\" and said he believed there is \"a good deal to be done here\" for both sides. \"Whether it's lowering Indian tariffs to help British firms export to this dynamic market or boosting investment which already supports over 600,000 jobs across both countries, striking a deal is important to deliver this Government's core mission of driving economic growth,\" he said. The Labour government has been negotiating with Switzerland, South Korea and the Gulf Cooperation Council since their election victory in July. The UK will also join trade talks for the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) in mid-December."
    },
    {
        "url": "https://www.bbc.com/news/articles/cqjrpv218r0o",
        "headline": "Lenders reject homes with spray foam insulation",
        "content": "Homeowners with spray foam insulation are struggling to sell or remortgage as some major lenders are rejecting properties with it fitted, the BBC has found. A quarter of the UK's biggest mortgage providers will not lend against homes with spray foam in the roof, our research suggests. It is estimated as many as 250,000 homes in the UK have this type of insulation, with much of it installed under the previous government's Green Homes Grant scheme. \"We were blissfully unaware of any issues to do with it until we put the house on the market,\" said Wendy Rowe, whose family struggled to sell her late father’s home and paid thousands to have the insulation removed. Some mortgage firms are reluctant to deal with homes with spray foam insulation due to concerns over poor fitting leaving moisture trapped and roof timbers at risk of decay. But the Insulation Manufacturers Association said spray foam can be beneficial if properly installed, and it was worried homeowners could be needlessly driven to \"cowboy\" removals companies. Ms Rowe told the BBC that when her father Alan Chawner was offered spray foam insulation in his loft, he thought it would make his ex-council property in Leicester  warmer and cut his energy bills. As a pensioner who claimed the attendance allowance, the entire £4,331 cost of the  installation was covered by the Green Homes Grant scheme, which ran in England until 31 March 2021. However, the work was not up to scratch, according to a report by Stephen Hodgson, the former boss of the Property Care Association (PCA) who now inspects properties with spray foam and trains surveyors. After sales stalled and difficult conversations with lenders, Ms Rowe agreed to replace the roof entirely, splitting the cost of nearly £10,000 with new buyers. She said it has cost the family thousands more in surveyors' and administration fees and utility bills. The firm that installed the spray foam, SealSixty, gave the family £400 as a gesture of goodwill and said the work met all the requirements set out by the Green Homes Grant scheme at the time. Ms Rowe said that her family had been \"left high and dry\". \"It was installed under a government initiative, and you really don’t expect them to turn their back,\" she said. Spray foam insulation has been used to stop heat escaping from roofs, lofts and attics for decades and comes in two forms. Closed cell spray foam is rigid once set. It is a better thermal insulator and was previously sold to stabilise failing roofs. But if it has been used inappropriately or installed poorly, it might put stress on timbers, restrict air circulation and put them at risk of decaying. Open cell spray foam remains soft once set and is only used for insulation. It is more breathable but is often installed where a highly-resistant underlay like bitumen felt is already present, stopping vapour from escaping. While a recent report by the Health and Safety Executive highlighted situations where using open cell was low-risk, it cautioned against applying it directly to roof tiles. The nature of spray foam can make it tricky for valuers acting on behalf of lenders to inspect the condition of roof timbers. When the BBC contacted the 20 largest lenders in the UK , five of them, TSB Bank , Skipton Building Society , Co-operative Bank, Principality and equity release lender Aviva - said they did not lend against properties where spray foam is found in the roof space. The Yorkshire Building Society and Metro Bank said they would not usually lend where there is a significant amount of spray foam. Equity release provider More 2 Life told the BBC it will only lend on properties with spray foam where it was fitted as part of an authorised new build and has the necessary documentation. Other lenders such as Lloyds , Nationwide , Barclays , the NatWest Group and Santander have said they consider applications on a case-by-case basis, and will take a valuer's report into account. They may, however, ask homeowners for documentation showing it has been installed correctly or for a specialist report to be carried out. In 2023, the PCA published an inspection protocol in a bid to help surveyors and lenders assess any potential risk in pitched roofs. But homeowners like Gary Wright feel like they have been \"left in limbo\". When his two-year fixed-rate mortgage was up for renewal, he hoped to find a better rate. But when he applied he was shocked to discover open cell spray foam had been installed in 2009. It had not come up during surveys when he had bought the house. He decided to remove most of the foam in the loft himself, after receiving several expensive quotes. A surveyor still recommended a full roof report and Mr Wright felt he had to renew his mortgage with his current lender at a less preferable rate. \"We know that in the next two years, we need to get this fixed, and I can’t afford to right now,\" he said. \"This phrase 'spray foam' has created fear [among lenders] based on a lack of knowledge,\" Simon Storer, chief executive of the Insulation Manufacturers Association, told the BBC. He suggested \"hares were set running\" by previous industry guidance that has since been withdrawn. \"Insulating is a very good thing,\" he said, adding: \"But as with any building work, it needs to be done correctly\". He said the organisation was also concerned about unregulated companies targeting older, potentially vulnerable, homeowners pushing them to pay for an overpriced removal service during cold calls. The Homeowners Alliance (HOA) does not recommend installing spray foam until issues with lenders and rogue traders are resolved. For homes where it is already present, the HOA recommends : A government spokesperson said it had \"consulted lenders about this matter who say they rely on the views of valuers and surveyors on this issue\". They added any measures fitted under government schemes must be done by a Trustmark-registered installer \"to the highest standards with issues promptly and properly rectified\". Further information on Trustmark's dispute resolution process can be found here."
    },
    {
        "url": "https://www.bbc.com/news/articles/cly2xdyexkdo",
        "headline": "High energy prices predicted to be 'the new normal'",
        "content": "High domestic energy prices are likely to be \"the new normal\" with a slight rise predicted for January, according to consultancy Cornwall Insight. A home using a typical amount of gas and electricity will pay £1,736 annually from the new year, according to the forecaster. That would be a rise of £19 a year, a 1% increase, compared with the current typical annual bill of £1,717, it said, with little chance of a big drop in the foreseeable future. Energy regulator Ofgem will announce the next official quarterly price cap on Friday, with some charities concerned about how less well-off households will cope during the colder months. The energy cap limits the maximum price that can be charged for each unit of gas and electricity, rather than the total bill. This means people in larger properties will tend to pay more overall owing to higher energy usage, and those in smaller properties tend to pay less. The energy watchdog Ofgem's price cap affects about 27 million households in England, Wales and Scotland. Different rules apply in Northern Ireland. Dr Craig Lowrey, principal consultant at Cornwall Insight, said that while bills will remain \"largely unchanged\" from October, the news that prices will not drop after rises were seen in the autumn will still be \"disappointing\" for many. \"What we've been looking at were prices well above the historic norms,\" he told the  BBC's Today programme. He added that there \"doesn't seem to be any sign of a return to pre-energy crisis levels\". Prices jumped in 2022 when the conflict between Russia and Ukraine broke out. The consultancy, which is held in high regard for its accurate predictions, also expects that prices will remain higher due to geopolitical tensions, bad weather and maintenance taking place on Norwegian gas infrastructure. The market is still \"very sensitive\" to global events, it said. Peter Smith, director of policy at the National Energy Action charity, said that many people were already \"rationing their energy use\" or building up debt to try to keep warm. \"With increased wholesale prices in the last few months, there won't be any let up in the unaffordable cost of energy,\" he said. Further ahead, Cornwall Insight anticipates the energy price cap will drop slightly in April 2025 and again in October 2025. It suggested that it may still be important for the government to consider \"ways to protect the vulnerable\" from higher energy bills, such as social tariffs. The new Labour government has faced criticism for its decision to withdraw the winter fuel payment for millions of pensioners. At Chancellor Rachel Reeves' first Budget, it was confirmed that future payments would only be made to those getting pension credit or other means-tested help. The government has said the move was necessary in order to address what it has called a financial \"black hole\" it inherited from the Conservatives. But other politicians and unions have warned that older or vulnerable people with disabilities could risk their health by cutting back on heating their homes as a result. In Scotland, a couple has been given permission to proceed with their own legal challenge against both the UK and Scottish governments over the changes to the benefit.  Read more here on five ways to cut costs this winter. Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It’ll be delivered straight to your inbox every weekday."
    },
    {
        "url": "https://www.bbc.com/news/articles/cly209lyx3ro",
        "headline": "Spirit Airlines files for bankruptcy protection",
        "content": "US budget carrier Spirit Airlines has filed for bankruptcy protection after a long run of financial losses and a series of failed merger attempts. On Monday, the Florida-based airline said it had arranged an agreement to restructure its debt and raise money during a bankruptcy process that is expected to last until early 2025. During that time, Spirit's operations will continue as normal and passengers will be unaffected, it said. Spirit, which has not recorded a full-year profit since the start of the Covid-19 pandemic, is the first US airline to file for bankruptcy in more than a decade. American Airlines declared bankruptcy in 2011 to cut labour costs during a period of high fuel prices.  In a statement, Spirit said the bankruptcy process - known as Chapter 11 - will not impact employee pay or payments to aircraft leasing companies. The company will be de-listed from the New York Stock Exchange in the \"near term\" and stock shares will be cancelled, with no value, as part of its restructuring, Spirit said. Despite strong demand, the no-frills airline posted losses of approximately $360m (£285m) in the first half of this year. Competition in the budget travel market has been rising and Spirit has also been forced to ground aircraft as a result of mechanical issues with some engines, which drove up operating costs. Earlier this year, Spirit's highly anticipated $3.8bn ($3bn) merger with another US carrier, JetBlue, collapsed.  A Massachusetts judge blocked the deal, arguing that a merger would reduce competition in the market. Another attempt to merge, with Frontier Airlines in 2022, fell apart after Spirit was outbid by JetBlue. Originally a long-haul trucking company founded in 1964, which pivoted to aviation in the early 1980s,  the firm rebranded as Spirit in 1992. It is considered a pioneer in budget flying, forgoing many amenities that are standard on other airlines in order to keep ticket prices low."
    },
    {
        "url": "https://www.bbc.com/news/articles/c9wrqg4vd2qo",
        "headline": "Roblox to ban young children from messaging others",
        "content": "Roblox has announced it will block under-13s from messaging others on the online gaming platform as part of new efforts to safeguard children. Child users will not be able to send direct messages within games by default unless a verified parent or guardian gives them permission. Parents will also be able to view and manage their child's account, including seeing their list of online friends, and setting daily limits on their play time. Roblox is the most popular gaming platform for eight to 12 year olds in the UK, according to Ofcom research, but it has been urged to make its experiences safer for children. The company said it would begin rolling out the changes from Monday, and they will be fully implemented by the end of March 2025. It means young children will still be able to access public conversations seen by everyone in games - so they can still talk to their friends - but cannot have private conversations without parental consent. Matt Kaufman, Roblox's chief safety officer, said the game is played by 88 million people each day, and over 10% of its total employees - equating to thousands of people - work on the platform's safety features. \"As our platform has grown in scale, we have always recognised that our approach to safety must evolve with it,\" he said. Besides banning children from sending direct messages (DMs) across the platform, it will give parents more ways to easily see and manage their child's activity. Parents and guardians must verify their identity and age with a form of government-issued ID or a credit card in order to access parental permissions for their child, via their own linked account. But Mr Kaufman acknowledged identity verification is a challenge being faced by a lot of tech companies, and called on parents to make sure a child has the correct age on their account. \"Our goal is to keep all users safe, no matter what age they are,\" he said. \"We encourage parents to be working with their kids to create accounts and hopefully ensure that their kids are using their accurate age when they sign up.\" Richard Collard, associate head of policy for child safety online at UK children's charity the NSPCC, called the changes “a positive step in the right direction\". But he said they need to be supported by effective ways of checking and verifying user age in order to \"translate into safer experiences for children\". \"Roblox must make this a priority to robustly tackle the harm taking place on their site and protect young children,\" he added. Roblox also announced it planned to simplify descriptions for content on the platform. It is replacing age recommendations for certain games and experiences to \"content labels\" that simply outline the nature of the game. It said this meant parents could make decisions based on the maturity of their child, rather than their age. These range from \"minimal\", potentially including occasional mild violence or fear, to \"restricted\" - potentially containing more mature content such as strong violence, language or lots of realistic blood. By default, Roblox users under the age of nine will only be able to access \"minimal\" or \"mild\" experiences - but parents can allow them to play \"moderate\" games by giving consent. But users cannot access \"restricted\" games until they are at least 17-years-old and have used the platform's tools to verify their age. It follows an announcement in November that Roblox would be barring under-13s from \"social hangouts\" , where players can communicate with each other using text or voice messages, from Monday. It also told developers that from 3 December, Roblox game creators would need to specify whether their games are suitable for children and block games for under-13s that do not provide this information. The changes come as platforms accessed and used by children in the UK prepare to meet new rules around illegal and harmful material on their platforms under the Online Safety Act. Ofcom, the UK watchdog enforcing the law, has warned that companies will face punishments if they fail to keep children safe on their platforms . It will publish its codes of practice for companies to abide by in December."
    },
    {
        "url": "https://www.bbc.com/news/articles/cz6je5w7n3yo",
        "headline": "EV targets 'will not be weakened' despite pressure",
        "content": "Rules on the percentage of electric vehicles (EVs) car firms must sell will not be weakened, the transport secretary has said, despite growing pressure from the industry. The mandate will become tougher next year ahead of a complete ban on new diesel and petrol cars in 2035, but car makers have suggested the rules could threaten jobs. Several senior government ministers and car makers with factories in the UK will hold crunch talks this week about the EV mandate and the slump in car demand. Louise Haigh said she will look at \"flexibilities\", but insisted that \"the mandate will not be weakened\". \"There has been a downturn in demand on a global level so we are absolutely in listening mode - we want to discuss how the current situation is affecting them, but we are not diluting our ambition,\" the transport secretary told LBC Radio on Sunday. \"I’m meeting with Nissan tomorrow and the business secretary, the energy minister and I are meeting with a number of automotive manufacturers later in the week in order to discuss the challenges that they face on a global scale.\" According to the mandate, EVs must make up 22% of a firm's car sales and 10% of their van sales this year. For every car sale that pushes it outside of that mandate, they must pay a £15,000 fine. There are some existing workarounds in the rules allowing firms to avoid the fines. They can, for example, buy credits from companies which have EV sales above 22% of their total sales. \"There are flexibilities available to them in the current mandate,\" Haigh told LBC. \"We want to make sure that the flexibilities are appropriate for them... but we absolutely don’t water down our ambition.\" The rules get tougher every year ahead of a complete ban of new petrol and diesel car sales by 2035, though Labour said in its manifesto it would bring this forward to 2030 - reinstating the old target - as part of its wider commitments to climate change policy. The trade association, Society of Motor Manufacturers and Traders (SMMT), has said the industry \"will likely miss\" this year's targets - calculating that around 18% of UK car sales are currently EVs. SMMT and car makers say they support the government's long-term aims, but they are looking for some concessions in this week's talks. One suggestion is that the penalties car makers have to pay for missing the targets should be reduced, the BBC understands. Meanwhile, the SMMT is calling for government grants for buyers of EVs and tax changes. It says changes are needed to deal with the plummet in demand, with its data showing that new car registrations in the UK remain a fifth lower than pre-Covid. A Nissan spokesperson told the BBC it is “committed to playing a full role in the transition to net zero in the UK\", but said \"changes are required now to reflect the reality of the market, as we continue to work together to encourage more drivers to make the switch”. A spokesperson for Stellantis - which owns Citroën, Peugeot, Vauxhall and several other car brands - said it is aligned with the objectives of the mandate. But it added: \"To remain efficient in the UK, we are strategically reviewing our operations working with our union partners as previously announced.\" In April, Stellantis chief executive Carlos Tavares told The Telegraph newspaper the rules were \"terrible\" and that it could force the car maker to reduce its presence in the UK. The Unite union has urged the company to commit to its future at its Luton and Ellesmere Port factories to address the \"fear and rumour\" it has created through announcing the strategic review. Unite added it is \"already having constructive discussions with government and industry to reform the EV mandate to protect jobs\"."
    },
    {
        "url": "https://www.bbc.com/news/articles/cd7n3dp10w5o",
        "headline": "Who wins when Nigeria's richest man takes on the 'oil mafia'?",
        "content": "Petrol production at Nigerian business tycoon Aliko Dangote’s $20bn (£15.5bn) state-of-the-art oil refinery ought to be some of the best business news Nigeria has had in years. But many Nigerians will judge its success on two key questions - firstly: \"Will I get cheaper petrol?\" Sorry, but probably no - unless the international price of crude drops. And secondly: \"Will I still have to spend hours watching my hair turn grey in a hypertension-inducing fuel queue?\" Hopefully those days are gone but it might partly depend on the behaviour of what Mr Dangote calls \"the oil mafia\". For much of the time since oil was first discovered in Nigeria in 1956, the downstream sector, which includes the stage when crude is refined into petrol and other products, has been a cesspit of shady deals with successive governments heavily involved. It has always been impossible to follow the money, but you know there is something dreadfully wrong when the headline \"Nigeria’s state-owned oil firm fails to pay $16bn in oil revenues\", pops up on your news feed, as it did in 2016. It is only in the last five years that the state-owned Nigerian National Petroleum Company (NNPC) has been publishing accounts. The Africa head at the Eurasia Group think-tank, Amaka Anku, hails the Dangote refinery, in which the NNPC has a 7% stake, as \"a very significant moment\" for the West African state. \"What you had in the downstream sector was an inefficient, corrupt monopoly,\" she says. \"What the local refinery allows you to do is have a truly competitive downstream sector with multiple players who will be more efficient, profit making and they’ll pay taxes.\" To put it bluntly, the population of this oil-rich nation has been conned on a colossal scale for many years. Oil revenue accounts for nearly 90% of Nigeria’s export earnings but a relatively small number of business people and politicians have gorged themselves on the oil wealth. Aspects of the business model have been baffling, including that of Nigeria’s four previously existing oil refineries. Built in the 1960s, 70s and 80s, they have fallen into disrepair. Last year Nigeria’s parliament reported that over the previous decade the state had spent a staggering $25bn trying and failing to fix the moribund facilities. So Africa’s largest oil producer has been exporting its crude which is then refined abroad, much to the delight of some well-connected traders. It would be like a bakery with a broken oven. But rather than fix it, the owner sends balls of dough to another firm that shoves them in a working oven and sells the loaves back to the baker. The NNPC swaps Nigeria’s crude oil for the refined products, including petrol, which are shipped back home. Exactly how much money changes hands and who benefits from these \"oil swaps\" is just one of the unknowns in these deals. \"No-one has been able to nail down who exactly has benefited. It’s almost like a beer parlour gossip about who is getting what,\" says Toyin Akinosho of the Africa Oil+Gas Report. The NNPC began subsidising the price of petrol in the 1970s to cushion the blow when global prices soared. Every year it clawed this money back by depositing lower royalty payments - the money it received for every barrel pumped out of the ground - with the Nigerian treasury. In 2022 the subsidy cost the government $10bn, more than 40% of the total money it collected in taxes. On his second day in office Nigeria’s Vice-President Kashim Shettima referred to \"the fuel subsidy scam\" being \"an albatross around the neck of the economy\". Nigerian oil expert Kelvin Emmanuel says in 2019 the country’s official petrol consumption \"jumped by 284% to 70m litres per day without empirical evidence to justify such a sharp increase in demand\". Parliament has previously reported that - at least on paper - importers were being paid to bring in far more petrol than the country consumed. There was a lot of money to be made exporting some of the subsidised petrol to neighbouring countries where prices were far higher. The NNPC earned billions of dollars a year from the crude oil production. But for many years, under previous governments, some of its profits never reached the treasury as it was accused by state governors and federal lawmakers of including these inflated subsidy costs on its balance sheet. The NNPC did not respond to a request for an interview or a response to these allegations but in June denied it had ever \"inflated its subsidy claims with the federal government\". It may have been the main source of revenue for successive governments but for decades, until 2020, the board did not disclose its audited accounts. Its press release from March this year promised more transparency and accountability. After coming to power in May 2023, President Bola Tinubu said the subsidy was unsustainable and suddenly cut it - pump prices immediately tripled. He also stopped the policy of artificially propping up the value of the local currency, the naira, and let market forces determine its value. When he took over, the exchange rate was 460 naira to the US dollar. In November 2024 it was over 1,600. The triple shock of higher fuel prices, sporadic shortages of supply and a depreciating currency has been a tough body blow for people across the country, many of whom are forced to run generators to keep the lights on and phones charged. \"Beyond the financial burden, the uncertainty and stress of constantly dealing with fuel shortages have added a layer of anxiety to everyday tasks,\" is how one Lagos resident summed it up. \"I feel like I’m always navigating through crisis mode. It’s exhausting.\" As the naira plunged and pump prices increased several times, the government, aware of the potential danger of protests, continued to pipette some medicine to the masses. In a move which could be likened to swallowing half a paracetamol for acute appendicitis, the government made sure people were paying slightly less than the market rate for a litre of petrol. In other words, the NNPC was selling at a loss and the subsidy was still alive. But with two recent increases in October, Nigerians are now paying market prices for fuel for the first time in three decades. In the main city Lagos it went up from 858 naira ($0.52) to 1,025 naira per litre. One of the major factors in Nigeria’s economic crisis has been a limited supply of foreign currency. The country does not export enough products and services to bring in the dollars. But lots of people, including fuel traders, have been chasing the same limited supply of foreign currency, which leads to the naira losing even more value. The good news is that Mr Dangote’s facility is going to buy crude and sell refined fuels in Nigeria in the local currency, which will leave more dollars available for everyone else. The bad news for those hoping this will mean cheaper fuel is that the price Mr Dangote pays for a barrel of local crude will still be the naira equivalent of the international cost in dollars. So if the price of crude goes up on the world market, Nigerians will still be forced to fork out more naira. Refining locally will mean less freight costs but that’s a relatively small saving. It is hoped that the arrival of Mr Dangote’s oil refinery will help bring a measure of transparency to the sector. He knew he would be upsetting some of those who benefit from the murky status quo when the $20bn project began. But, he says, he underestimated the challenge. \"I knew there would be a fight. But I didn’t know that the mafia in oil, they are stronger than the mafia in drugs,\" Mr Dangote told an investment conference in June. \"They don’t want the trade to stop. It’s a cartel. Dangote comes along and he’s going to disrupt them entirely. Their business is at risk,” says Mr Emmanuel, the oil expert. The fact that there have been some public disagreements with the regulator has only fuelled that suspicion. Mr Dangote’s refinery near Lagos is thirsty, with a capacity of 650,000 barrels of crude a day. You would have thought being located in Nigeria would make supply easy but then up pops this headline: \"Nigeria’s Dangote buys Brazilian crude\". It follows a row over supply and pricing. The regulatory authority has complained about Mr Dangote’s negotiating tactics. Nigeria’s crude oil is low in sulphur and, as one of the most prized in the world, fetches a higher price than many of its competitors. When discussions over price began, Farouk Ahmed, the chief executive of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), accused Mr Dangote of \"wanting a Lamborghini for the price of a Toyota\". Mr Dangote has complained of not being allocated as much crude as earlier agreed but even when the price issue is resolved, he will still need to import some crude. “NNPC doesn’t have enough crude for Dangote. Despite all this instruction to give ample supply of crude to the refinery, NNPC can’t supply Dangote with more than 300,000 barrels per day,\" says Mr Akinosho of the Africa Oil+Gas Report. He says this is partly because the NNPC has pre-sold millions of barrels of oil for loans. In August 2023 it secured a $3bn loan from the Afreximbank financial institution. In return it is due to supply 164 million barrels of crude. In September the NNPC admitted it was significantly in debt. It was reported to be owing its suppliers around $6bn for fuel brought into the country. Nigeria’s oil production has plummeted in recent years from around 2.1 million barrels per day in 2018 to around 1.3 million barrels per day in 2023. The NNPC has been stressing oil theft as the number one reason why production has dropped. It says in just one week - from 28 September to 4 October - there were 161 incidents of oil theft across the Niger Delta and 45 illegal refineries were \"discovered\". But Ms Anku believes that \"the theft problem is overrated by the NNPC and the oil sector\". \"It’s a convenient excuse,” she adds. She points to other contributing factors causing the drop in production, including international oil companies selling their on-shore oil fields - some of which may no longer be viable having pumped oil for 60 years. The 66-year-old Dangote, who is listed by the Bloomberg Billionaires Index as the second wealthiest person in Africa , made his fortune in cement and sugar. He has always denied the suggestion that his empire benefitted from links to politicians in power who helped ensure he had a monopoly. Today there are those who are critical of Mr Dangote’s tactics and amid tension with the regulatory authorities, the same accusation has resurfaced when it comes to the supply of fuel in Nigeria. \"Mr Dangote asked me to stop issuing licences for importation and that everyone should buy from him. To which I said 'No' because it’s not good for the market. We have energy security interests,\" says Mr Ahmed of the regulatory authority. Mr Dangote has not commented on the accusation but has said it makes business sense for the traders to buy from his refinery rather than from outside. A feud between the regulator and Mr Dangote over supplies and pricing has rumbled on and morphed into another row with local fuel traders refusing to buy from the new refinery. The mud slinging has also included allegations that some traders have been buying up substandard fuel from Russia which is then blended with other products before being shipped into Nigeria. But not everyone is worried or surprised by the disagreements. Ms Anku points to lessons learnt from US businessmen back in the 19th Century. \"The JP Morgans and the Stanfords – they didn’t have it easy either. That’s why they had to go and get government support and subsidies to build their railways and so on. \"I see the drama as a very normal process as you’re changing the structure of the economy. There are losers, they lash out. There’s no chance they’ll stop the refinery from working or selling its products to the Nigerian markets… in my view.\" The modern, local refinery has also led to a debate over the quality of fuel on the market. It is an important issue given the vast number of generators belching out fumes across Nigeria as a result of the woeful power supply. \"Every day I wake up to the smell of what I’m sure [could] kill me. It’s because of the quality of the diesel,\" says Mr Akinosho. He sees Mr Dangote’s refinery as a real opportunity for higher quality petroleum products in Nigeria which would be better for both car engines and people’s lungs. But right now, Nigerians being hit hard in the pocket may find it difficult to be optimistic. Arguments between officials at the Dangote refinery, the oil marketers and the regulators are batted back and forth in the media. All sides have been accused of hiding some facts and figures which leaves people guessing what is going on inside this still somewhat opaque industry. \"Everyone is a villain. There are no heroes here,\" concludes Mr Akinosho. Go to BBCAfrica.com for more news from the African continent.  Follow us on Twitter @BBCAfrica , on Facebook at BBC Africa or on Instagram at bbcafrica"
    },
    {
        "url": "https://www.bbc.com/news/articles/cdd0nzv6v1no",
        "headline": "UK Pizza Hut to raise funds after Budget tax hikes",
        "content": "The operator of Pizza Hut's restaurants in the UK is looking to raise more than £10m to help it cope with increased costs after tax rises on business were announced in last month's Budget. The money could come from a sale of part of the business, or new investment from existing shareholders. It comes amid growing backlash from business owners who warn rises in employers' national insurance contributions and the National Living Wage will push up costs for business which employ lots of low-wage workers. Heart With Smart (HWS) - which operates all 140 UK dine-in Pizza Hut restaurants - will use the money on new technology including touch-screen ordering kiosks and contactless table ordering. The new features would allow restaurants to save money by operating with fewer staff and are already being trialled successfully in some Pizza Hut outlets, a company insider told the BBC. They said it would result in reduced staff levels, but the store does not expect a major redundancy programme. From April 2025 the rate of employers’ national insurance contributions, which are paid by businesses on top of workers’ salaries, will rise from 13.8% to 15%, and the level where contributions start will fall to £5,000. Combined with a 6.7% increase in the National Living Wage and an even bigger rise for 18 to 20-year-olds, HWS expects to see its labour costs rise £4m, or about 14%, next year. Chancellor Rachel Reeves has previously said businesses \"will have to absorb\" some of these costs through their profits. In a letter with over 200 signatories, hospitality bosses last week told the chancellor the industry was disproportionately impacted by the \"unsustainable\" tax hike. They warned this would \"unquestionably\" cause closures and job losses. A number of businesses, including Sainsbury's, M&S, BT, Wetherspoons, Fullers and JD Sports have also hinted or warned that they may have to pass some of those extra costs on to customers by increasing prices. But HWS feels it has limited ability to do this as customers may not accept higher prices, the insider told the BBC. They said that the decision to raise the extra money is not just the result of Budget measures introduced last month. It is the effect of the changes on top of five difficult years for the restaurant business, following the pandemic, the cost-of-living crisis and labour costs which are already rising. The advisory firm Interpath has been hired to run the fundraising process, which was first reported by Sky News. Interpath has declined to comment. Asked about the impact of its tax rises on businesses, a government spokesperson said it \"had to make difficult choices... to restore desperately needed economic stability\"."
    },
    {
        "url": "https://www.bbc.com/news/articles/c8xpyg2lr28o",
        "headline": "'Record breaking' 60m homes watched Tyson vs Paul fight, Netflix says",
        "content": "Netflix says 60 million households worldwide tuned in live to see Mike Tyson take on Jake Paul, in the streaming giant's first foray into live boxing. The event, which was free for subscribers, is being hailed by the tech giant as a \"record breaking night\". However, fans hoping to watch have expressed their anger and disappointment after some reported Netflix crashed repeatedly throughout the fight. But there was also criticism from those who were able to tune in, with many saying they found the boxing match lacklustre . In the bout, which took place at the AT&T Stadium in Texas, former world heavyweight champion Tyson, 58, was beaten by YouTuber-turned-fighter Paul, 27 . The fight attracted a huge amount of media coverage. Tyson is one of the most famous boxers on the planet, while Paul drew in a younger audience. There was a star-studded ringside audience including Charlize Theron, Ralph Macchio, Joe Jonas and Hasan Minhaj. Paul says 120 million viewers watched it live globally on Netflix, while the tech firm later stated \"60 million households\" around the world tuned in. It said it will reveal further viewing figures early next week. But some viewers reported experiencing buffering issues on the site, and some said they simply couldn't get onto it. The fight was \"unwatchable,\" wrote one X user. Another said she was \"furious\" , while a third complained he \"did an all-nighter for nothing\" . Netflix declined to comment on the technical glitches. Brendan Ashford, who lives in Devon, told BBC News he stayed up late to watch the fight, which took place in the early hours of Saturday morning UK time. \"I was interested to see how Mike Tyson, at 58, would perform against a much younger guy,\" he said. \"I'm not in the habit of staying up late, but I thought it was worth it.\" He tried signing in on Netflix at around 04:00 GMT, and says initially it loaded 25%, and then it got to 75%, but after that it got stuck. \"I knew I had a good connection, so then I looked on social media and saw others were also experiencing issues,\" he said. \"It was really disappointing. I kept trying for a good hour before I gave up.\" Mr Ashford said it made him wonder how Netflix would fare with future live sports events, given the problems people encountered this time. \"It can't be good for their reputation,\" he said. On social media, there was a similar reaction from fans, who vented their frustrations. Many also posted pictures and videos of the fight failing to load, while some said the service failed at the key moments during the event. \"Had all my friends over to watch the Tyson vs. Paul fight. Not loading,\" wrote one X user . \"Shame on Netflix for not being able to handle the streaming of the Mike Tyson vs Jake Paul fight,\" wrote another . \"The lagging is so bad the fights are unwatchable to long time subscribers like me and other people I know at home with friends, family, snacks, and drinks but no fights.\" Another person simply asked, \"did Netflix not have enough time to prepare for the Tyson / Paul fight?\" This isn't the first time Netflix has had issues with live streaming. Last year, it apologised after a much-publicised livestream of its hit dating show, the Love is Blind reunion, was delayed due to a glitch. The technical reason for the delay was unclear but the streaming giant said it was \"incredibly sorry\". No reason has been given for these latest issues, but Chris Stokel-Walker, a tech reporter, said that the huge demand to watch the fight was \"Netflix's undoing\". \"Netflix has done live broadcasting before,\" he said. \"What's different, was that this fight was so hyped. \"There were so many viewers that were wanting to watch this, given the personalities involved - Jake Paul with his huge following, Mike Tyson returning to the ring for the first time in decades. \"Even people who aren't major boxing fans wanted to tune in because of all the coverage. \"As a result, there was additional demand well above and beyond your average live event, like a comedy special, or the live golf tournament they previously broadcast.\" Mr Stokel-Walker said that with Netflix intending to move towards more live sports in future, including a new deal with WWE from next year, it \"needs to get this fixed\". \"They have to expect that if they're going to get into this world, they're going to have to get used to this volume of people coming,\" he said. \"The Tyson vs Paul fight was one of the most high profile examples of an event they’ve done live, so it's really not ideal. \"People will be watching this and wondering can they cope.\" Additional reporting by Emma Pengelly."
    },
    {
        "url": "https://www.bbc.com/news/articles/c86qy500545o",
        "headline": "'London-style' bus services promised for England with £1bn boost",
        "content": "Almost £1bn in funding will go to delivering London-style buses across England as part of a massive Budget boost, the government has promised. The Department for Transport (DfT) has given more details on its plans for 2025 after announcing the funding last month. It has promised to deliver what it calls \"London-style\" services to every corner of the country, and said funding would be allocated based on levels of deprivation and population, instead of making areas compete for investment as it has in previous years. The DfT says Leicester, the Isle of Wight, Torbay, Southend, Cambridgeshire and Peterborough are set to receive \"unprecedented\" levels of funding. In urban areas, some of the biggest allocations are being given to combined authorities representing South Yorkshire and the Liverpool City Region. In total, there will be £712m for local authorities to improve services, alongside a further £243m for bus operators. About 3.4 million people in England travel regularly by bus, making it the most commonly used mode of public transport. Local authorities in all English regions will be able to introduce new bus routes, make services more frequent and protect crucial routes, the DfT says. It added the money will allow more urban areas to maintain high levels of service. Meanwhile, rural communities and small towns will be able to offer more services. Transport Secretary Louise Haigh told the BBC's Sunday with Laura Kuenssberg programme the funding would \"vastly improve\" the reliability and frequency of services, particularly in rural areas. The announcement comes ahead of the Buses Bill, which aims to give local transport authorities across England new powers to take control of bus services. Under the plans, local authorities would be allowed to introduce a London-style franchising system, meaning they can decide routes, timetables and fares, with operators bidding to run the services for a fixed fee. The government has also pledged to remove a ban on publicly owned bus companies. An extra £151m will  also fund a cap in single bus fares outside London, which rose to £3 last month, until the end of 2025 . The Liberal Democrats have called for the government to U-turn on the decision to raise the cap, with the party saying it will hit both commuters and local businesses. Lib Dem leader Sir Ed Davey said on Friday: \"The fare cap increase is like a bus tax for people across the country, impacting bus users and commuters already struggling to make ends meet. \"MPs must be given a say on this bus fare hike on behalf of their constituents.\" Conservative shadow transport secretary Gareth Bacon said: \"Labour have chosen to increase bus fares by 50% in a further attack on rural communities, working people and pensioners. \"They didn’t have the courage to tell people their plans in the election. This is another broken promise that raises costs on working people.\" But the DfT said the fare cap introduced by the previous Conservative government was due to expire at the end of 2024 and some fares would have soared unless it intervened. “Fares will only be allowed to increase with inflation in the normal way, and the £3 bus fare cap will lead to savings of up to 80% on some routes, keeping bus tickets affordable across the country,\" it said."
    },
    {
        "url": "https://www.bbc.com/news/articles/c5yg3y0qgexo",
        "headline": "'I feel sick about signing that phone contract'",
        "content": "An undercover investigation into the alleged mis-selling of phone contracts has revealed questionable sales practices, prompting calls for stronger regulation. The BBC has spoken to 12 small businesses who say they were misled. \"I feel sick every time I think about it,\" says Paul Toplass. \"I've been in business for over 25 years. We've never experienced anything like this.\" Mr Toplass, who runs a pest control firm, says he was misled into signing a business contract for three phones that he is now \"powerless\" to break free from. It has left him \"being asked to pay over £10,000\" for the phones he believes are worth less than £200 each. Secret filming of a pitch by a representative of Hii Communications Ltd showed them making verbal promises that did not accurately reflect the contract terms and failing to highlight clauses around third-party finance and extra charges. The Lincoln-based firm, also known as Hii Com, said it worked within \"guidelines and rules set out by our funders\". Mr Toplass, from Nottingham, claimed he was not told important facts about the contract he signed in February 2023. He said he thought he was signing a two-year deal with Hii Com and did not know he was renting the phones under a finance arrangement with another company. He had \"completely trusted\" the salesman, but lived to regret not reading the small print. The contract stated that the equipment would be rented by a third party – the finance company Grenke – over 27 quarters. Mr Toplass found he now owed more than £10,000, to be paid over seven years. \"They never at any point said we were entering a lease-hire contract,\" he said. \"It’s morally wrong on every level. We do business and we are open and transparent with every one our customers. Upfront, fixed pricing. \"This business didn’t do any of that.\" Hii Com claims to have more than 3,000 customers. The BBC secretly filmed a 90-minute sales pitch by a representative of the firm. During the meeting, a would-be customer was told three times he would only be dealing with Hii Com. A lease hire agreement was not mentioned. He was told he was signing a five-year contract totalling £18,100 and offered a \"price promise\" fixing the cost. After an hour, the salesman asked him to sign a seven-page document. However, having been made aware by the BBC of complaints from other businesses, the customer began looking through the contract in detail. He found it contained extra costs after the first year and was for a longer term than discussed. When questioned, the salesman offered to cross out seven different passages. They included one detailing an \"annual maintenance charge\" of £983 after the first year, which the salesman said only applied if the customer had no insurance. Asked repeatedly why the contract was for 84 months – two years longer than promised verbally – the salesman said the business would own the phones after five years and then pay for a \"licence\" during a two-year upgrade period. While consumer law gives individuals a cooling-off period after signing a contract, there is no such protection for businesses. Mr Toplass complained to telecoms regulator Ofcom, only to be told it does not deal with individual cases. He then turned to the Communications and Internet Services Adjudication Scheme (CISAS), but was told he lacked proof such as \"photographs of the documents at the time that he signed them\". CISAS concluded that \"on the balance of probabilities\" he had \"agreed to contracts with minimum terms of 84 months\". Mr Toplass said it was unrealistic to expect people to be able to provide the kind of photographic evidence wanted. \"You are on your own,\" he said. All 12 of the small businesses spoken to by the BBC claimed sales representatives had not drawn their attention to the third-party lease agreement or extra charges. Once they had signed, all were told they were tied in for seven years. Shown the undercover footage, financial lawyer Arun Chauhan said: \"Whatever is put in writing, you can see how these customers are being told one thing that they almost feel so trusting in that they don't really need to read the agreement. \"I know that ignorance is no defence in terms of the law, but people get to the contract and they think, 'I've been told everything I need to do'. So they sign it.\" He said he would like to think Ofcom or financial regulators would investigate further in light of the BBC's findings. Hii Com said: \"All our customers are aware that they are entering a lease agreement from the outset.\" It said CISAS had also determined it had \"behaved properly and correctly\" in the case of Mr Toplass. Grenke said it would be conducting a \"full internal review\" across its telecoms portfolio. It was committed to transparency but there was \"an expectation and obligation that the customer completes their own due diligence\". Miya Fu, who runs a scarves and accessories business in Manchester, said she agreed to meet Hii Com after a representative told her they were a BT wholesaler – a claim the company also made on its website. She said she had \"diligently checked\" the contract and it was only when money started going out of her bank account that she learned she was locked into a seven-year agreement with a finance provider. She felt \"betrayed\" and worried because \"you never know what you're going to be paying\" every month. BT said Hii Com was not an accredited BT Wholesale partner for fixed broadband products and services, and it was \"concerned to hear about the examples raised by the BBC\". Dave Millett, an independent telecoms advisor, said few people knew CISAS was funded by the industry itself and there was \"no obligation on any supplier\" to sign up to it. He called for \"a genuine independent ombudsman\". CISAS said complaints were \"carefully assessed by a trained independent adjudicator with legal qualifications\". Businesses unhappy with the findings could reject them and pursue a claim against a provider through the county courts. The Financial Conduct Authority said its regulatory powers did not give it the power to investigate the concerns highlighted. For Mr Toplass, the experience has led to \"soul-searching moments\". \"How have I got myself into this position, how have I put the business into this position?\" he said. \"You do business every single day and you trust. It’s about trust with the person who sat opposite you. \"To then find out months and weeks later that you have been conned is not a nice feeling.\" If you would like to get in touch with your own experiences of sales techniques in the telecoms industry, good or bad, then please email yorksLincsinvestigations@bbc.co.uk – including a contact number if you would like to speak to a journalist. Listen to highlights from Lincolnshire on BBC Sounds , watch the latest episode of Look North or tell us about a story you think we should be covering here ."
    }
]