[
    {
        "url": "https://www.bbc.com/news/articles/c05ml3q2gn7o",
        "headline": "Trump says EU tariffs announcement coming 'very soon'",
        "date": "2025-02-26",
        "content": "US President Donald Trump has said he is planning to hit goods made in the European Union with tariffs of 25%. \"We'll be announcing it very soon,\" he told reporters at an appearance with members of his cabinet. \"It'll be 25% generally speaking and that will be on cars and all other things.\" The appearance sparked new questions about the president's trade plans, as he also appeared to raise the possibility that looming tariffs on imports from Mexico and Canada, set to come into force on 4 March, might be postponed again. The White House did not immediately respond to a request for clarification. In Trump's comments on Wednesday he made clear that trade with Europe was in his sights, repeating his criticism of European policies, which he said put American exporters of food products and cars at a disadvantage. \"The European Union was formed to screw the United States - that's the purpose of it and they've done a good job of it,\" he said.  \"But now I'm president.\" The EU rejected the president's claims, saying the creation of a regional market had made doing business in Europe easier for American firms. The spokesperson for the commission said the EU would react \"firmly and immediately against unjustified tariffs\". \"We're ready to partner if you play by the rules. But we will also protect our consumers and businesses at every turn. They expect no less from us,\" the spokesperson said. Tariffs are a tax on imports that is collected by the government and paid for by the companies bringing in the goods. Trump has vowed to use the levies to boost US manufacturing, raise money and push other countries to change policies he opposes. Since taking office, he has raised tariffs of 10% on goods from China and taken steps to hit other imports with duties, including directing his staff to develop recommendations for custom \"reciprocal\" tariffs for each country. But he has also suspended some of those plans , leaving many businesses and analysts guessing as to whether he is prepared to carry out his threats. Earlier this month, he ordered 25% tariffs on goods from Mexico and Canada, America's top two trading partners. But he suspended the duties before they went into effect until 4 March, to allow for talks on border security. On Monday, Trump said he expected tariffs of 25% on goods from Mexico and Canada to come into effect \"on schedule\". At Wednesday's meeting, when asked for an update, he said the 25% tariffs on Mexico and Canada would go into effect on 2 April. That is the same day that the Commerce Department is supposed to deliver its wider recommendations for \"reciprocal\" tariffs. Commerce Secretary Howard Lutnick told reporters that \"the overall is April 2\" , distinguishing between tariffs tied to concerns about drug trafficking and migration from Mexico and Canada. The Dow Jones Industrial Average, S&P 500 and Nasdaq all headed lower in mid-day trade."
    },
    {
        "url": "https://www.bbc.com/news/articles/c3374ekd11po",
        "headline": "BP shuns renewables in return to oil and gas",
        "date": "2025-02-26",
        "content": "BP has announced it will cut its renewable energy investments and instead focus on increasing oil and gas production. The energy giant revealed the shift in strategy on Wednesday following pressure from some investors unhappy its profits and share price have been lower than its rivals. BP said it would increase its investments in oil and gas by about 20% to $10bn (£7.9bn) a year, while decreasing previously planned funding for renewables by more than $5bn (£3.9bn). The move comes as rivals Shell and Norwegian company Equinor have also scaled back plans to invest in green energy and US President Donald Trump's \"drill baby drill\" comments have encouraged investment in fossil fuels. Murray Auchincloss, BP's chief executive, said the energy giant had gone \"too far, too fast\" in the transition away from fossil fuels, and that its faith in green energy was \"misplaced\". He said BP would be \"very selective\" in investing in businesses working on the energy transition to renewables going forward, with funding reduced to between $1.5bn and $2bn per year. He said this was part of a strategy \"reset\" by the company to focus on boosting returns for shareholders. Helge Lund, chair of BP, added that the new direction of the firm had \"cash flow growth\" at its heart. Shares in the company climbed before Tuesday's announcement but fell shortly after. BP is one of several firms in the energy industry to return focus on oil and gas production, which has seen an increase in profits as prices have increased following lows seen during the Covid pandemic. The firm said it plans to increase its production to between 2.3 million and 2.5 million barrels of oil per day by 2030, with hopes of \"major\" oil and gas projects starting by the end of 2027. Mr Auchincloss is under pressure to boost profits from some shareholders, including the influential activist group Elliot Management, which took a near £4bn stake in the £70bn company to push for more investment in oil and gas. In 2024, BP's net income fell to $8.9bn (£7.2bn), down from $13.8bn the previous year. However, some other shareholders, as well as environmental groups have voiced concerns over switching focus back to fossil fuel production. Last week, a group of 48 investors called on the company to allow them a vote on any potential plans to move away from commitments to renewables. The environmental group Greenpeace UK said the latest move was \"proof that fossil fuel companies can't or won't be part of climate crisis solutions\". Alexander Kirk from Global Witness added BP \"cannot be trusted to deliver the clean energy transition\", adding that it was \"focusing on short-term profits to shareholders while energy prices are high, with the rest of the world picking up the tab from its climate-wrecking products\". Global Witness drove a lorry around central London with messages criticising BP's decision. Sir Ian Cheshire, who has held many executive roles at companies such as B&Q owner Kingfisher and Barclays bank, questioned whether BP's latest move would work. \"I do wonder whether this sort of decision will look right in 10 years,\" he told the BBC's Today programme. \"The climate change issue has not gone away, the science hasn't changed,\" he said. Challenged on the reduced commitment to investing in renewable energy, Louise Kingham, BP's senior vice president for Europe and the UK, said none of the changes announced on Tuesday would alter the UK's green energy plans, which include three wind farms and carbon capture projects. She said the shift to renewable energy sources had slowed but that BP's ambition had \"not changed\" to become a net-zero company. According to the International Energy Agency, no new fossil fuel projects are compatible with limiting global warming to 1.5C compared to pre-industrial levels, \"We just have to do this transition more smartly and more efficiently and try to get those returns for our owners because they are helping us to do that. If we don't generate the returns, we can't invest and do more,\" Ms Kingham told a committee of MPs. \"It's going to take everybody to move in concert to make this happen. It's not just the decision of one company and what it chooses to do.\" The decrease in renewables will cover biogas, biofuels and electric vehicle charging projects, while BP will look to \"capital-light partnerships\" in other green energy such as wind and solar. BP has already placed its offshore wind business in a joint venture with Japanese company Jera and is looking to find a partner to do the same with its solar business. Five years ago, BP set some of the most ambitious targets among large oil companies to cut production of oil and gas by 40% by 2030, while significantly ramping up investment in renewables. But in 2023, the company lowered this oil and gas reduction target to 25%. In the five years since former chief executive Bernard Looney first unveiled his strategy, shareholders have received total returns including dividends of 36%. In contrast, shareholders in rivals Shell and Exxon have seen returns of 82% and 160% respectively. BP's under performance has prompted speculation that it may be a takeover target or may consider moving its main stock market listing to the US where oil and gas companies command higher valuations. Sign up for our Future Earth newsletter to get exclusive insight on the latest climate and environment news from the BBC's Climate Editor Justin Rowlatt, delivered to your inbox every week. Outside the UK? Sign up to our international newsletter here ."
    },
    {
        "url": "https://www.bbc.com/news/articles/c1kjmddx2nzo",
        "headline": "US intelligence head 'not told' about UK's secret Apple data demand",
        "date": "2025-02-26",
        "content": "Tulsi Gabbard, the director of US National Intelligence, says she was not informed in advance about the UK government's demand to be able to access Apple customers' encrypted data from anywhere in the world. Earlier this year, the UK government asked for the right to see the data, which currently not even Apple can access. The tech giant last week took the unprecedented step of removing its highest level data security tool from customers in the UK. In a letter, Ms Gabbard said she was seeking further information from the FBI and other US agencies and said, if the reports were true, the UK government's actions amounted to an \"egregious violation\" of US citizens' privacy. The Home Office notice, which cannot legally be made public, was issued to Apple under the UK's Investigatory Powers Act in January. Ms Gabbard added that she was also seeking legal advice over whether the UK had breached an agreement between it and the US not to demand data belonging to each other's citizens. In response to the Home Office notice, last week Apple pulled its top level privacy tool, Advanced Data Protection, from the UK market. Advanced Data Protection, external (ADP) means only account holders can view items such as photos or documents they have stored online through a process known as end-to-end encryption. Apple would have to break its encryption systems in order to comply with the UK government demand, as currently it cannot see data protected in this way so would be unable to share it with law enforcement. This is something it says it will never do. Apple's UK users' data remains encrypted in the UK but at a level which means it can be accessed by the tech giant if served with a warrant. In the letter to Senator Ron Wyden and Representative Andy Biggs which has now been published online, Tulsi Gabbard said she first read about the notice in the media and had not been informed beforehand by either the UK or by Apple. Apple did not comment. The Home Office referred the BBC to comments made earlier this week by security minister Dan Jarvis. The Minister of State for Security said: \"I cannot comment on operational matters, and it would not be appropriate for me either to confirm or to deny the existence of any notices under the Investigatory Powers Act 2016.\" He added: \"What I can say is that the suggestion that privacy and security are at odds is not correct; we can and must have both.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/c0mw1yw3kyvo",
        "headline": "BP shareholders want it to make money, not climate policy",
        "date": "2025-02-26",
        "content": "It was more than 20 years ago that the then boss of BP reframed those famous initials as \"Beyond Petroleum\". It was the first tentative step in transforming the company from an oil and gas producer to an energy provider investing an increasing amount of its fossil fuel profits into greener technology. Five years ago, chief executive Bernard Looney, who was in charge at the time, accelerated that process with ambitious targets to cut oil and gas production 40% by 2030, while massively ramping up investment in wind and solar. Today, BP could stand for \"Back to Petroleum\" following its announcement to shift back to oil and gas production and slash investment in renewables. Why? Profit and share price. There is simply less money in renewables than in oil and gas and some BP shareholders have become angry and impatient as they watch Shell produce double the returns they have seen while Exxon investors have received four times as much. For most - but not all - shareholders, the number one job of a company's board and management is to maximise the value of the company. BP's failure to do this has led to active speculation that BP should be taken over by a company that understands this. Or one that list its shares in the US where investors are less interested in a green transition. Not all shareholders agree with BP's radical strategy shift back to petroleum. Dozens of them signed a letter expressing concern about increasing fossil fuel production and want to have a say in the company's direction of travel. BP's move follows rivals' Shell and Norwegian company Equinor scaling back of plans to invest in green energy. Meanwhile, US President Donald Trump's \"drill baby drill\" comments have encouraged investment in fossil fuels. Many groups say that long term BP and others are pursuing a no-win strategy. Climate concerns will become so acute that much of the oil and gas they're searching for will have to remain in the ground and become unusable \"stranded assets\" of no commercial value. However, the least patient shareholders tend to have the loudest voices. As such, the cries of dismay from those concerned about the climate are being drowned out by those demanding that BP does what it knows best: drilling for oil and gas and returning those profits to shareholders, who include millions of pension savers. They would say it is not BP's job to question how much oil and gas the world wants or needs - that is the job for the societies it serves and their policy makers. And, while the UK government has decided it wants no new oil and exploration in UK waters, over 90% of BP's activities are outside the UK and the current US government thinks very differently."
    },
    {
        "url": "https://www.bbc.com/news/articles/cd654p339q3o",
        "headline": "Alexa relaunched with ambition to be 'your best digital friend'",
        "date": "2025-02-26",
        "content": "Amazon has unveiled Alexa+, an overhauled version of its virtual assistant with which it hopes users will share \"just about anything\". Rapid recent advances in artificial intelligence (AI) have caused huge growth in software capable of natural-sounding conversations, with ChatGPT and DeepSeek among the most-downloaded apps worldwide. Amazon is attempting to tap into this, with Alexa+ telling a launch event in New York it wanted to be \"your new best friend in the digital world\". It will be included for free in Prime subscriptions when it launches from March - but to non-members it will cost $19.99 (£16) per month, with the UK price yet to be announced. However experts have suggested consumers may struggle to get past their limited expectations of Amazon devices. \"Smart speakers are found in one in four UK homes, yet many users treat them as nothing more than expensive kitchen timers,\" said Ed Freed from marketing agency Rapp UK. \"Ultimately, the most logical place for a truly personal AI assistant is on your phone, not on your countertop.\" Amazon's head of devices and services Panos Panay said Alexa+ would remember information, meaning if you tell it you're a gluten intolerant vegan, for example, future recipes it suggested would bear this in mind. And he promised there would be \"no more Alexa speak\" - meaning users will be able to speak to it more conversationally than previously possible. These are new features that Dr Richard Whittle of University of Salford's Business School explained were \"long overdue\". \"Amazon is hoping its upgraded Alexa will challenge Copilot, Google Assistant and Siri, all of whom use new LLM (large language model) technology,\" he said. \"When users can now chat naturally to their AI assistants, Alexa's once leading voice interaction seems narrow and rigid.\" His colleague Dr Gordon Fletcher, associate dean of research and innovation, agreed. \"Technology changes more rapidly now, competing AI models get updated and everyone else scrambles to respond, Grok last week, Claude this week,\" he said. \"Alexa and the Echo hardware have increasingly seemed like an ageing relic, slow to shift and always behind the curve.\" Amazon told the BBC Alexa+ would be available in all countries which currently have Alexa. In the US, it will be available from March, with other countries getting it later in 2025. It will be available on devices as far back as the second generation Echo Dot, which launched in 2017. For its devices with screens, it will be available as far back as the first generation Echo Show 8, which launched in 2019. It is clear that Amazon expects Alexa+ to do more than its predecessor - and know much more about its users' lives. Mara Segal, director of Alexa, said people will now be able to share \"just about anything\" with the virtual assistant - the idea being that by sharing emails and photographs, it will be able to search through them for things you request. Other demonstrations included using it to book a taxi and a dinner reservation at a restaurant. Thomas Husson, principal analyst at Forrester, said the relaunch was a tacit admission by Amazon that its original vision for smart speakers had failed. \"By subsidising hundreds of millions of Echo connected speakers, Alexa managed to enter households in the hope of generating incremental e-commerce sales,\" he said. \"This strategy failed and the company invested $25 billion (£20bn) in its Alexa division, without truly revolutionizing smart homes.\" He said it was \"about time\" Amazon created a \"truly smart and useful assistant\". But he warned that to \"truly differentiate\" itself, Alexa would need to distinguish between personal and household data, which \"equals a big privacy and trust hurdle\". And Dr Stuart Millar, lead AI engineer at Rapid7, said the move \"makes sense\" as Alexa has \"lagged behind\" competitors such as ChatGPT - but warned the real test will be when regular people get their hands on it. \"We've seen big tech companies launch ambitious AI features before, only to backtrack when unexpected issues arise, or it hasn't behaved as expected,\" he said."
    },
    {
        "url": "https://www.bbc.com/news/articles/cj30xr1vy2lo",
        "headline": "Countries compete to keep skilled young workers",
        "date": "2025-02-25",
        "content": "In 2020, Duarte Dias, a Portuguese software engineer, accepted a job offer to work in Microsoft's Dublin subsidiary. A little over a year later, he joined a team at Microsoft's headquarters in Seattle, where he still works. Even though he misses the Portuguese laid-back approach to life, and the family-like team spirit of the work environments there, he does not regret, not for one second, his choice of pursuing an international career. Mr Dias's decision was made easier by all the financial impact of moving. The verdict of the spreadsheet was clear: staying in Portugal would be financially ruinous. \"I did simulations of how much money I would save a year in Portugal, and I quickly realised that I wouldn't be able to have a comfortable life financially, even if I got one of the most well-paying jobs available in engineering for my experience level,\" says. A two-year job experience in Portugal while Mr Dias was concluding his masters at Lisbon's Instituto Superior Técnico cemented his conviction: his yearly income amounted to €35,000 ($36,000; £29,000). But his take home salary was much, much less. His income placed him in a tax bracket which meant up to 40% of this gross salary went to the state. \"Financially it was bad. It would be very hard to save money if I didn't live with my parents,\" he recalls. Moving to Ireland meant an immediate hike in his salary prospects, almost doubling to €60,000. The money is even better in the US, where he now earns upwards of $160,000 before a 20% income tax rate, much lower than at home. Mr Dias intends to return to Lisbon in two years' time with \"with many more savings\". Keeping skilled workers like Mr Dias in Portugal has been a concern for recent governments. In 2020, the administration led by the Socialist Party's Antonio Costa launched IRS Jovem, a programme of tax reductions for workers less than 30 years old and tiered by level of education. In 2022, 73,684 taxpayers benefitted from this incentive, according to official data. After a snap election in March, the new centre-right Portuguese government led by Luis Montenegro doubled down on the idea and expanded it from five to 10 years, and to all workers under 35 independently of their educational levels. The proposal, passed by the Portuguese parliament in late November, is due to benefit up to 400,000 workers, according to the Portuguese Ministry of Finance. But specialists say it likely won't be enough to keep the young from going abroad. \"It is unlikely that, on its own, the tax regime will make young workers remain in the country, whether because professional opportunities are more abundant in foreign countries, or due to the fact this tax benefit applies only to yearly incomes under €28,000,\" says Sérgio Vasques, professor of tax law at the Católica Lisbon School of Law. He points out that the Portuguese government still takes more of the average worker's salary than most richer nations. Known as the tax wedge, the ratio between the amount of taxes paid by an average single worker without children and the corresponding total labour cost for the employer, stands at 42.3% in Portugal. That's the 8th highest among the 38 member countries of the OECD. \"This is a tax regime that is an enemy of qualified work and professional success. This regime will not solve this problem,\" adds Mr Vasques. Mr Vasques, also a former secretary of state for tax affairs in the early 2010s, adds: \"I also cannot imagine a young professional deciding to move to Portugal just because of an extra couple hundred euros at the end of the year. \"Not even a low-skilled worker will make a decision based on that. Portuguese food works probably better as an incentive to move here than that tax regime\". Rita de La Feria, chair of tax law at the University of Leeds, reminds that the exodus of young people isn't just a Portuguese problem, and that Europe is grappling with the challenges of young emigration. According to a study requested by the Portuguese Parliament, as of July, in the European Union Portugal, Poland and Croatia had special tax regimes based on the taxpayers' ages. \"The challenges are very obvious: worker mobility is higher. The problem is that the country spends very large amounts on training for them to leave for other countries as soon as they enter the workforce,\" she said. Ms de La Feria, who moved to the UK at a young age, told the BBC that when she left Portugal she did not intend to \"leave for good: many leave their countries of origin thinking they will come back at some point. But once they form a family, it's almost impossible to return.\" Antonio Almeida, a software engineer like Mr Dias, left Portugal during the pandemic in late 2020 for a job in Berlin, right after finishing his degree. He would change the German capital for Brussels two years later. All his work experience was done abroad. \"Back in 2020, we were offered monthly salaries of €1,300, gross, in Lisbon. Berlin offered me €4,200 for a junior role.\" Even with a 40% income tax rate in Germany, there was a considerable net gain. \"It wasn't a difficult decision,\" says Mr Almeida. Now in Belgium - where taxes are higher, he stresses - returning to his homeland isn't a priority. \"I think of returning eventually, mainly for family reasons. \"But at the moment my life standards are very high and I like the way of life of central Europe. And the main problem in Portugal is low salaries, not taxes.\" Mr Almeida does not consider the Portuguese tax changes as a major factor when thinking of the pros and cons of coming back home. \"Up until today I never thought about it.\" Mr Dias agrees: \"Salaries outside Portugal will always be higher, and all those who don't have any personal or familial connections to the country won't have any kind of financial or career incentive to stay there\"."
    },
    {
        "url": "https://www.bbc.com/news/articles/cn0j1xep9vzo",
        "headline": "Transport minister 'not a flight-shaming eco warrior'",
        "date": "2025-02-26",
        "content": "The transport secretary has said she is \"not a flight-shaming eco warrior\" ahead of her decision over whether Gatwick airport will be allowed to expand. Speaking at an industry event on Tuesday, Heidi Alexander said she enjoyed flying and valued aviation's role in the economy and growth. A decision is expected later this week on whether the airport in West Sussex can expand its operations to two simultaneously functioning runways. The expansion plans are controversial and some MPs , local authorities and residents are strongly opposed due to a number of concerns including noise levels. If given the green light, Gatwick says the additional runway will enable an extra 50,000 departing flights a year, by the end of the 2030s. Alexander said the government would do \"all we can to support the sector and take the brakes off growth\". Gatwick wants to relocate its northern runway, which is currently used only for taxiing or in emergencies, and says it could be completed and operational by the end of the decade. This would cost an estimated £2.2bn and would be a privately financed project. Alexander made her comments during a speech at the annual dinner of trade body Airlines UK in London on Tuesday evening. \"I have no intention of clipping anyone's wings. I am not some sort of flight-shaming eco warrior. I love flying – I always have,\" the transport secretary said. Alexander also raised the issue of climate change an extreme weather events. She said she did not want a world \"ravaged\" by this but wanted a world where her nieces and nephews are not denied the opportunity to travel. \"This Government believes in increasing airport capacity. We're ambitious for the sector. But these strict criteria must be met if we are to balance the needs of today with the necessities of tomorrow,\" Alexander said. The transport secretary's comments come as Heathrow airport reports record passenger numbers for 2024 up 6%, reaching 83.9 million. Heathrow chief executive Thomas Woldbye said the increase underlined the need for expansion. \"2024 underscores why [Heathrow] is the UK's gateway to growth,\" he said. Plans are being drawn up after the government backed a third runway at Heathrow - the UK's busiest airport, in January. Mr Woldbye said he was keen for expansion to go ahead at pace and believes with private investment, planes could be taking off from a third runway within a decade. Environmental campaigners and local communities oppose the decision, raising concerns about pollution and noise."
    },
    {
        "url": "https://www.bbc.com/news/articles/c5ymvjjqzmeo",
        "headline": "Apple AI tool transcribed the word 'racist' as 'Trump'",
        "date": "2025-02-26",
        "content": "Apple says it is working to fix its speech-to-text tool after some social media users found that when they spoke the word \"racist\" into their iPhones it typed it out as \"Trump.\" The tech giant has suggested the issue with its Dictation service has been caused by a problem it has distinguishing between words with an \"r\" in them. \"We are aware of an issue with the speech recognition model that powers Dictation and we are rolling out a fix today,\" an Apple spokesperson said. However an expert in speech recognition told the BBC this explanation was \"just not plausible.\" Peter Bell, professor of speech technology at the University of Edinburgh, said it was more likely that someone had altered the underlying software that the tool used. Videos shared online show people speaking the word \"racist\" into the Dictation tool. Sometimes it is transcribed correctly - but on other occasions it is turned into \"Trump\", before being quickly restored to the correct word. The BBC has not been able to replicate the mistake, suggesting Apple's fix is already taking effect. Prof Bell said Apple's explanation of phonetic overlap did not make sense because the two words were not similar enough to confuse an artificial intelligence (AI) system. Speech-to-text recognition models are trained by inputting clips of real people speaking alongside an accurate transcript of what they say. They are also taught to understand words in context - for example, they could distinguish the word \"cup\" from \"cut\" if it was within the phrase \"a cup of tea\". Prof Bell says the situation with Apple is unlikely to be a genuine mistake with its data because its English language model would be trained on hundreds of thousands of hours of speech, which should give it a high level of accuracy. For \"less well-resourced languages\" he said it could be an AI training issue. But he said in this case: \"it probably points to somebody that's got access to the process.\" A former Apple employee who worked on its AI assistant Siri told the New York Times: \"This smells like a serious prank.\" Apple had to row back on another AI-powered feature last month after complaints from the BBC and other news organisations. It suspended its AI summaries of news headlines after it displayed false notifications on stories - including one where it said tennis player Rafael Nadal had come out as gay. The company announced yesterday it would be investing $500bn (£395bn) in the US over the next four year, including on a large data centre in Texas to power Apple Intelligence. The company's chief executive Tim Cook also said it may have to change its policies on diversity, equity and inclusion (DEI) after President Donald Trump has called for an end to DEI programmes."
    },
    {
        "url": "https://www.bbc.com/news/articles/ckgdy5e3neko",
        "headline": "Crypto sleuths join hunt for $1.5bn stolen in biggest ever heist",
        "date": "2025-02-26",
        "content": "A company which fell victim to what's thought to be the world's biggest ever theft is seeking to recover some of its losses by crowdsourcing online bounty hunters. Last week, hackers believed to be from North Korea's notorious Lazarus Group stole $1.46bn (£1.1bn) of cryptocurrency from ByBit, a crypto trading platform. The criminals are trying to rapidly cash out the hoard through a complex online money laundering process. ByBit is now offering cash rewards to anyone who spots and prevents them from cashing out. \"Join us on war against Lazarus\" the company's CEO Ben Zhou posted online with a link to a new website offering a bounty to anyone who can help. Cryptocurrencies are stored in public wallets anyone can look up so it's possible to follow the money as the criminals split it into smaller chunks and send it through various channels to obscure its origins. The new website has a live leader board showing companies and individuals who have successfully located some of the coins. The bounty scheme gives 5% of the sum identified to individuals who successfully persuade a company that has control of the funds to freeze the money. It's also awarding 5% to the companies that take action. The website is already displaying millions of dollars in payments to successful crypto sleuths. \"We have assigned a team to dedicate to maintain and update this website, we will not stop until Lazarus or bad actors in the industry is eliminated,\" Mr Zhou said. Crypto investigation firm Elliptic described it as a \"really positive innovation.\" \"There are a lot of very talented blockchain investigators out there who will now be motivated to track down these stolen funds, and to help to seize them,\" said Tom Robinson, from Elliptic. However Louise Abbott, crypto fraud partner at Keystone Law, suggested the heist would still \"negatively impact the perception of trust\" in what she said was already a \"volatile\" industry. \"If such a hack can occur on this scale in the world's second largest exchange, it can certainly happen again,\" she said. There are no authorities such as central banks or regulators involved in crypto transactions which means anyone who falls victim to criminal behaviour does not have an obvious body to turn to for help. That's left ByBit reliant on the goodwill of other crypto companies to act on their behalf. Not all have. ByBit's website is keeping track of crypto firms that don't respond to requests for help. One exchange called eXch is apparently refusing to cooperate. According to researchers at crypto investigators Elliptic, eXch is a platform notable for allowing its users to swap cryptoassets anonymously. In a blog post Elliptic alleges that \"hundreds of millions of dollars in cryptoassets derived from criminal activity, including multiple thefts perpetrated by North Korea\" have been successfully laundered through the service. So far $75m from the ByBit hack has been tracked flowing through the website, according to analysis. EXch has not responded to BBC requests for comment. ByBit is promising to open up it's new bounty website to other victims of the prolific North Korean hacking group. The site has a logo of North Korean leader Kim Jong Un's hair with a knife through it. Crypto investigators around the world have attributed the hack to the group which has been blamed for around $6bn of crypto thefts in recent years. Researchers say the stolen funds are used by the hermit state to skirt international sanctions and develop its military powers. North Korea has never admitted to being responsible for the Lazarus Group."
    },
    {
        "url": "https://www.bbc.com/news/articles/cvgd9v3r69qo",
        "headline": "Tesla shares slump after European sales fall",
        "date": "2025-02-26",
        "content": "Shares in electric car maker Tesla have slumped more than 9% after EU and UK sales fell by almost half in January. The drop in Tesla shares took the company's valuation back below $1trn for the first time since November 2024. Tesla has been facing stiff competition in the European market from Chinese and other manufacturers. In addition, Tesla owner Elon Musk has been making controversial political waves on both sides of the Atlantic, an analyst said. Tesla sales in January bucked European electric car sale trends, which grew by more than a third in the month, according to trade body Acea . Instead, Tesla sales across the EU, EFTA and the UK fell more than 45%, and more than 50% in the EU alone. It comes after Tesla sales fell last year for the first time in more than a decade as demand faltered and rivals gained pace . The main factor in the January sales slump was likely to be increasing competition, AJ Bell investment director Russ Mould said. Chinese manufacturer BYD has been making big strides, in part because it includes as standard some features which cost extra from other makers, Mould said. However, some car buyers may also be taking a \"principled stand\" on Musk's political interventions, he said. Musk has made waves in the US with his involvement in slashing US development funds and efforts to drastically reduce US federal funding. In the UK he supports jailed far-right activist Stephen Yaxley-Lennon, also known as Tommy Robinson, and repeatedly criticised Prime Minister Sir Keir Starmer. Musk also supports the far-right AfD party in Germany, and congratulated its leader after the party's record second-place result in elections. Asked if the reason for Tesla's share price slump was down to Musk being too toxic, a former senior director of the car maker's Europe, Middle East and Asia division said it was \"definitely one of the reasons for the decline\", but added there was a \"cumulative number of things that are piling up a domino effect\". \"There's no doubt his flirting with the right in politics, running around on TV with a chainsaw is not exactly helping his image,\" Peter Bardenfleth-Hansen told the BBC's Today programme. \"He may be getting a bigger fanbase within a specific type of clientele, but they're not the ones that are buying the Teslas. They're not the ones putting money in to his company. So he has a problem.\" Tesla shares got a big boost after the US election due to Musk's closeness to Donald Trump - Musk has described himself as \"first buddy\" to the US president. Investors thought this would stand his businesses in good stead. However, Trump is not a supporter of electric vehicles, and has said he will cancel efforts to boost their ownership. \"How anybody thought this was going to be good for Tesla, I don't know,\" Mould said. There is also general market skittishness about the path of interest rate cuts and concerns about Trump tariff plans that could be contributing to the fall, he added."
    },
    {
        "url": "https://www.bbc.com/news/articles/cx29p18lz62o",
        "headline": "Aston Martin cuts 170 jobs after fall in sales",
        "date": "2025-02-26",
        "content": "Aston Martin has cut 170 jobs after losses widened by a fifth last year and fewer cars were sold in 2023 following a string of supply chain issues and production delays. The luxury auto manufacturer, which has its headquarters in Gaydon, Warwickshire, said it planned to axe 5% of the workforce as part of cost-cutting measures to return to profit. All of the company's departments have been hit, including manufacturing, office jobs and management. In a statement on Wednesday, the company said the aim was to make sure the company was \"appropriately resourced for its future plans\", and called the cuts a \"difficult but necessary action\". Aston Martin - famous for making fictional spy James Bond's cars - said it was targeting yearly savings of £25m and expected to hit about half of that total this year. Since it was bought by Canadian billionaire Lawrence Stroll in 2020, the company has pushed on with a swathe of new model launches in a bid to turn its ailing fortunes around. Adrian Hallmark was appointed the company's new chief executive in September amid a ramping up of sales of its new Vantage and DBX707 models, which it said helped boost production volumes. The company also launched its flagship Vanquish model in September. Aston Martin said the launches helped boost sales later in the year as it started delivering more of the new models to customers, with wholesale volumes picking up 10% year on year in the second half compared with 2023. But the company's wholesale volumes for the whole year were still down 9% at 6,030 cars, pushing its pre-tax losses to gape by a further 21% to £289 million. It also saw its debt pile rise by 43% to £1.16bn during the year, while shares were down about 33% over the last year. Mr Hallmark said it was \"a period of intense product launches, coupled with industry-wide and company challenges\". He said he wanted Aston Martin to \"transition from a high-potential business to a high-performing one, better equipped to navigate future opportunities and uncertainties\". Follow BBC Coventry & Warwickshire on BBC Sounds , Facebook , X and Instagram ."
    },
    {
        "url": "https://www.bbc.com/news/articles/cvg18pvz7kko",
        "headline": "The seven bills due to go up in April",
        "date": "2025-02-25",
        "content": "Energy costs are one of a number of bill rises which will come into force at the start of what some commentators have described as \"awful April\". The exact amount you pay will depend on your individual circumstances, and where you live. Although minimum wages will increase from April, and wages on average have been outpacing inflation, household finances could still come under extra pressure. Here are seven ways in which you could be affected. Water bills for households are due to go up in England and Wales by £10 more per month on average, but there's a lot of variation depending on the company . For example, the annual Southern Water bill will jump 47% to £703, while Anglian Water customers will pay 19% more, or £626. Factors including whether households have a meter and how much water used will also impact bills, which are being front-loaded for the next five years, meaning the big increase is coming in April. Water companies in England and Wales have said the increases are needed to invest in creaking infrastructure, including sewage, and to build more reservoirs. In Scotland, water bills are set to rise by almost 10%. Scottish Water, which is a public body, said spending was needed to cope with periods of \"drought and intense rainfall\" brought on by climate change. Domestic customers in Northern Ireland are not billed for water, with the system funded by the devolved government. The annual energy bill for a household using a typical amount of gas and electricity will go up £111 a year to £1,849 from April. Regulator Ofgem increased the energy price cap because of higher wholesale costs and inflation. The cap is set every three months and limits the amount suppliers can charge for each unit of gas and electricity, but not the total bill, so if you use more, you will pay more. It affects 22 million homes in England, Wales and Scotland. Standing charges - fixed fees to connect to a gas and electricity supply and vary by region - are rising again for gas but dropping for electricity, but it depends on where you live. Ofgem is suggesting households consider a fixed tariff for a bit of stability, even though there's speculation of prices dropping in July. It is likely the tax you pay to your local authority will go up from April. In England, local authorities with responsibility for delivering social care can increase council tax every year by up to 4.99% without triggering a referendum or local vote. Smaller councils without social care duties can increase bills by up to 2.99%. For 2025-26, the government is allowing Bradford, Newham, Birmingham, Somerset, and Windsor and Maidenhead to bypass the 4.99% cap , meaning they could raise council tax by more. Council tax rates in Scotland have been frozen or had limited increases since 2007, but they are expected to go up in April, in some cases by as much as 10% . The Scottish government says it is offering local authorities an extra £1bn in 2025-26 to help reduce the scale of any rise. In Wales, council tax rates could jump by as much 15% in some areas. Local authorities were given £253m by the Welsh government in its draft budget, but council leaders say more money needed . Northern Ireland uses a domestic rates system instead of council tax. All of Northern Ireland's councils have reported district rate increases for the next year. From April, the standard rate of tax for cars registered after April 2017 rises £5 to £195 a year. According to the RAC, you may pay less or more if your car was first used before 2017. The exact amount for your road tax will depend on the year your car was registered and the type of fuel it uses. One big change is that electric vehicles (EVs) will no longer be tax exempt. EVs registered from April 2025 will pay the lowest rate of £10 in the first year, then move to the standard rate. The standard rate will also apply to EVs first registered after April 2017. Rule changes introduced by the telecoms regulator this year mean that mobile and broadband providers must now tell customers \"in pounds and pence\" about any price rises, as well as when they occur. The new rules typically only apply to new customers, so any price rise will depend on when you took your contract out. For instance, under the new rules, someone with a mobile Sim only contract with EE will see their bill go up by £1.50 a month, or £18 a year. But for the majority of customers who took their contract out before 10 April 2024, they will face an increase of 6.4%, based on the inflation rate last December, plus an additional charge. Similarly, most Virgin Media broadband customers will face a 7.5% rise in bills, but for anyone who took out a contract after 9 January this year, their monthly bill will go up by £3.50. The cost of a TV licence will also go up by £5 to £174.50 , and for a black and white TV it will go up by £1.50 to £58.50. House buyers in England and Northern Ireland will start paying stamp duty on properties over £125,000 in April, instead of over £250,000 at the moment. First-time buyers currently pay no stamp duty on homes up to £425,000, but this will drop to £300,000. Anyone starting a search for a property now would likely struggle to move before the stamp duty changes. The government has kept in place the freeze on tax thresholds on income tax and National Insurance until 2028, a policy brought in by the previous government. This is often dubbed a stealth tax - as governments don't explicitly label it as a tax. But the policy amounts to a tax rise because of a process called \"fiscal drag\" , which sees more people \"dragged\" into paying higher rates of tax as wages rises. According to figures from the government's financial watchdog by 2028-29, nearly four million additional people will be expected to pay income tax - and three million more will have moved to the higher rate - due to the threshold being frozen. Reporting by Tom Espiner, Vishala Sri-Pathma, Faarea Masud, Shanaz Musafer, Mitch Labiak, Tommy Lumby and Kevin Peachey"
    },
    {
        "url": "https://www.bbc.com/news/articles/cn524lx9445o",
        "headline": "What Apple pulling Advanced Data Protection means for you",
        "date": "2025-02-26",
        "content": "Apple has made headlines by pulling its most advanced data security tool for UK customers. It is removing Advanced Data Protection (ADP) after the Home Office asked for the right to be able to access data which it is applied to - something even Apple itself cannot currently do. Rather than comply with that request, on Friday the tech giant said it would halt new UK sign-ups to the tool and remove existing user access at a later date. The move has prompted criticism of the UK government's actions - but also confusion about what protections remain for UK Apple customers. ADP is an opt-in data security tool designed to provide users of devices such as iPhones with a more secure way to protect data stored in their iCloud accounts. Items including back-ups, photos, notes and voice memos are given standard encryption by default. The company can be ordered to hand over this data by law enforcement. ADP, meanwhile, applies an extra level of protection through what's known as end to end encryption, which means Apple cannot see or access the data - only the user can . Because Apple does not have a key, losing access to your account can mean losing your data altogether. It also means law enforcement agencies have no way of accessing such data either. The tool is independent of the protections for blue messages sent with iMessage, passwords stored in iCloud keychain, Health app data and Facetime, which are end to end encrypted by default. If you are in the UK and have not turned on ADP, you will not see a change to the way your data is protected as a result of Apple disabling it. Your iCloud data will remain protected by standard encryption and, as before, can still be accessed by Apple. But it does mean you now cannot apply to protect iCloud storage with end to end encryption, even if you want to. Meanwhile, people in the UK who had ADP enabled prior to Friday's change will lose access to it a later date . Apple has not said when, nor how many UK users will be affected. Some experts have raised alarm over its removal, saying it will leave users less protected and also have wider, global consequences. Graeme Stewart of cybersecurity firm Check Point said it would not mean \"a complete free-for-all\" as law enforcement must have a warrant to request iCloud data. But he said other governments may look to replicate the UK's demand of Apple for a so-called \"backdoor\" to encrypted cloud data. Cybersecurity experts have likened the idea of creating a backdoor to someone leaving their house keys under their doormat - essentially creating a vulnerability which anyone, including bad actors, can exploit. Digital rights group the Electronic Frontier Foundation said that if Apple had complied with the request, it would have created a backdoor not just for UK users \"but for people around the world, regardless of where they were or what citizenship they had\". Apple told the BBC in a statement that it had \"never built a backdoor or master key to any of our products, and we never will\". Like Apple, Google says it uses standard encryption across a range of its services to protect data as it moves between users' devices, its services and data centres. The search giant, which owns Android, has provided further protections for Android phone system back-ups since 2018 . It uses a mechanism that generates a random security key on a device, which is encrypted by a user's lock-screen passcode, pattern or pin. Google says it cannot see this security key and that the passcode-protected information is sent securely to high security chips in its data centres. But the same protections do not extend to Google Photos or content stored in Google Drive - which are not end to end encrypted. It also has an Advanced Protection Program for people who want further security for their account. This relies on using passkeys to verify the account holder. Some Samsung Galaxy smartphones also have \"enhanced data protection\" which encrypts back-ups of messages, call logs, apps and settings and more end to end ."
    },
    {
        "url": "https://www.bbc.com/news/articles/c0q1w9q1qvyo",
        "headline": "Wonder Woman game axed as Warner Bros cuts three studios",
        "date": "2025-02-26",
        "content": "Warner Bros Discovery has confirmed plans to shut three of its gaming development studios. The decision means the anticipated Wonder Woman game, which has been in production for three years at one of the affected studios, Monolith, will not be released. Player First Games, which made MultiVersus, and Warner Bros. Games San Diego will also be shuttered. The announcement comes after a difficult time in the industry, with widespread job losses since a boom during the Covid pandemic. A spokesperson from Warner Bros told BBC Newsbeat the \"difficult decision\" was aimed at boosting profitability. On Wonder Woman, they said: \"Our hope was to give players and fans the highest quality experience possible for the iconic character, and unfortunately this is no longer possible within our strategic priorities.\" Last month, MultiVersus said there would be no more updates for the game , which would have to be played offline \"for the foreseeable future\". Warner Bros said it will instead focus on developing its core franchises including Harry Potter, Mortal Kombat, DC and Game of Thrones. \"As difficult as today is, we remain focused on and excited about getting back to producing high-quality games for our passionate fans and developed by our world class studios and getting our games business back to profitability and growth in 2025 and beyond,\" the spokesperson said. Last year was a challenging one for the games sector, seeing games delayed, studios closed around the world and thousands of layoffs including at Microsoft's Xbox and Sony's PlayStation . Warner Bros Games had big expectations for Suicide Squad: Kill the Justice League but the game was panned by fans and critics . Updates for the game ended in January after weak sales and poor reviews. And last month, the company announced the departure of David Haddad, the chief of the gaming unit, after 12 years. Wider trends in the industry have seen sales struggle as gamers spend less on new games, choosing instead to stick with long-running online games like Fortnite or yearly franchises such as Call of Duty and EA Sports FC. As well as people spending less on new games since the pandemic, the cost of making blockbuster releases has increased and investors are putting less money into the industry. Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here ."
    },
    {
        "url": "https://www.bbc.com/news/articles/clyjv8e49deo",
        "headline": "Apple boss says its DEI programmes may change",
        "date": "2025-02-26",
        "content": "Apple boss Tim Cook has said his company may have to change its diversity practices as the US legal landscape shifts. His comments came just minutes after a majority of shareholders rejected a proposal calling on the tech giant to consider ending its diversity policies, such as the use of race and sex in hiring decisions. Apple had urged shareholders to vote against the measure, which the company had argued was  \"inappropriately\" trying \"to micromanage\" its business. The scrutiny of the firm comes as US President Donald Trump has called for an end to diversity, equity and inclusion (DEI) programmes in the government and private sector, including at Apple. In a social media post the day after the meeting, Trump ramped up the pressure on the company. \"Apple should get rid of DEI rules, not just make adjustments to them,\" he wrote in a all-capital-letters post. \"DEI was a hoax that has been very bad for our country. DEI is gone!!!\" Trump's DEI orders have run into legal roadblocks, but many companies in the US, including big names such as Meta, Amazon and Goldman Sachs, have already ended or rolled back their own policies, citing legal risks. Apple's decision to fight the shareholder proposal had bucked that tide. Shareholder measures opposed by companies rarely succeed, so the outcome of Tuesday's vote was expected. It marked the second high-profile defeat of shareholder proposal targeting DEI, after a similar rejection at retailer Costco. However, despite the vote, Mr Cook on Tuesday acknowledged that the firm may have to alter some of its practices. \"As the legal landscape around this issue evolves, we may need to make some changes to comply, but our north star of dignity and respect for everyone and our work to that end will never waver,\" Mr Cook said during a question-and-answer session at the company's annual shareholder meeting. He noted that Apple did not use \"quotas\" for hiring - a practice that has come in for some of the fiercest criticism - while saying the firm's strength came from a culture where \"people with diverse backgrounds and perspectives come together\". \"We'll continue to work together to create a culture of belonging where everyone can do their best work,\" he added, saying the company would remain \"committed to the values that have always made us who we are\". The proposal targeting Apple's DEI policies was backed by the National Center for Public Policy Research, a conservative think tank, which had also put forward the proposal at Costco. It argued that the existence of Apple's diversity and inclusion programmes exposed the firm to \"litigation, reputational and financial risks\", pointing to the wider corporate retreat and noting that recent lawsuits have made it easier for workers to sue over discrimination. Stefan Padfield of the organisation's Free Enterprise Project, who presented the proposal at Tuesday's meeting, said the risks to Apple had increased after the Trump administration recently ordered staff to investigate DEI in the private sector. \"The vibe shift is clear,\" he said. \"DEI is out and merit is in.\" Apple's decision to push back against the shareholder proposal, while simultaneously opening the door to changing its policy is an effort to satisfy both sides of the fight, said Angela Jackson, a senior advisor to the Project on Workforce at Harvard University and author of the forthcoming book, The Win-Win Workplace. But she warned that it left Apple \"playing defence\". She said she wanted to see the company lead by making a more robust business case for the programmes. \"They've made the right moves. The one step they could go further... is to really say, 'Yes it's our values, we believe it's the right thing to do, but it's also an economic imperative.\" The fight over DEI in the US has raised questions about whether such policies in other countries will face similar challenges. Catherine Howarth, chief executive of the responsible investment charity ShareAction, said she thought that Apple - a global, consumer-facing firm - had made the bet that the benefits of pushing back against the shareholder proposal outweighed the risks. \"It's not popular with consumers and it's not popular with employees to abandon what were supposedly your principles in this area until very recently,\" she said. \"They think it would go down very badly - and it would - with their global consumer base.\" Shareholders also rejected proposals that would have required Apple to report about its AI privacy practices, charitable giving and policies to combat child sex abuse. They backed the board members supported by the company, as well as its executive compensation, including a pay package for Mr Cook worth more than $74m."
    },
    {
        "url": "https://www.bbc.com/news/articles/c4gdxx4dg41o",
        "headline": "Battery firm announces gigafactory plan",
        "date": "2025-02-26",
        "content": "Talks have taken place with a battery firm about the possibility of building a gigafactory in Coventry. Manufacturing firm Volklec has announced it will begin producing batteries at the UK Battery Industrialisation Centre and hopes to ultimately build a £1bn gigafactory in the next five years. Although no final decision has been made about the location, talks have taken place with the city council about it being built at neighbouring Coventry Airport. Plans for a gigafactory - producing batteries for electric vehicles - at the airport site have been talked about for the best part of a decade. According to the latest figures obtained by the BBC, £25.25m of taxpayers' money has been committed to plans to build a gigafactory at Coventry Airport project since 2021. Those funds have come via the West Midlands Combined Authority and Coventry City Council - with an additional £2m pledged by Coventry Airport Limited. Yet, to date, no firm has committed to the project and there have been no visible signs of progress. Councillor Jim O'Boyle, cabinet member for jobs at the city council, confirmed talks had been held with Volklec. He said a gigafactory at the airport \"had to happen\" and added \"I think with the right will, and the right people, it won't be long before we can make a proper announcement.\" Asked about his hopes of securing investment from central government to kick-start the project, he said: \"I'm very confident that will happen. There hasn't been one single gigafactory anywhere in the world that hasn't benefitted from the relevant government providing grants to make that happen.\" Volklec's first batteries are expected to roll of the production line at the UKBIC before the end of the year. About 100 jobs will be created initially and there are hopes 1,000 jobs will be created if a new gigafactory is built. Phil Popham, executive director of Volklec, said millions of power cells would be built under an agreement with Chinese partner Far East Battery and would be used to power everything from road vehicles to marine technology. He said it was \"too early to say\" if Coventry would be the location. Follow BBC West Midlands on Facebook , X and Instagram . Send your story ideas to: newsonline.westmidlands@bbc.co.uk"
    },
    {
        "url": "https://www.bbc.com/news/articles/c1kjmm3n427o",
        "headline": "Cancer scans to be revolutionised by nuclear start-up",
        "date": "2025-02-26",
        "content": "Nuclear scientists believe they have found a way to transform the supply of vital material used for scanning cancer patients. Doctors use so-called radioisotopes to pinpoint the growth of cancer in patients. But the radioactive material is all produced by ageing reactors outside the UK, and sometimes the supply is interrupted. Dr Tom Wallace-Smith, technical director of Bristol's Astral Systems, said they developed a technique that produces the material here in the UK. He said this has the potential to \"eliminate the delays that have plagued\" cancer treatments. The team in Bristol have come up with a whole new approach, using nuclear fusion rather than fission. And rather than requiring a new nuclear plant, which would cost about £400m to build, they can develop the material in small plants \"right by hospitals\" for about £1m, Dr Wallace-Smith said. Every year, radiologists scan about 300,000 patients using these radioactive radioisotopes, with consultants saying they would not be able to do their work without them. In October, the world of nuclear medicine was hit by a major crisis. Outside the niche speciality, few noticed because doctors and health managers implemented a rapidly assembled rationing system for vital scans. Britain gets all of its supply from three reactors in Europe. In October two of them shut down for planned maintenance at the same time, and then the third sprung a fault. \"Something like 75% of our supply was lost,\" said Dr Stephen Harden, from the Royal College of Radiologists. All patients needing urgent diagnostic scans were seen on time, but thousands of more routine check-ups were delayed. The interruption only lasted three weeks, but it highlighted what Dr Harden called the \"ageing and fragile\" supply chain. He explained: \"It makes a really strong case for making these radioisotopes in the UK.\" In 2017 a UK Government report said six nuclear reactors made 85% of the radioisotopes used worldwide. By 2030, five of them will be retired. Many of these reactors were built in the 1960s and 1970s.  Building a new one is expensive and takes years. In North Wales, there are plans to build such a reactor , which will cost £400m. Like all nuclear fission plants, they are controversial. Their raw material is uranium, and the radioisotopes they produce are, by design, radioactive. Astral Systems has developed technology that can now make the same radioisotopes used in hospitals, on demand. Small reactors could be built for under £1m, less than the price of the scanner that uses the radioactive product. Now, the team is building a new kind of fusion reactor, which will be able to produce any kind of radioisotope for research or medicine, right by the hospitals that need it. At the Bristol Royal Infirmary, I watched as a patient lay on the scanner bed, ready for his session. He was fully clothed, but the vital preparation was internal. \"Three hours before the scan, we inject patients with a tiny amount of radioactivity,\" explained consultant radiologist, Dr Randeep Kulshrestha. The radioisotope is tagged to substances that will go to whatever area doctors are interested in, for example the bones. The camera will then pick up the radioactivity in such a way that doctors can see how, for example, a cancer has spread. Dr Kulshrestha showed me pictures taken from an anonymous patient, where doctors suspected cancer had spread from his prostate to his bones. Sadly for the person involved, the images are stark. Areas on the bones are lit up orange, where the cancer has grown on their bones. \"These radioisotopes form a vital part of the diagnostic process\", Dr Kulshrestha told me. \"We couldn't work without them these days.\" Follow BBC Bristol on Facebook , X and Instagram . Send your story ideas to us on email or via WhatsApp on 0800 313 4630 ."
    },
    {
        "url": "https://www.bbc.com/news/articles/c5yxv0yj40ko",
        "headline": "Trump orders copper probe in first step to tariffs",
        "date": "2025-02-25",
        "content": "US President Donald Trump has ordered an investigation of copper imports in what is a first step toward potential tariffs on the metal. Administration officials said the White House wanted to find ways to boost US production of copper, a component used to make electric cars, ships and data centres that they said was vital to national security. The move launches a process that Trump previously used to put tariffs on steel and aluminium, opening a new front in his trade war. Trump has already raised tariffs on goods from China, while threatening a range of more sweeping trade actions, including a 25% border tax on goods from Canada and Mexico and new \"reciprocal\" tariffs set for each country. The trade fights have drawn threats of retaliation, while raising alarm among consumers and businesses in the US about higher costs. Concerns about the plans have contributed to a sharp drop in consumer confidence on recent surveys. But administration officials said on Tuesday they believed this action was necessary to protect US copper companies from competition from China. \"China has long used industrial capacity and dumping as an economic weapon to dominate global markets, systematically undercutting competitors and driving rivals out of business,\" Trump trade advisor Peter Navarro said. \"It's time for copper to come home,\" Commerce Secretary Howard Lutnick said. Tariffs are taxes charged on goods imported from other countries, which are paid by the company that is bringing in the goods. They are intended to support domestic production by making imports more expensive. The US is already a major copper producer , while also importing the metal mainly from Chile, Canada and Mexico. China's global copper exports rose last year, as domestic demand weakened, and authorities raced to curb production. The so-called 232 investigation by the Commerce Department will look at copper imports, as well as imports of copper \"derivatives\". The timeline of the probe was not clear. On a background briefing about the action, a White House official said the results of the investigation would inform the level of possible tariffs."
    },
    {
        "url": "https://www.bbc.com/news/articles/cgl0k772lwpo",
        "headline": "People should consider energy bill fix, regulator says",
        "date": "2025-02-25",
        "content": "Households are being encouraged to consider a fixed price deal on their energy bills by the regulator ahead of costs rising again in April. Ofgem is increasing the energy price cap by 6.4%, meaning a household using a typical amount of gas and electricity will see their bill rise by £111 a year, or £9.25 a month, to £1,849. The cap, which is set every three months and limits the amount suppliers can charge for each unit of energy, affects 22 million homes in England, Wales and Scotland. Ofgem said switching to a fixed tariff provided certainty over payments and could reduce costs, although analysts predict prices could fall in July. The rise in April will hit people's finances at the same time as water and council tax increases, although average wages are also going up. The regulator said rising wholesale costs and inflation were behind the latest energy price hike - the third consecutive increase in the quarterly cap and more than the 5% analysts had forecast. While the cost of each unit of gas and electricity is capped, the total bill is not, so bills will vary depending on how much energy is used. Ofgem illustrates the cap by showing the impact on the annual bill of a household with typical energy usage. Standing charges - fixed fees to connect to a gas and electricity supply and vary by region - are rising again for gas but dropping for electricity. Some customers in London and the North Wales and Mersey region will see an overall increase of up to £20 a year. Ofgem's chief executive Jonathan Brearley accepted another increase in energy costs was \"unwelcome\". He said customers, where possible, should consider \"switching or fixing tariffs now\" to try to lower costs and \"provide certainty over coming payments\". According to Ofgem, about four million households have fixed in recent months. Some people in debt to their supplier will not be able to switch firms, but should still be able to fix with their current provider on their best fixed deal. Anyone worried about paying their bills should contact their supplier for help, Mr Brearley added. Martin Lewis, founder of Money Saving Expert, told the BBC that moving to a fixed deal was a \"no-brainer\". He said people should check whole-of-market comparison sites for the best deal, and wait a little while before choosing a new tariff as he has heard some \"good tariffs are being launched\" by energy firms. However, analysts at consultancy Cornwall Insight have forecast variable prices could fall again in July to close to the current level. At a mum and baby sensory class in Manchester, parents said rising bills were a constant worry. \"We have definitely felt a difference in the quality of life we can afford now,\" said Michelle Gill, who attended the session with her baby, Ori. \"Things we didn't think about a year ago are now at the front of our mind.\" Melissa Rawling, mum of baby Ezra, said that because they have a baby, \"we have to keep the heating on more but it's not what we would like to be doing\". \"I'm more conscious of being out during the day so we don't have to keep the heating on. We can't spend all day at the park when it's cold so things like this class are ideal for keeping warm.\" Charities said the price increase would be a painful blow for billpayers. Citizens Advice said its research suggested 6.7 million people in England, Wales and Scotland were in debt to their energy supplier. Official figures show nearly £4bn is owed. \"We're helping people every day who simply can't afford this latest price hike,\" said its chief executive, Dame Clare Moriarty. The government has announced it is planning to extend the number of people who qualify for the Warm Home Discount scheme next winter - which gives some people on benefits a reduction of £150 from their annual energy bill. Energy bills are about 50% higher than pre-Covid levels, but remain below the peak reached in 2022 when Russia's invasion of Ukraine caused prices to spike. Ofgem director general of markets, Tim Jarvis, said the latest price rises were driven by international gas prices, which have gone up \"significantly\" recently. However, analysts at Cornwall Insight said energy prices have dipped in the past couple of weeks following US-Russia talks on a potential end to the Ukraine war. As a result, the consultancy has forecast the price cap in July will fall to £1,756 a year for a typical consumer, although it noted this would still be hundreds of pounds above the pre-conflict level. It also said volatility in the energy market means it is likely the price cap predictions \"will change multiple times\" before July. The latest changes mean that in April: The regulator has extended the Debt Allowance Scheme – a charge for all customers to cover the cost of that debt support - until something different is done to deal with the amount of debt being accrued. In response to the latest price increase, Energy Secretary Ed Miliband said the government was determined to protect people, by extending the Warm Home Discount and encouraging energy creation in the UK. Acting shadow energy secretary Andrew Bowie said the price rise was \"a betrayal to the families who Ed Miliband promised to save £300 on their bills\". Liberal Democrat leader Ed Davey repeated his demand for a reversal to cuts to the number of pensioners eligible for the Winter Fuel Payment. Experts have shared three tips to keep on top of energy use during the warmer months: Read more here if you are struggling to pay energy bills Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday."
    },
    {
        "url": "https://www.bbc.com/news/articles/c3rnq2lv1lzo",
        "headline": "Starbucks cuts English breakfast latte in menu shake-up",
        "date": "2025-02-25",
        "content": "Starbucks is cutting 1,100 jobs and simplifying its menu in the US as it tries to improve flagging business in its home market. The first items to get the axe include the Royal English Breakfast Latte, White Hot Chocolate and several kinds of blended frappuccinos. But Starbucks said more offerings would be cut, as it aims to shrink its menu by nearly a third over the next year, hoping to reduce wait times and improve quality and consistency. The company has been wrestling with a sustained fall in sales since last year, which has been particularly pronounced in the US. Chief executive Brian Niccol, who previously headed the Mexican food chain Chipotle, was brought into Starbucks last year to help turn the business around. He has said he wants to see the company return to its roots as a coffee house. The drinks set for the chopping block \"weren't commonly purchased, can be complex to make, or are like other beverages on our menu\", Starbucks said. The changes are due to go into effect on 4 March. \"We're simplifying our menu to focus on fewer, more popular items, executed with excellence,\" the company said on Monday. \"This will make way for innovation, help reduce wait times, improve quality and consistency, and align with our core identity as a coffee company.\" The job cuts announced on Monday are focused on corporate \"support partner\" roles and will not affect jobs or investments at stores, the company said. The company said it would inform staff affected by the decisions by mid-day on Tuesday. It is also eliminating \"several hundred\" open and unfilled positions. \"Our intent is to operate more efficiently, increase accountability, reduce complexity and drive better integration,\" Mr Niccol wrote in the announcement. Starbucks employs more than 360,000 people and operates or licenses more than 40,000 stores around the world. The US is its biggest and most important market, but its brand there has suffered in recent years as customers complained about long wait times and high prices, and the company wrestled with baristas trying to unionise. The company was also embroiled in debates over the Israel-Gaza war, facing boycott calls from both pro-Israel and pro-Palestine camps, despite the company's efforts to remain neutral. The company last month said transactions at US stores open at least a year were down 8% in the most recent quarter, compared with the same period a year earlier. The drive to simplify the menu marks a shift from previous strategies, which emphasised personalised drinks."
    },
    {
        "url": "https://www.bbc.com/news/articles/c4g7xn9y64po",
        "headline": "Major Asia bank to cut 4,000 roles as AI replaces humans",
        "date": "2025-02-25",
        "content": "Singapore's biggest bank, DBS, says it expects to cut about 4,000 roles over the next three years as artificial intelligence (AI) takes on more work currently done by humans. The move will affect temporary and contract staff, a bank spokesperson said, with the reduction in the workforce coming from \"natural attrition\" as projects are completed. Permanent staff are not affected by the cuts. The bank's outgoing chief executive Piyush Gupta also said it expected to create around 1,000 new AI-related jobs. It makes DBS one of the first major banks to offer details on how AI will affect its operations. The company did not say how many jobs would be cut in Singapore. \"Over the next three years, we envisage that AI could reduce the need to renew about 4,000 temporary/contract staff across our 19 markets working on specific projects,\" the DBS spokesperson said. \"As such, we expect the reduction in workforce will come from natural attrition as these temporary and contract roles are completed over the next few years.\" DBS currently has between 8,000 and 9,000 temporary and contract workers. The bank employs a total of around 41,000 people. Last year, Mr Gupta said DBS had been working on AI for over a decade. \"We today deploy over 800 AI models across 350 use cases, and expect the measured economic impact of these to exceed S$1bn ($745m; £592m) in 2025,\" he added. Mr Gupta is set to leave the firm at the end of March. Current deputy chief executive Tan Su Shan will replace him. The ongoing proliferation of AI technology has put its benefits and risks under the spotlight, with the International Monetary Fund (IMF) saying in 2024 that it is set to affect nearly 40% of all jobs worldwide. The IMF's managing director Kristalina Georgieva said that \"in most scenarios, AI will likely worsen overall inequality\". The governor of the Bank of England, Andrew Bailey, told the BBC last year that AI will not be a \"mass destroyer of jobs\" and human workers will learn to work with new technologies. Mr Bailey said that while there are risks with AI, \"there is great potential with it\"."
    },
    {
        "url": "https://www.bbc.com/news/articles/c1jpg0069wgo",
        "headline": "Theranos founder Elizabeth Holmes loses fraud appeal",
        "date": "2025-02-25",
        "content": "Theranos founder and former chief executive Elizabeth Holmes has lost an appeal against her conviction for defrauding investors in her blood-testing company. Holmes was sentenced to more than 11 years in prison. In her appeal, she challenged trial evidence and testimony and argued that statements by her ex-business and romantic partner Ramesh \"Sunny\" Balwani about his level of responsibility for Theranos' financial model should have been included. He was jailed for more than 12 years. The Ninth Circuit Court of Appeals rejected the arguments. Judge Jacqueline H Nguyen wrote that Theranos's claim of being able to run blood tests with a drop from a finger prick instead of a needle in a vein was \"nothing more than a mirage\". \"The grandiose achievements touted by Holmes and Balwani were half-truths and outright lies,\" Nguyen wrote in the opinion on behalf of a three-judge panel published on Monday. Holmes was convicted in 2022 of conspiracy and multiple charges of wire fraud for misleading investors over the company's financial health and the effectiveness of its technology. Balwani, who was tried separately and additionally convicted of defrauding patients in 2022, also lost his appeal. In the appeal, both challenged a court order to pay $452m (£358m) in restitution to victims, which the court upheld. In Holmes's appeal, she argued that statements from Balwani where he said he \"owned\" the company's financial model should have been included in the trial. The appeal also argued that former Theranos employees offered improper expert testimony and a government inspection report should not have been included as evidence - all arguments the court dismissed. Silicon Valley start-up Theranos was once valued at $9bn (£7bn). But in late 2015, news reporting revealed internal struggles at the company and exposed the limitations of its technology. After a two-and-a-half-year investigation, a grand jury indicted Holmes and Balwani, leading to their convictions and sentencings. Holmes entered prison in Texas in 2023."
    },
    {
        "url": "https://www.bbc.com/news/articles/ce980m2xv30o",
        "headline": "Apple commits to $500bn US investment",
        "date": "2025-02-25",
        "content": "Apple plans to invest more than $500bn (£396bn) in the US over the next four years, starting with a new advanced manufacturing factory in Texas. The tech giant said it expected to create 20,000 new jobs over that time, with the \"vast majority\" of roles in research and development, software and artificial intelligence (AI). It is not clear to what extent the spending is an acceleration of the company's current activities. Apple said the sum included everything from spending on suppliers to Apple TV+ productions. The announcement comes days after Apple boss Tim Cook met with President Donald Trump, who has made increased corporate investment in the US a priority. In its announcement , Apple said its investment was its \"largest-ever spend commitment\" and would expand its support for American manufacturing. \"We are bullish on the future of American innovation,\" Cook said. The new 250,000 sq ft factory in Houston, Texas, is set to produce servers that were \"previously manufactured outside the US\" to support Apple Intelligence, the company's AI system, the company said. The iPhone maker added it would open in 2026 and create thousands of jobs. Apple is also expanding its data centre capacity in North Carolina, Iowa, Oregon, Arizona and Nevada, and doubling its support for a fund dedicated to US manufacturing, which it created in Trump's first term, from $5bn to $10bn. Trump previewed the announcement last week, claiming it was partially a response to his trade policies, including tariffs. On Monday, the president took credit for the news on social media, saying the reason for the investment was \"faith in what we are doing, without which, they wouldn't be investing ten cents\". Trump has said he wants to see more companies making their products in the US, threatening to raise tariffs drastically in a bid to make domestic manufacturing more attractive. Last month, he imposed a new 10% border tax on all imports from China, where Apple has a significant manufacturing presence. He has also proposed tariffs on products made in many other countries, including neighbouring nations Mexico and Canada. Eileen Burbidge, a venture capital investor in tech businesses and a founding partner of Passion Capital, said Apple had made similar announcements before. In 2018 the company announced a $350bn investment in the US, and in 2021 it said it was committing $430bn to its home market, both times saying the investments would add 20,000 jobs over five years. \"It's starting to become a bit business as usual,\" she told the BBC. \"But obviously it's music to Donald Trump's ears.\" Investing in its own research and development (R&D) was in the company's best interests, she said, although the US investment was \"relatively small\" compared to what it spends on R&D globally. \"[But] bringing some of that back to the US - again that's a really smart political move to make these large announcements in order to demonstrate commitment to US industry.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/c89yxk1egkgo",
        "headline": "Historic visual effects studio Technicolor collapses in UK",
        "date": "2025-02-24",
        "content": "Technicolor, the visual effects (VFX) group which has worked on films ranging from Disney's 1940 classic Pinocchio to 2024 blockbuster Mufasa The Lion King, has collapsed into administration in the UK. The group owned several leading visual effects studios including MPC, Mikros Animation and The Mill, with operations in the US, UK, Canada and India. Technicolor's directors had been looking to sell the business, but were not able to find a buyer. Its administrators said \"the majority\" of the more than 440 people it employed in the UK have been made redundant. The appointment of administrators relates only to the UK arm of its business. \"The economic headwinds which are affecting companies right across the creative industries have proved too challenging to overcome, which has led to Technicolor's UK business being placed into administration today,\" the firm's joint administrator Nick Holloway said. Technicolor was founded in 1915 and worked on its first film in 1917. In its early days it worked on projects with major studios including Disney. It subsequently acquired major VFX studios including The Mill, which won an Oscar in 2001 for its work on Gladiator, and MPC, which recently delivered big budget remakes of Disney's The Lion King and Jungle Book. Recent projects include \"Kraven the Hunter,\" \"Young Woman and the Sea\" and \"Emilia Perez\" according to Variety. Mikros Animation projects include two recent Mutant Ninja Turtles titles and the Paw Patrol series of films. Visual effects studios play a key role in film production. Most modern big-budget movies and television shows will rely heavily on visual effects to transport actors and audiences into outer space, the distant past or the deep sea. And the appearance and non-vocal performances of characters and creatures, fantastic and otherwise will often be partly or fully the creation of animators and other specialist staff. As well as purely animated films and TV, many live action releases are in large part the work of the employees of VFX studios. Many staff work film-to-film on fixed-term contracts, so redundancies may not reflect the total impact of the business' troubles on jobs. According to animation news publisher Cartoon Brew an email sent over the weekend by chief executive Caroline Parot said \"external headwinds\" had exacerbated problems caused by factors including post-covid recovery. She also said the US writers' strike which led to a slow-down in demand for VFX work causing \"severe\" pressure on cashflow. Those same issues will add to the anxiety of staff and may fear re-entering what has been a relatively lean jobs market for VFX professionals. \"Render in peace\" one self-described 13-year veteran of The Mill wrote on Reddit - a reference to the computationally intense process of producing final, film grade images, a process known as rendering."
    },
    {
        "url": "https://www.bbc.com/news/articles/cwyjx9dn38wo",
        "headline": "Waspi women threaten legal action over pensions row",
        "date": "2025-02-24",
        "content": "Campaigners have threatened the government with legal action unless it reconsiders the decision to refuse compensation to millions of women affected by an increase in the state pension age. The Women Against State Pension Inequality (Waspi) group is demanding payouts for 3.6 million women born in the 1950s who were not properly informed of changes first introduced in the 1990s. The government apologised that the changes were not communicated quickly enough but told the BBC it \"cannot justify paying for a £10.5bn compensation scheme at the expense of the taxpayer\". Waspi chair Angela Madden said: \"We believe this is not only an outrage but legally wrong.\" The \"letter before action\" that has been sent to the government is a formal mechanism to allow it a chance to respond before the campaigners seek a judicial review at the High Court in two weeks time. Last year the parliamentary ombudsman recommended payouts of up to £2,950 each because of a 28-month delay in writing to inform the women affected of the changes. Waspi campaigners have claimed women suffered financial hardship and had to rethink retirement plans. However in December, Work and Pensions Secretary Liz Kendall apologised for the delayed communications but said there was \"considerable awareness\" of the changes to the pension age. She said sending letters earlier would not have made a difference to their ability to make retirement choices. Her claim there was no direct financial loss could now be examined in court if the campaigners get approval for their judicial review. Ms Madden said: \"We will not allow the DWP's gaslighting of Waspi women to go unchallenged. \"The government has accepted that 1950s-born women are victims of maladministration, but it now says none of us suffered any injustice.\" With no compensation forthcoming she said: \"The alternative is continued defence of the indefensible but this time in front of a judge.\" The Waspi group has also launched a crowd-funding campaign to try to cover an estimated £75,000 in legal fees. If the women were to win their case it is estimated it could cost the government as much as £10.5bn. With government finances already under strain because of weak economic growth and higher borrowing costs, Sir Keir Starmer has said \"the taxpayer simply can't afford the burden\" of compensation. The changes were first decided in 1995 when the then-Conservative government sought to equalise the age at which men and women received their state pensions, aiming that by 2020 everyone would have to wait until their 65th birthday. However in the aftermath of the global financial crisis in 2010, the Conservative-Lib Dem coalition decided to speed up the changes, to reduce the overall cost of the state pension. Other countries have made similar decisions in recent years - however the UK government did not communicate its change quickly enough and the impact of that could now be examined in court. A government spokesperson told the BBC on Sunday it accepted the ombudsman's finding of maladministration and had apologised for the 28-month delay in writing to 1950s-born women. \"However, evidence showed only one-in-four people remember reading and receiving letters that they weren't expecting and that by 2006, 90% of 1950s-born women knew that the state pension age was changing,\" they said. \"Earlier letters wouldn't have affected this.\" Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday."
    },
    {
        "url": "https://www.bbc.com/news/articles/cy05n9xn1nqo",
        "headline": "Virgin Media internet restored after earlier outage",
        "date": "2025-02-24",
        "content": "An issue which left thousands of Virgin Media O2 customers unable to access the internet has been resolved, the firm says. Downdetector, which tracks websites, showed more than 10,000 people reported their broadband was not working on Monday morning. Users first began flagging issues shortly after 10:00 GMT. \"We have now fully restored services for all customers, following an earlier outage,\" a spokesperson told the BBC. The company had said in an earlier statement it was aware of some customers experiencing \"intermittent issues\" with their services. The firm says on its website that together with O2, it represents more than 45 million mobile, broadband, home and phone customers across the UK. It reported having 5.7 million broadband customers in October 2024. While user reports to Downdetector have fallen from their morning peak, many Virgin Media customers have continued to flag connectivity issues on social media. The Student Loans Company has told users on its social media accounts it is among those affected by the outage. \"We're currently having problems due to a Virgin Media outage, this means we can only give general guidance when you contact us and you might have a longer wait time,\" it said in a Facebook post . It told the BBC it experienced \"connectivity issues\" which have since been resolved. Virgin Media has declined to comment on the cause of the outage. Its X account told one complainant asking for more information that it \"rarely\" provides information about root causes to customers. In January 2024, Ofcom said that Virgin Media was the UK's most-complained about broadband provider . It has since improved in Ofcom's standings and in February 2025 the regulator found it had fewer complaints than TalkTalk, EE and NOW Broadband."
    },
    {
        "url": "https://www.bbc.com/news/articles/ckg1xjpnkl2o",
        "headline": "UK and India relaunch trade talks in Delhi",
        "date": "2025-02-24",
        "content": "India and the UK have restarted free trade talks, nearly a year after negotiations were paused ahead of general elections in both countries. Jonathan Reynolds, the UK's business and trade secretary, met his Indian counterpart Piyush Goyal in Delhi on Monday and kicked off the two-day discussions. The talks focused on \"advancing\" the negotiations and ensuring that the deal was \"balanced, ambitious and mutually beneficial\", Goyal wrote on X. The countries have held more than a dozen rounds of negotiations since 2022, but an agreement has remained out of reach. Sticking points include high tariffs in India on Scotch whisky and relaxing fees and visa rules for Indian students and professionals going to the UK. Talks are being held for the first time after the Labour Party came to power in the UK and Reynolds says securing a deal is a \"top priority\" for his government. \"Growth will be the guiding principle in our trade negotiations with India and I'm excited about the opportunities on offer in this vibrant market,\" he said in a statement ahead of the meeting. India is forecast to become the world's third-largest economy in a few years. The ministers held a joint press conference after the meeting, but neither side offered a deadline for talks to conclude. Deadlines set by former ministers Boris Johnson and Liz Truss had passed without an agreement being finalised. For Delhi, the trade talks have assumed renewed significance on the back of US President Donald Trump's decision to impose reciprocal or tit-for-tat tariffs on imported goods from countries, including India. The UK is also a high-priority trading partner for Prime Minister Narendra Modi's government, which has an ambitious target to grow exports by $1 trillion by FY30. The UK had announced in November last year - soon after Sir Keir Starmer met PM Modi at the G20 summit in Brazil - that talks would restart in the new year. The two countries share a trade relationship worth £41bn ($52bn) currently, according to a UK government statement, and a trade deal could unlock new opportunities for both countries. London has identified sectors that could benefit, which include advanced manufacturing, clean energy and professional and trade services. An agreement could also potentially unlock a valuable market for British cars, Scotch whisky and financial services worth billions of dollars. India is seeking greater mobility for its working professionals and students to the UK, while pushing for faster visa processing times. It may also seek concessions for its residents working temporarily in the UK on business visas, who are required to pay national insurance but are still ineligible for social benefits. Speaking at the joint conference, Goyal said that immigration was not a part of the discussions. \"India has never ever discussed immigration in any free trade negotiations,\" he said. Reynolds added that business mobility was a \"separate issue\" from immigration. During Reynolds' visit, he and Goyal will also visit the BT office in the northern Indian city of Gurugram. UK Investment Minister Poppy Gustafsson is also in India and will be participating in events in India's two big business hubs - Mumbai and Bengaluru. After years of scepticism over free trade deals, India has been signing agreements or is in talks with several countries or blocs. Last year, it signed a $100bn free trade agreement with the European Free Trade Association - a group of four European countries that are not members of the European Union - after almost 16 years of negotiations. It is also set to resume negotiations with the European Union this year. Follow BBC News India on Instagram , YouTube, Twitter and Facebook ."
    },
    {
        "url": "https://www.bbc.com/news/articles/c20le8jn282o",
        "headline": "What minerals does Ukraine have and what are they used for?",
        "date": "2025-02-26",
        "content": "Ukraine has agreed to the outline of a major deal that would give the US access to Ukraine's mineral deposits, a senior official in Kyiv has told the BBC. Kyiv has faced growing pressure from Washington to sign the deal, which has been at the centre of a rift between the US and Ukrainian presidents. Kyiv estimates that about 5% of the world's \"critical raw materials\" are in Ukraine. This includes some 19m tonnes of proven reserves of graphite , which the Ukrainian Geological Survey state agency says makes the nation \"one of the top five leading countries\" for the supply of the mineral. Graphite is used to make batteries for electric vehicles. Ukraine has 7% of Europe's supplies of titanium , a lightweight metal used in the construction of everything from aeroplanes to power stations. It is also home to a third of all European lithium deposits, the key component in current batteries. Other elements found in Ukraine include beryllium and uranium , which are both crucial for nuclear weapons and reactors. Deposits of copper , lead , zinc , silver , nickel , cobalt and manganese are also significant. Further, Ukraine has significant deposits of rare earth metals . These are a group of 17 elements that are used to produce weapons, wind turbines, electronics and other products vital in the modern world. Some of the mineral deposits, however, have been seized by Russia. According to Yulia Svyrydenko, Ukraine's economy minister, resources worth $350bn (£277bn) remain in occupied territories today. In 2022, SecDev, a geopolitical risk consultancy based in Canada, conducted an evaluation, which established that Russia had occupied 63% of Ukrainian coal mines, as well as half of its manganese, caesium, tantalum and rare earth deposits. Dr Robert Muggah, principal of SecDev, says that such minerals add a \"strategic and economic dimension\" in Russia's continued aggression. By seizing them, he says, Moscow denies access to revenue for Ukraine, expands its own resource base and influences global supply chains. Critical minerals \"are the foundation of the 21st Century economy\", Dr Muggah explained. They are key to renewable energy, military applications and industrial infrastructure and play \"a growing strategic role in geopolitics and geoeconomics\", he said. Additionally, the US is keen on a deal for Ukraine's mineral resources because it wants to reduce dependency on China, which controls 75% of rare earth deposits in the world, according to the Geological Investment Group. In December, China banned the export of some rare earth minerals to the US, having previously limited mineral exports to the US the previous year. Some commentators have described the US offer as \"colonial\", but Kyiv is interested in joint exploration of its resources. According to the World Economic Forum, Ukraine has about 20,000 mineral deposits covering 116 types, but only about 15% of sites were being actively exploited at the time of Russia's full-scale invasion in 2022. For instance, the country's sizeable lithium deposits are still largely untapped. Likewise, rare earth deposits are known to exist, but none of them have yet been mined, because of a lack of investment. Developing these mineral resources is extremely difficult and expensive, according to Iryna Suprun, chief executive of the Geological Investment Group, a mining advisory firm based in Ukraine. She argues that if Ukraine can attract US investors to help develop its natural resources, it will be highly beneficial for the country's economy. \"We will get technologies that our mining industry lacks so much,\" Ms Suprun explained. \"We will get capital. That means more jobs, tax payments. We'll receive revenue from the development of mineral deposits.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cde98k6e2dno",
        "headline": "Can Canadians get the world drinking tree sap?",
        "date": "2025-02-24",
        "content": "While drinking tree sap does not immediately sound appealing, Canadian producers are hoping that it will be the next must-try soft drink around the world. We have all heard of maple syrup, which is made by boiling down the sap of maple trees to produce a thick, sweet, golden-to-brown coloured syrup that is typically poured over pancakes. What is far less well known is that you can drink the sap itself, which is called maple water. Clear in colour, it contains just 2% natural sugars, so it is only slightly sweet. A small but growing number of producers in Canada are now selling this maple water in bottles or cartons, after first giving it a filter and pasteurisation to kill off any microbes. \"People feel like they're drinking the wild Canadian forest,\" says Yannick Leclerc of Maple3, a producer of maple water drinks, based in Quebec City. Advocates point to the fact it is a natural drink, and makers hope that it can steal some sales from the existing similar product – coconut water. The latter is made from water that naturally forms inside coconuts. As Canada is far and away the world's largest producer of maple syrup – accounting for more than 80% of production – it is understandable that the nascent maple water sector is also Canadian. Furthermore, it is centred on the province of Quebec, which makes 90% of Canada's maple syrup. Mr Leclerc says that Maple3 is one of the pioneers of the sector. \"Nobody [previously] thought about keeping the sap for its hydration purposes verses just boiling it into syrup.\" He founded the company back in 2013 with business partner Stéphane Nolet. In recent years an increasing number of other producers have entered the marketplace. Mr Leclerc claims that Maple3 has doubled its annual profits since 2021, with sales not just rising across Canada, but in 12 other countries, including France, Japan, Singapore and South Korea. Some 75% of its sales now come from overseas, and it sells both still and sparkling maple water, and fizzy versions with added natural fruit flavourings. \"It's more than just a local product at this point,\" adds Mr Leclerc. For the maple water industry as a whole, one recent report predicts big growth. It estimated that global sales in 2024 totalled $506m (£409m), with that expected to jump to $2.6bn by 2033. By comparison, worldwide sales of coconut water reached $7.7bn in 2023, with that expected to grow to $22.9bn by 2029. So maple water has a long way to catch up. Meanwhile, the global value of the maple syrup market was $1.7bn last year, according to one study. Beth Czerwony, a dietician with the non-profit medical centre Cleveland Clinic in Ohio, says the growing popularity of maple water is linked to its perceived health benefits. \"When the sap itself is filtered through the tree, it ends up absorbing a bunch of antioxidants,\" she says. \"So they're gonna end up having a better performance and a faster workout recovery.\" However, one medical study from 2019 concluded that maple water was \"was not superior in rehydration\" to normal water. Jeremy Kinsella owns The Soda Pop Bros in Windsor Ontario, which sells soft drinks under its own brand name, as well as imports from around the world. His family have been in the industry for nearly a century, and in his lifetime he has seen a fair share of trends come and go. He says that if maple water is to go mainstream it needs the financial backing and promotion of one of the huge global soft drinks firms. \"It will take a larger soda manufacturer for it to really catch on,\" he says. Mr Kinsella also says that the price of maple water is currently too high. \"When it comes down to it, someone's looking at a can of Coke for a buck and they're looking at a can of maple water for three bucks, they're going to try it a couple of times and go back to Coke,\" he says. Marketing maple water more would certainly help it increase sales, says John Tomory, who helps run Pefferlaw Creek Farms in Uxbridge, Ontario. He and his brothers have been making maple syrup commercially for almost 10 years, and for the past four they have also been selling the sap to a Canada brand called Sap Sucker. This makes sparkling sap water with different added flavours, from lime to grapefruit, and lemon to orange. Mr Tomory says he agrees with this approach to make the sap more interesting. \"I know a lot of people have tried just selling the sap as it is, just basic sap from the tree and it's still, but they haven't really caught on,\" he says. \"So I think carbonating it and adding fruit flavour makes it more interesting. That's the real innovation.\" Back at Maple3 in Quebec, Mr Leclerc also thinks that the sparkling version of the drink could be the more popular: \"It has perks that a normal sparkling water doesn't have,\" he says, such as a more interesting flavour, without having all the bad stuff that [regular] soda has.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cpq9zxxn72qo",
        "headline": "Will quantum computers disrupt critical infrastructure?",
        "date": "2025-02-21",
        "content": "Twenty five years ago computer programmers were racing to fix the millennium bug amidst fears that it would cause banking systems to crash and planes to fall out of the sky. Much to everyone's relief the impact turned out to be minimal . Today, some fear there is a new critical threat to the world’s digital infrastructure. But this time, we cannot predict exactly when it will move from theory to reality, while the ubiquity of digital technology means fixing the problem is even more complicated. That’s because the arrival of quantum computing means that many of the encryption algorithms that underpin and secure our hyperconnected world will be trivially easy to crack. Quantum computing is radically different to the “classical” computing used today. Instead of processing binary bits which exist in one of two states – one or zero, on or off – quantum computing uses qubits, which can exist in multiple states, or superpositions. “The reason why it's so powerful is because you're doing all those possible computations simultaneously,” Prof Nishanth Sastry, director of research for computer science at the University of Surrey, explains. This means it's “much, much more efficient, much, much more powerful.” This means quantum systems offer the possibility of solving key problems that are beyond classical computers, is areas such as medical research and materials science, or cracking particularly complex mathematical problems. The problem is some of those same mathematical problems underpin the encryption algorithms that help to ensure trust, confidentiality and privacy across today’s computer networks. Today’s computers would take thousands, even millions of years, to crack current encryption standards, such as RSA. A suitably powerful quantum computer could, theoretically, do the job in minutes. This has implications for everything from electronic payments and ecommerce to satellite communications. “Anything that's protected by something that's vulnerable becomes fair game for people that have access to quantum relevant computers,” says Jon France, chief information security officer at non-profit cybersecurity organization ISC2. Quantum computers capable of breaking asymmetric encryption are thought to be years away. But progress is being made. In December, Google said its new quantum chip incorporates key \"breakthroughs\" and \"paves the way to a useful, large-scale quantum computer\". Some estimates say a quantum device capable of breaking current encryption would require 10,000 qubits, while others say millions would be needed. Today’s systems have a few hundred at most. But businesses and governments face a problem right now, as attackers could harvest encrypted information and decrypt it later when they do gain access to suitably powerful devices. Greg Wetmore, vice president for software development at security firm Entrust, says if such devices could emerge in the next decade, technology leaders need to ask, “What data in your organization is valuable for that period of time?” That could be national security information, personal data, strategic plans, and intellectual property and secrets - think of a soft drink company’s “secret” formula or the precise balance of herbs and spices in a fast food recipe. Mr France adds, if quantum computing becomes widespread, the threat becomes more immediate with the encryption that protects our daily banking transactions, for example, potentially trivial to break. The good news is that researchers and the technology industry have been working on solutions to the problem. In August, the National Institute of Standards and Technology in the US released three post quantum encryption standards. The agency said these would “secure a wide range of electronic information, from confidential email messages to e-commerce transactions that propel the modern economy.” It is encouraging computer system administrators to transition to the new standards as soon as possible, and said a further 18 algorithms are being evaluated as backup standards. The problem is this means a massive upgrade process touching virtually all our technology infrastructure. “If you think about the number of things out there with asymmetric encryption in them, it's billions of things. We're facing a really big change problem,” says Mr France. Some digital infrastructure will be relatively easy to upgrade. Your browser, for example, will simply receive an update from the vendor says Mr France. “The challenge really comes in discrete devices and the internet of things (IOT),” he continues. These might be hard to track down, and geographically inaccessible. Some equipment – legacy devices in critical national infrastructure such as water systems, for example – might not be powerful enough to handle the new encryption standards. Mr Wetmore says the industry has managed encryption transitions in the past, but “It's the sharper discontinuity that makes this threat more serious.” So, it is trying to help customers build “crypto agility” by setting out policies now and using automation to identify and manage their cryptographic assets. “That's the secret to making this transition an orderly one and not a chaotic one.” And the challenge extends into space. Prof Sastry says many satellites – such as the Starlink network – should be relatively straightforward to upgrade, even if it means briefly taking an individual device offline temporarily. “At any given point in time, especially with the LEO (low earth orbit) satellites, you've got 10 to 20 satellites above your head,” Prof Sastry says. “So, if one can't serve you, well so what? There are nine others that can serve you.” More challenging, he says, are “remote sensing” satellites, which include those used for geographical or intelligence purposes. These carry a lot more compute power on board and typically include some sort of secure computing module. A hardware upgrade effectively means replacing the whole device. However, says Prof Sastry, this is now less of a problem thanks to more frequent and lower cost satellite launches. While the impact of the millennium bug might have been minimal in the first days of 2000, that's because an immense amount of work had gone into fixing it ahead of a known deadline, says François Dupressoir, associate professor in cryptography at the University of Bristol. By contrast, he adds, that it is not possible to predict when current encryption will become vulnerable. \"With cryptography,\" says Mr Dupressoir \"If somebody breaks your system, you will only know once they've got your data.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cj91xgylkwlo",
        "headline": "Georgia's richest man said to be moving funds to avoid US sanctions",
        "date": "2025-02-20",
        "content": "Last spring, when tens of thousands of Georgians were protesting against what they saw as a clear sign of Russian influence on the country's politics, Georgia's parliament rushed through amendments to the nation's tax code. Transparency International (TI) Georgia, the anti-corruption watchdog, wrote at the time that the change – which allows tax-free transfer of assets from offshore accounts to Georgia – may have been introduced to serve the interests of the country's richest person and former prime minister, Bidzina Ivanishvili. He is the founder and honorary chairman of the country's ruling party, Georgian Dream. \"Now it is clear, those changes were made for him,\" says senior economics analyst at TI Georgia, Beso Namchavadze. With an estimated wealth of $4.9bn (£3.9bn), Mr Ivanishvili made his money in 1990s Russia, in computing, metals and banking. Most of his wealth is believed to be tucked away in offshore companies. Georgia was plunged into political crisis and daily street protests last May when the country's MPs passed the contentious \"transparency on foreign influence bill\", often dubbed the \"foreign agents law\". Under this legislation, media and non-governmental organisations that receive more than 20% of their funding from abroad have to register as \"organisations acting in the interest of a foreign power\", submit themselves to stringent audits, or face punitive fines. It was widely seen as a move to prevent US and other Western influence on the country. Protests then continued when the Georgian Dream-led government won disputed parliamentary elections in October. Protests were spurred again at the start of December when it said it would be putting EU accession talks on hold. Hundreds of peaceful protesters were arrested and severely beaten up by the police. In response to this crackdown, the US government announced sanctions against Mr Ivanishvili at the end of last year. There is also the possibility of sanctions from the UK. Last month James MacCleary, a Liberal Democrat MP, introduced an Early Day Motion in the UK parliament calling on the government to impose sanctions on Mr Ivanishvili. The motion expressed \"deep concern at the suspension of Georgia's EU accession process and the increasing use of excessive force against peaceful protesters\". TI Georgia estimates that if the UK imposed sanctions on Mr Ivanishvili his entire business empire would be affected, because he has holding companies registered in two British Overseas Territories - British Virgin Islands and Cayman Islands. \"All his big business, which he has in Georgia, in the hospitality sector, in the energy sector, all the parent companies of these Georgian companies, the last beneficiaries are registered in these so-called offshore territories,\" says Beso Namchavadze. He adds that TI Georgia believes that Mr Ivanishvili and other family members are continuing to transfer ownership of companies they previously controlled through offshore entities to newly established firms in Georgia. In January of this year, paintings and other artwork worth nearly $500m were imported into Georgia, according to data published by the Ministry of Finance. Many believe the artwork was from Mr Ivanishvili's valuable collection. \"For everybody who knows him it's pretty clear that this is something that he values the most out of all the assets, and all the wealth, that he has,\" says Tina Khidasheli, Georgia's ex-defence minister and the head of the non-governmental organisation Civic Idea. \"He is going to bring paintings back and he does not want to pay tax on it.\" The head of Georgia's parliamentary committee on finance and budget, Paata Kvijinadze, recently defended the tax-free transfer of assets from offshore accounts to Georgia. \"If anyone benefited from this law, I am happy about it,\" he said in a post on social media. \"This is exactly what the law was meant to be: to bring companies from offshore zones and attract more investments into the country\". In response to the proposed UK sanctions, Georgia's ruling party issued a statement defending Mr Ivanishvili, saying that a threat of sanctions was \"without any foundation\" against the party founder who brought \"democratic breakthrough to the country\". Separately, Mr Ivanishvili's lawyer announced last month that his client is suing Swiss bank Julius Baer for, among other reasons, misinterpreting \"the so-called\" American sanctions, which the lawyer described as \"political blackmail\". The US sanctions on Mr Ivanishvili call for his assets to be frozen, and place restrictions on US citizens and companies from doing business personally with him, but they do not affect his companies or family members. For more than a decade Mr Ivanishvili has been involved in legal battles with another Swiss bank, Credit Suisse, over fraud and mismanagement of his money. Some believe that the billionaire's mistrust of the West and increased use of conspiracy theories at home, such as accusing adversaries of being part of the \"global war party\", or \"deep state\", originate in his long-standing financial grievances. Ever since he became convinced that Credit Suisse was part of a grand conspiracy against him, says Tina Khdasheli. \"Bidzina Ivanishvili held Georgia hostage to his personal financial issues.\" Experts say that even though Mr Ivanishvili's current official position is the honorary chairman of the ruling party, there is a clear understanding that he remains the number one person in Georgian politics. Sanctions against him are therefore seen as sanctions against the entire government. Nika Gilauri was prime minister of Georgia from 2009 to 2012. He now leads a private company called Reformatics, which advises governments around the world on economic reform. Mr Gilauri says that Georgia's continuing political instability and international isolation is negatively impacting the economy. \"We are seeing a very negative effect on FDI, foreign direct investment, if you take nine months of 2024 compared to nine months of 2023, we have a 40% drop. So going forward this is going to continue to get worse.\" But the Georgian government paints a different picture. Last month Georgia's Prime Minister Irakli Kobakhidze signed a $6bn inward investment agreement with UAE property group Emaar. Levan Davitashvili, the Minister of Economy described it as the \"largest foreign investment deal\" in decades, which was expected to contribute 1.5% growth to the economy. Prime Minister Irakli Kobakhidze has even suggested that 10% growth was now \"absolutely realistic\" for the Georgian economy. But recently published research by Policy and Management Consulting Group (PMCG), a Georgian research firm, said that the prospect for the next six months was \"extremely negative\". It highlighted the impact of the continuing political turmoil, and said that the suspension of EU membership talks \"was negatively viewed by all surveyed economists\". Mr Gilauri of Reformatics says their own analysis shows that Georgia's economic growth this year will be zero. \"Going forward, we will have a budgetary problem, a currency exchange problem. We will have an inflation problem. We will have a jobs problem, a job creation problem, and we will have economic decline problem. \"Having new elections is the only way forward for the country as well as for Bidzina Ivanishvili personally.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/c2dl93l7w2go",
        "headline": "Hair: 'It’s just thrown away but it's gold'",
        "date": "2025-02-17",
        "content": "Zeeshan Ali has been a drag artist for 10 years and has taken his show all over India. Central to his performance is a collection of around 45 wigs. “It’s an alter of identity, helping me transition from my everyday self into exaggerated, glamorous or whimsical characters. The right wig makes me feel more authentic and empowers me to command the stage,\" says Ali, who is based in Mumbai. But getting that look right wasn't easy in the early days. \"When I started my career the accessibility of the wigs was extremely difficult in India. Most of them were to be sourced from abroad or I used to make wigs sourced from whatever was available to me like wool, fabric,\" he says. But things are different now. “The trend is changing. Wigs are no longer just meant for drag or movie artists, but many straight women wear wigs to look different. It's no longer just a hair accessory but a style statement.” Indian hair has always been in demand for wig-making. The nation is the world's biggest exporter of human hair, supplying 85% of global demand. Kolachi Venkatesh, based in Avadi, Chennai, has been collecting hair for 20 years. He started at the bottom of the industry as a picker - collecting hair from households and rescuing it from the rubbish. “My parents were hair pickers and then I started doing the same,\" he says. Hair collected by pickers from homes, salons and barbershops is called non-Remy hair. It requires more processing than Remy hair, which is carefully shaved straight from the scalp. Nevertheless, it has value. \"It’s just thrown away but it's gold,\" says Mr Venkatesh. Those pickers typically sell hair to local traders like Mr Venkatesh for between 10 cents and $1 (£0.80) per kilogram, depending on the quality and length of the hair. Shorter or damaged hair fetches less, while longer strands bring higher prices. For the individual picker, there's not much money in it. “A diligent collector might gather 1–5 kilograms of hair in a day, earning anywhere from 59 cents to $6 per day. This income level is often below minimum wage standards, particularly in rural areas,” says Mr Venkatesh, who has 50 pickers working for him. “While our work contributes to a billion-dollar global market our earnings remain meagre. Intermediaries control prices.” Most of the Indian hair collected by traders like Mr Venkatesh is exported to China where it is made into wigs. “China has a huge wigmaking industry which is worth five to six billion dollars,\" says Benjamin Cherian from Plexconcil, the hair industry body that promotes the Indian industry and liaises with the government. If India wants a slice of the lucrative wig market, he says, then it has a lot of catching up to do. \"When we look at China there are hundreds of factories spread across the country which add value to the hair industry, whereas in India the value addition still needs to be picked up,” Mr Cherian says. He says the government needs to help promote investment in the hair industry. \"It needs automated sorting systems, sophisticated hair treatment procedures for the hair collected, innovative production techniques for manufacturing of wigs which will make India stand out.” Instead of exporting hair for hundreds of dollars, India should be selling wigs worth thousands of dollars says Mr Cherian. “We have started working on it but it’s a long way to go. We need to have research and training centres,\" he says. One Indian business trying to make inroads is Delhi-based Diva Divine Hair, co-founded by Krishan Jalani in 2019. It is currently managed by chief executive and co-founder Nidhi Tiwari. The idea was to create high-quality hair extensions and wigs that would appeal to a broader range of customers. \"There is a growing need for these solutions due to rising issues of hair loss and thinning among women in India,\" says Ms Tiwari. The company has been helped by a shift in attitude. \"Once considered a niche or taboo topic, wigs and extensions are now openly discussed, thanks to evolving social norms and a shift toward acceptance,\" she says. Wigs have also seen a lot of development making them more attractive and comfortable. \"Technologies such as 3D-printed wigs and digital colour-matching tools offer highly personalised options. Lightweight, breathable wig caps and improved adhesives have given customers to wear it for long time without discomfort,\" says Ms Tiwari. At the top end of the hair market is Temple or Remy hair. Much of the supply comes from Hindu temples in the south of the country where hair is shaved off in an act of veneration and faith. Raj Hair International is one of the biggest traders in the Temple hair business. Craftsmen at the company's Chennai factory sort and grade the hair according to colour, texture and length. \"Remy hair has aligned cuticles, hair flows uniformly in one direction, which leads to less tangling and a silkier texture. This is high-value hair,\" says George Cherion, the company's chief executive. The firm tries to waste as little of the hair as possible. To help with that it developed a machine to untangle the hair. It's allowed them to work faster with fewer staff. \"Our mission is to constantly upgrade the technology,\" says Mr Cherion. Business is booming. \"Indian human is in demand globally due to its high quality, natural look, and thinness. The demand is skyrocketing,\" he says. Back in Mumbai Zeeshan Ali wants to see more Indian wigs on the market. As well as making them more affordable, he has a design suggestion: \"A wig that can create a wow factor.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cm2l1y73mz1o",
        "headline": "Scientists work on 'superhuman' vision systems for robots",
        "date": "2025-02-14",
        "content": "If you want to find out whether your robot can see through smoke, well, you're going to need some smoke. But a University of Pennsylvania student got a shock when they began setting up a late night experiment to test such a robot. Shortly after flicking the switch on the smoke machine, a loud fire alarm went off. \"The whole building got triggered,\" says Mingmin Zhao of the University of Pennsylvania, smiling. \"My student called me. He was very surprised.\" The incident was a minor setback for the team developing a robot equipped with a innovative radio-based sensing system. Radio waves could allow robots or autonomous vehicles to see through thick smoke, intense rain – or even around corners. Such waves can even detect concealed weapons. But simulating visual imagery based on radio waves is an unusual approach for robots and autonomous vehicles. Much more established in those fields are regular optical cameras, light detection and ranging (Lidar), and other sensors. However, Prof Zhao and his students have developed a potentially powerful way for robots to see using radio waves. Of course radar, which uses radio waves, has been used for decades to track aircraft, ships and the weather. But the spinning array on Prof Zhao's robot throws radio waves in all directions. An on-board artificial intelligence (AI) system then builds a 3D view of the environment with this information. \"What we have been trying to do here is basically help robots obtain superhuman vision – to see in scenarios where human eyes or traditional visual sensors cannot,\" explains Prof Zhao. He suggests the technology could help a future search-and-rescue robot save people from a burning building. Subsequent tests of the bot used a clear plastic box full of smoke placed around the its spinning equipment, in order to avoid triggering any nearby fire alarms. Although humans can't see them, radio waves are a form of light in the sense that they are part of the electromagnetic spectrum, which also includes X-rays and gamma rays. Only a small part the spectrum is classed as visible light. Being light, radio waves can reflect off surfaces and materials, though in a slightly different way to visible light. Prof Zhao and his colleagues have designed their robot so that it can sense these radio wave reflections . The crucial factor here is that radio waves are much longer than visible light waves meaning they are not blocked by tiny smoke particles. Prof Zhao says he has also been working on adapting the technology so that the robot can see part of the way round a corner. Think of it like a hall of mirrors, he suggests, just for radio waves rather than visible light. \"It's really very interesting work and quite impressive,\" says Friedemann Reinhard at the University of Rostock in Germany, who was not involved in the work. In 2017, Prof Reinhard and colleagues described how Wi-Fi signals could allow spies to see into private rooms . One slight limitation is that the spinning array cannot, by definition, see in all directions at once. Prof Reinhard says that a lot of data processing carried out by the system appears necessary to clean up the image that results from this spinning device. However, the robot sends out radio waves in the millimetre wave band (waves that are between one and ten millimetres long). This is the same technology used for some 5G installations. \"That's potentially very attractive, it's a very well understood, cheap technology,\" says Prof Reinhard. \"I certainly would love to see a self-driving car driving only on radar.\" But it is possible to avoid using spinning radio-emitting devices to get a full picture, says Fabio da Silva, founder and chief executive of US firm Wavsens, which is also developing radio-based sensing technology. \"We created an algorithm that allows you to sense the entire space instantaneously and continuously so we don't have to spin our antennas,\" he says. He describes the system as akin to echolocation, used by bats. It sends out radio waves and \"listens\" to how the waves come back, which reveals the shape of whatever they have hit. Some researchers have used radio waves to detect concealed weapons such as hidden handguns and knives. Radio waves can even \"fingerprint\" the details of a room. Then, if scanned again later, this would reveal whether any objects in the room have been moved. Last year, scientists in Germany proposed that countries use this method to scrutinise other countries' management of their nuclear weapons stockpiles. It would be one way of knowing whether someone had been moving the warheads around, for example. Separately, Luana Olivieri at Loughborough University has explored using a different form of non-visible electromagnetic radiation, terahertz waves. These are shorter than radio waves but longer than visible light waves. \"This wavelength is particularly unexplored,\" says Dr Olivieri. It is possible to see through objects and analyse materials using this form of radiation, she adds. Such a system could even, in theory, identify specific drugs by detecting their chemical structure. But while seeing through materials could help a rescue bot find a trapped person in some future disaster, it also has other applications. Police forces and militaries have access to radio-based technology that allows them to see through doors and walls, to some extent. \"Warfighting is definitely one market that it caters to. It can be used to find and kill someone,\" says Mr da Silva. He has exhibited Wavsens' technology to the US Department of Defense and the Israeli Ministry of Defense, he says. And yet these applications are not entirely surprising, suggests Prof Reinhard, who points out that a range of emerging technologies have, in principle, made it easier to detect and attack people. \"Maybe radar sounds scary – but drones and cheap cameras are the much more dangerous thing,\" he says."
    },
    {
        "url": "https://www.bbc.com/news/articles/cq8kn5v37wxo",
        "headline": "Why don't Europeans buy more American cars?",
        "date": "2025-02-14",
        "content": "Donald Trump is threatening to introduce big tariffs on EU car imports, unhappy that Europeans don't buy more American vehicles. But why are US cars, with the notable exception of Tesla, not more popular in Europe? Italy's ancient towns and cities, with their narrow, cobbled streets, offer an obvious explanation why, in the words of US President Donald Trump, Europeans \"don't take our cars\". Or as car industry analyst Hampus Engellau puts it: \"Try to go around Italy in a big SUV. I've done it, and it's very difficult\". Add cost to the question, and it becomes obvious why you don't see too many American pick-up trucks on European roads, observes Mike Hawes, CEO of The Society of Motor Manufacturers & Traders, which represents the industry in the UK. \"We tend to have higher fuel prices than the Americans, so we prefer smaller, more fuel-efficient vehicles, while they generally prefer larger vehicles.\" Mr Engellau, who works for Swedish investment bank Handelsbanken Capital Markets, also highlights petrol prices being substantially cheaper in the US. \"They pay per gallon what we pay per litre,\" he says. There are 3.8 litres to one US gallon. Yet these differences have done little to deter European carmakers from gaining market share in the US. Again, in the words of Mr Trump, the US has \"millions of cars coming in - BMW, Mercedes, Volkswagen and many others\". In 2022, 692,334 new EU-made cars were exported to the US, worth €36bn ($37bn; £30bn). While only 116,207 new US-made cars went in the opposite direction, for €5.2bn. This imbalance is caused by unfair trading rules and needs correcting, according to Mr Trump. \"Mr Trump is concerned because the terms of trade are not really equal,\" explains Mr Engellau, pointing out that the EU's 10% tariffs on cars imported from the US far exceeds the 2.5% tariffs the US – currently - charges on cars imported from the EU. These disparities have prompted Trump to say he wants to raise US tariffs on European automotive imports. He has already announced 25% import tariffs on steel and aluminium imports, two metals crucial for carmakers. Trump's move appears to have prompted EU officials to consider reducing their own tariffs in order to protect Europe's automotive industry from a potential trade war. Trump's intervention has not impressed Jim Farley, the boss of US carmaker Ford. \"So far what we've been seeing is a lot of cost and a lot of chaos,\" NBC News recently reported him as saying. In fact, the very focus on trade is perhaps misplaced, according to automotive industry veteran Andy Palmer, formerly the chief operating officer of Nissan and CEO of Aston Martin, and currently a consultant. \"If you can help it, you don't want to ship cars around the world. They're big boxes of expensive air,\" he says. The automotive industry is global, adds the SMMT's Mr Hawes, so carmakers generally want to \"manufacture close to where the customer is based\". As such, several European carmakers, most notably marques such as BMW, Mercedes and Audi, are making some of their largest cars in North America, and some of these vehicles are exported back to Europe. US carmakers have historically pursued similar strategies in Europe. General Motors owned and manufactured European marques such as Opel/Vauxhall and Saab, but it sold the former in 2017, and shut the latter back in 2009. Meanwhile, Ford offloaded Aston Martin in 2007, Jaguar and Land Rover in 2008, and Volvo in 2010. After years of losing money, Ford is currently redirecting its European business towards electric and commercial vehicles and away from small, affordable cars, such as its Focus models. Ford plans to cut 800 jobs in the UK and 2,900 jobs in Germany by 2027, which represents a 14% reduction in its 28,000-strong European workforce. Elon Musk's Tesla has a factory near Berlin in Germany, where it makes its Model Y cars for the European market, but even here there are headwinds as low-cost Chinese imports in particular see their share of Europe's market for electric cars grow. Europe is a very tough marketplace for carmakers, according to Jose Asumendi, head of European automotive research at JP Morgan, an investment bank. \"You need to have the right products, and you need to run the manufacturing plants well.\" He also points to brands having a competitive advantage in their home countries, be it BMW, Mercedes, Volkswagen and Audi in Germany, Peugeot, Citroen and Renault in France, or Fiat and Alfa Romeo in Italy. \"There's a natural inclination for people to buy local champions, especially in Germany, France and Italy,\" explains Mr Asumendi. He adds that while other European countries are more open to different brands, the market is crowded, with a slew of Japanese, South Korea, and, increasingly, Chinese cars. Adding to Europe's complexities for overseas carmakers are different taxation regulations, and the need to communicate in many different languages. Mr Palmer does not think \"European customers have any particular objections to American cars\", and Mr Asumendi agrees. \"I think Europeans do like American brands, but there are many other brands available in Europe, so competition is fierce,\" he says. Mr Trump's ambition is to make the US car industry stronger, by bringing more production and innovation home. But Mr Palmer insists that a car trade war with Europe will not deliver this. Not least, he says, since tariffs tend to \"insulate the beneficiaries from the free market, and this merely makes them lazy, so they stop innovating and fail to remain competitive\". \"It's not about trade,\" adds Mr Palmer. \"It's about investment and collaboration.\""
    },
    {
        "url": "https://www.bbc.com/news/articles/cednp178dwdo",
        "headline": "Erasing Escobar: Will Colombia ban the sale of memorabilia of the drug lord?",
        "date": "2025-02-13",
        "content": "A proposed law in Colombia's Congress seeks to ban the sale of merchandise that celebrates former drug lord Pablo Escobar, whose cocaine cartel has been linked to thousands of murders. One day in 1989, Gonzalo Rojas was at school in the Colombian capital of Bogota when a teacher pulled him out of class to deliver some devastating news. His father, also called Gonzalo, had died in a plane crash that morning. \"I remember leaving and seeing my mum and grandma waiting for me, crying,\" says Mr Rojas, who was just 10-years-old at the time. \"It was a very, very sad day.\" Minutes after take off, an explosion on board Avianca flight 203 killed the 107 passengers and crew, as well as three people on the ground who were hit by falling debris. The blast wasn't an accident. It was a deliberate bomb attack by Pablo Escobar and his Medellín cartel. While an era defined by drug wars, bombings, kidnappings and a sky high murder rate has largely been relegated to Colombia's past, Escobar's legacy has not. The notorious criminal, who was killed by security forces in 1993, has achieved a near cult-like status around the world, immortalised in books, music and TV productions like the Netflix series Narcos. In Colombia itself, his name and face are adorned on mugs, keychains, and t-shirts in tourist shops catering mainly to curious visitors. But a proposed law in Colombia's Congress is seeking to change this. The bill wants to ban Escobar merchandise - and that of other convicted criminals  - to help put an end to the glorification of a drug boss who was central in the global cocaine trade and widely held responsible for at least 4,000 killings. \"Difficult issues that are part of the history and memory of our country cannot simply be remembered by a T-shirt, or a sticker sold on a street corner,\" says Juan Sebastián Gómez, Congress member and co-author of the bill. The proposed law would prohibit the selling, as well as the use and carrying of clothing and items promoting criminals, including Escobar. It would mean fines for  those who violated the rules, and a temporary suspension of businesses. Many vendors selling the goods claim a law prohibiting this merchandise would harm their livelihoods. \"This is terrible. We have a right to work, and these Pablo T-shirts especially always sell well,\" says Joana Montoya, who owns a stall stocked full of Escobar merchandise in Comuna 13, a popular tourist zone of Medellín. Medellín, Escobar's hometown, was known as \"the most dangerous city in the world\" in the late 80s and early 90s due to violence associated with drug wars and Colombia's armed conflict. Today it's been revitalised into a hub of innovation and tourism, with vendors eager to cash in on the influx of visitors wanting to take home souvenirs - some related to Escobar. \"This Escobar merchandise benefits many families here - it sustains us. It helps us pay our rent, buy food, look after our kids,\" says Ms Montaya, who supports herself and her young daughter. Ms Montoya says at least 15% of her sales come from Escobar products, but some sellers tell the BBC that for them it's as much as 60%. If the bill is approved there would be a defined time period for sellers to familiarise themselves with the new rules and phase out their Escobar stock. \"We'd need a transition phase so that people could stop selling these products and replace them with other ones,\" explains Congressman Gómez. He says that Colombia has more interesting things to show than drug lords, and that the association with Escobar has stigmatised the country abroad. Some of the T-shirts, sold for around £5, bear a catchphrase linked to Escobar - \"silver or lead?\".  This symbolises the choice the cartel boss gave to those who posed a threat to his criminal operations: accept a bribe or be killed. Shop assistant María Suarez believes that the profit gained from sales of Escobar merchandise isn't ethical. \"We need this ban. He did awful things and these souvenirs are things that shouldn't exist,\" she says, explaining that she feels uncomfortable that her boss stocks Escobar items. Escobar and his Medellín cartel at one point were believed to have controlled 80% of the cocaine entering the US. In 1987, he was named as one of the richest people in the world by Forbes magazine. He spent some of his fortune developing deprived neighbourhoods, but many people consider this as a tactic to buy loyalty from some segments of the population. Years on from his father's death, Mr Rojas remembers him as a calm and responsible man, who loved his family. For him, the bill is a defining moment. \"It's a milestone in the road about how we reflect on what is happening in terms of the commercialisation of images of Pablo Escobar in order to correct it,\" says Mr Rojas. Yet he does have criticisms about the proposals. He believes the bill doesn't focus enough on education. Mr Rojas recalls a day many years ago when he met a man wearing a green T-shirt with a silhouette of  Escobar, and the words \"Pablo, President\". \"It caused me such confusion that I wasn't able to say anything to him about it,\" he says. \"There needs to be more of an emphasis on how we deliver different messages to new generations, so that there isn't a positive image of what a cartel boss is.\" Mr Rojas has actively been involved in efforts to reshape narratives around Escobar and the drug trade. Along with some other victims, he launched narcostore.co in 2019, an online shop that appears to sell Escobar-themed items. But none of the products actually exist and when customers select an item they are shown a video testimony from a victim. Mr Rojas says the site has attracted 180 million visits from around the world. In Colombia's Congress, the bill faces four stages it needs to pass before it can become law. Gómez says he's hoping it sparks reflection both inside and outside of Congress. \"In Germany you don't sell Hitler T-shirts or swastikas. In Italy you don't sell Mussolini stickers, and you don't go to Chile and get a copy of Pinochet's ID card. \"I think the most important thing the bill can do is to generate a conversation as a country - a conversation that hasn't happened yet.\" Medellín's mayor  - who was also a presidential candidate in the 2022 elections - has publicly backed the bill, calling the merchandise \"an insult to the city, the country and the victims\". In El Poblado, an upmarket area of Medellín popular with tourists, three Americans browse a stall brimming with souvenirs. One buys a cap with Escobar's name and face printed on the front. He says he wants a memento of \"history\". But for supporters of the bill, this isn't about removing Escobar from history, it's about erasing a mythical construct of him, fostering new ways to honour the victims he killed - and acknowledging the lingering pain of victims left behind."
    },
    {
        "url": "https://www.bbc.com/news/articles/cz6pzwj6qq7o",
        "headline": "Germany's once-mighty car industry is in crisis. What will it take to fix it?",
        "date": "2025-02-12",
        "content": "For decades, car-making has been the jewel in Germany's industrial crown, a powerful symbol of the country's famous post-war economic miracle. Its \"Big Three\" brands, Volkswagen, Mercedes-Benz, and BMW, have long been praised for their performance, innovation and precision engineering. But today, the German motor industry is struggling. With the faltering economy a key factor in federal elections this month, how can it get back on the road to recovery? When you arrive by train in Wolfsburg, Lower Saxony, the first thing you see is the Volkswagen factory. Its huge facade, emblazoned with a giant VW logo and flanked by four tall chimneys, dominates one bank of the canal that runs through the city. The 6.5 sq km (2.5 sq mile) complex sits adjacent to the Autostadt, a kind of theme park devoted to the automobile and to VW, Europe's biggest carmaker. The Volkswagen Arena, a sports stadium, is a short distance away. Wolfsburg is Germany's answer to mid-20th Century Detroit - not so much a city with a car factory as a factory with a city that has grown up around it. Some 60,000 people from across the region work in the plant, while the town itself has a population of around 125,000. Locals say that even if you don't work in the factory yourself, it's certain many of your friends will, along with half of your class from school. \"Wolfsburg and Volkswagen - it's kind of a synonym,\" explains Dieter Landenberger, the VW Group's in-house historian, as he looks lovingly at an early model Beetle. It is one of an array of beautifully restored classic cars in the Zeithaus – a huge, glass-fronted museum in the Autostadt dedicated to icons of the motor industry. \"We're proud of the plant,\" he says. \"It is a symbol of that period in the 1950s when Germany had to reinvent itself and rebuild after the war. It was a kind of motor for the German economic miracle.\" Today, however, the plant has also come to symbolise some of the main problems affecting the German car industry as a whole. The Wolfsburg factory is capable of building 870,000 cars a year. But by 2023 it was making just 490,000, according to the Cologne-based German Economic Institute. And in Germany it is far from alone. Car factories across the country have been operating well below their maximum capacity. The number of cars produced in Germany declined from 5.65m in 2017 to 4.1m in 2023, according to the International Organisation of Motor Vehicle Manufacturers. All of this matters deeply as the German public prepares to go to the polls on 23 February. The car industry is not just a source of national pride; it is also a significant driver of national wealth. Disagreements over how to resolve the country's economic malaise were a factor in the collapse of the coalition government in November. Whoever is in power after the election will inevitably need a plan to revive the economy – and getting the motor industry back in gear is likely to play an important role. Car-making makes up about a fifth of the country's manufacturing output, and if the supply chain is taken into account, it generates around 6% of GDP, according to Capital Economics. The industry employs some 780,000 people directly – and supports millions of other jobs. It's not just production that is down. Sales of cars made by German brands are far lower than they were just a few years ago. Between 2017 and 2023, those of VW fell  from 10.7m to 9.2m, while over the same period BMW's went from 2.46m to 2.25m and Mercedes-Benz's went from 2.3m to 2.04m, company reports show. All of the Big Three saw their pre-tax profits fall by about a third in the first nine months of 2024, and each warned that their earnings for the year as a whole would be lower than previously forecast. The development of electric cars has sucked up huge investment, but the market for them hasn't grown as quickly as expected, while foreign competitors are flexing their muscles. The threat of tariffs being imposed by the US and other governments also looms large. \"There are so many crises, a whole world of crises. When one crisis is over, another is coming up,\" is how Simon Shütz, a spokesman for the German Automotive Industry Federation (VDA) puts it. Car sales across Europe have been declining since 2017, according to Franziska Palmas, a senior Europe economist at Capital Economics. \"Lately they've recovered a bit, but they're still around 15 to 20% lower than they were at the peak in 2017,\" she says. \"That's partly due to factors like the pandemic, the energy crisis. But it's also cars lasting longer  - and people already have a lot of cars in Europe. So demand has been weak.\" Another key factor has been the aforementioned transition to electric cars. Since the diesel emissions scandal of 2015 – in which VW was found to have rigged emissions tests in the US – the industry has been undergoing a technological revolution. With the EU and European governments determined to phase out petrol and diesel cars over the next decade, manufacturers have had little choice but to invest tens, and collectively hundreds of billions of Euros on developing electric models and building new production lines. However, although electric cars do now make up a significant share of all cars sold – 13.6% in the EU and 19.6% in the UK last year, for example – their market share has not been growing as quickly as anticipated. And in Germany itself, the sudden removal of generous subsidies for electric car buyers in late 2023 actually contributed to a dramatic 27% fall in sales of all electric cars within the country last year, making life still more difficult for German firms in their home market. \"The decision to drop subsidies suddenly – that was very bad, because it undermined trust among our customers,\" says the VDA's Simon Schütz. \"Going from the combustion engine to electric mobility is very big process. We are investing billions in rebuilding all the factories. And so that takes some time, there's no question about it.\" While all of this has been going on, German manufacturers have also been grappling with another serious concern. Doing business in Germany itself, operating factories here and employing hundreds of thousands of people, is very expensive. Workers in the automotive sector have traditionally enjoyed generous pay and benefits thanks to agreements drawn up between unions and management. According to Capital Economics, in 2023 the average monthly base salary in the German auto industry was about €5,300, compared with €4,300 across the German economy as a whole. For years, this approach gave German-based companies certain advantages, for example in avoiding industrial unrest and in attracting and retaining talented staff. However, it also led to German car manufacturers having the highest labour costs in the global industry. In 2023, these averaged €62 per hour, compared to €29 in Spain and €20 in Portugal, according to the VDA. The situation for Germany's domestic car industry became more acute following Russia's invasion of Ukraine. This choked off Germany's once-abundant supplies of cheap Russian gas, at the very time when the country was phasing out nuclear power. The result was a sharp increase in energy prices. Although they have since subsided, energy costs for industrial users in Germany remain very high by international standards. \"Energy prices here are three to five times higher than in the US, or in China – much higher than for our main competitors,\" says Mr Schütz. And this is being felt across the industry, not just at the carmakers themselves. \"From the Thysenkrupp and Salzgitter steel mills producing the sheet metal rolls that are later turned into doors and bonnets, to makers of smaller components used in drivetrains, costs have exploded as a result of high energy prices,\" says Matthias Schmidt of Schmidt Automotive Research. Last year these pressures came to a head. At VW, which has 45% of its global staff in Germany, managers finally decided radical action was needed to bring down costs. \"It was a very big shock,\" IG Metall union spokesman Steffen Schmidt tells me over a cup of coffee near the VW factory in Wolfsburg. \"The company didn't say anything publicly.\" It was left to Daniela Cavallo, head of the powerful VW works council and the top employees' representative, to deliver the news. \"They held a big meeting outside the gates of the factory. Thousands of workers – and you could have heard a pin drop,\" says Mr Schmidt. \"They were stunned. Thousands of people, all completely silent.\" What VW proposed was unprecedented. Union representatives had come to meetings expecting to negotiate an annual pay rise. They were asking for a 7% boost. Instead, they were told, the company needed them to take a 10% pay cut. Worse was to follow. The company said it might have to close up to three of its factories within Germany itself – and was tearing up a job security agreement that had been in place for decades. Arne Meiswinkel, VW's chief negotiator, said at the time that the situation it faced in Germany was \"very serious\" and that \"Volkswagen will only be able to prevail if we future-proof the company now in the face of rising costs and the massive increase in competition\". Volkswagen had never previously closed a German factory in its 87-year history. In the face of intense opposition from unions and politicians, and following short but disruptive \"warning strikes\" by unionised workers, the idea was ultimately shelved. But the very fact it had been put forward sent a seismic shock through the entire sector. In the meantime, the workforce did agree to painful limits on pay and bonuses, and VW said it would cut more than 35,000 jobs by the end of the decade, albeit in a \"socially responsible manner\" that avoided compulsory redundancies. Less conspicuously, Mercedes-Benz also launched a cost-cutting drive last year, aimed at saving several billion euros annually - albeit compulsory redundancies in the German workforce are highly unlikely, as a job security agreement effectively rules them out until 2030. Meanwhile Ford, which operates two factories in Germany, recently announced plans to cut 2,800 jobs in the country. Not all of the German car industry's problems are confined to Germany itself. With the European market saturated, for several decades the continent's manufacturers have looked for growth elsewhere. One of the most lucrative markets has been China, where for a while the growing middle class had an apparently insatiable appetite for upmarket European vehicles. VW, Mercedes-Benz and BMW all teamed up with local businesses, setting up factories in China itself to meet local demand. But now that source of growth is drying up. The Big Three have all seen sales fall recently  – in 2023 VW's China sales were down 9.5% on the previous year, Mercedes-Benz's by 7% and BMW's by 13.4%. Their combined share of the Chinese market has shrunk as well to 18.7%, from a peak of 26.2% in 2019. This appears to be the result of a slowing Chinese economy, falling interest in expensive, foreign-badged cars and the rapid growth of local marques, especially in the electric car market. \"Not that long ago, Western brands represented quality and trust,\" explains Mark Rainford, founder of the Inside China Auto website. However, he says, since then the reputation and appeal of Chinese brands has improved beyond recognition. All of the Big Three say trends in China have had a significant impact on their earnings. Chinese brands are also attempting to build a share of the European market, helped by their much lower operating costs than more established rivals, both because wages are lower in China and because, as pure EV firms, they don't have the same legacy costs carried by manufacturers making the transition from petrol and diesel to battery-powered cars. According to the European Commission, Chinese brands also benefit from hefty government subsidies, which allow them to sell cars at artificially low prices. In October, the EU introduced extra tariffs on imports of Chinese-made EVs, in an effort to create a more level playing field. German firms opposed the EU tariffs, because they feared retaliation from China could affect their own exports. Now they also face the threat of new protectionist measures being introduced by the Trump administration, including possible tariffs on cars shipped from the EU. For an industry that relies heavily on exports, the rise of protectionism is a growing threat. \"We know that trade wars only create losers on both sides. Tariffs will cost wealth, cost growth and cost jobs,\" says the VDA's Simon Schütz. Although some of the pressures facing Germany's car companies were not foreseeable, there was still an element of complacency, believes analyst Matthias Schmidt: \"They knew the structural issues were there, but were blindsided by cheap Russian gas,\" he says. \"The expansion to China and the high profits being shipped back to Europe plastered over the high labour cost issues, giving unions a joker card to play with. \"Germany has effectively been an export-driven market, and once those markets sneeze, Germany catches a cold, which is what's happened.\" So can Germany's carmakers revive their fortunes? It is a vital question for the manufacturers, for their networks of suppliers and for the country as a whole. \"The problem for Germany is we are not competitive,\" says Dr Ferdinand Dudenhöffer, head of the Bochum-based Center for Automotive Research. \"Not just in cost terms, but also in terms of the new technologies which will run the world in future\". He thinks China has become the centre of gravity for innovation in areas such as digitisation and battery technology. \"The solution for the carmakers and for the suppliers, in my view, will be that they take their factories abroad,\" he says. Simon Schütz is more optimistic. He thinks the industry can prosper, but only if it gets the support it needs from the government after the elections later this month. \"Our automotive industry will be world-leading, I am sure of that,\" he says. \"The question is, where will the future jobs be? Will they be in Germany, because we can build cars here, or will our companies go elsewhere?' For union rep Steffen Schmidt, however, the solution is to go back to Germany's traditional industrial values. \"We have to become a leader in innovation and technology again,\" he says. \"Then we can keep high pay and good conditions for workers.\" He thinks the path ahead for the new government is very clear: \"Invest, invest, invest. In infrastructure, in technology, in green energy and in education.\" For tens of thousands of workers in Wolfsburg, and in Germany's other \"car towns\" such as Ingolstadt, Weissach, Munich, Stuttgart and Zwickau, the stakes could not be higher. Top picture credit: Getty images BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below."
    },
    {
        "url": "https://www.bbc.com/news/articles/c23v3kxknrno",
        "headline": "Why do kindness influencers get criticised?",
        "date": "2025-02-11",
        "content": "Growing up, Samuel Weidenhofer struggled with his mental health after losing his aunt to suicide when he was nine, experiencing a speech impediment, and being bullied. The trauma of it all made him want to end his own life, he says. When he was 17, he says he decided to turn to social media to spread a positive message. \"It started with simple things like giving people hugs in public and giving out roses and flowers and things that would make people smile,\" says Weidenhofer, now 21, and living in Melbourne, Australia. The difference was Weidenhofer filmed these acts and shared them across his social media accounts. The content spiralled and four years later, on Instagram alone he has amassed 1.7 million followers, where he can be seen surprising a person with a serious illness with money or a visit from a celebrity such as Jake Paul or Kristen Bell. \"I hope my videos inspire someone just a little bit,\" he says. Kindness content creators, or influencers as they're often called, are increasing in numbers on social media. Their approaches differ but a common tactic is to secretly film someone being given money, or tickets to a gig or sports match, or perhaps a free haircut. \"Kindness is cool,\" says Zachery Dereniowski, 31, in the bio of his Instagram account where he has 5.7 million followers. Mr Dereniowski's videos often involve him telling a stranger that he is hungry and asking for food. When the person helps him out, he rewards the person with a gift, such as a laptop, or money. \"I suppose I want to really emphasise that every single person you come across has a story… and often the people who have the least give the most,\" says Mr Dereniowski, who lives in Windsor, near Toronto in Canada, and started the account after giving free hugs to strangers. Like many influencers, the kindness creators make money from adverts and sponsorship from the brands they work with. For example they might do a deal that involves giving away a particular brand's product. The videos of kindness content creators attract millions of views. Why are they so popular? Saoirse Cleary, creative strategy director at marketing agency MG Empower, says they incorporate many of the elements that both social media algorithms and audiences favour: strong hooks, engaging captions, heartfelt narratives, and authentic, unscripted moments. \"Audiences are captivated by raw, real interactions with everyday people, offering an emotional connection from the comfort of their own screens. People increasingly seek positivity, authenticity, and emotional resonance in their online experiences, especially in spaces often saturated with entertainment-driven content.\" On the face of it the acts seem well meaning, so why do they attract criticism? \"\"While these influencers may be genuinely generous... the generosity can sometimes feel performative, as it often serves as a way to attract more views, engagement, and ultimately financial reward, rather than purely altruistic motives,\" says Ms Cleary. Others go further, questing whether focussing on one, usually vulnerable person, is the right way to help out. \"I find the typical set up of many of the scenes quite disturbing,\" says Hilda Burke, a psychotherapist, accredited with the British Association for Counselling and Psychotherapy. She explains that the videos often involve someone being identified as \"in need\". They are then asked for a favour. It might be spare money for a bus fare or help with something. She argues the participant is being \"lured\" into valuing the needs of someone else, who appears richer, more highly than their own. Only if they do that are they rewarded. \"I wonder what happens to those who don't play the game?,\" asks Ms Burke. The influencers defend themselves by arguing that using social media this way is an effective strategy. \"I can raise more money, so I can help more people if I post it online,\" says Mr Weidenhofer. And how about filming people without their consent? \"If you are doing a video where you're giving a hug to someone, if you tell them beforehand, it just takes away that authenticity,\" says Mr Weidenhofer. But he adds that these days he avoids filming people without consent as it was making him \"feel weird\". Sometimes large amounts of money are given to vulnerable people, which they might not be in a position to manage. Mr Dereniowski realised that this might be an issue when he raised $240,000 overnight for a father and son who were living in their car. After that, more thought goes into longer term help. \"We've started setting up financial advisors. We've started getting these people jobs. We've helped allocate the funds properly to pay off their debt, their car, helping them get a home and [pay their] rent,\" he says. If you have been affected by any of the details in this story, you can get help and support from the BBC Action Line ."
    },
    {
        "url": "https://www.bbc.com/news/articles/clyzp7j84yro",
        "headline": "The debate: Do Trump's tariffs mean the end of the post-war free trade world?",
        "date": "2025-02-11",
        "content": "President Trump's sweeping set of tariffs is intended, in part, to protect American industries, raise money and - as we've seen - be used as a bargaining chip. The Republican has already imposed tariffs on imports from China , announced plans for a 25% duty on all steel and aluminium imports , and threatened to place 25% tariffs on Canada and Mexico. We don't yet know how far he will go, but if what is already on the table comes to pass then it would raise average tariffs to their highest since the 1940s, signalling a new chapter for global trade. Since the end of World War Two in 1945, tariffs have been broadly viewed as leading to higher consumer prices, less choice and – amidst the inevitable retaliation -  backfiring on the industries they were meant to protect. But are we turning our backs on this era? I hosted a debate with two economic experts in trade policy to unpick the implications of Trump's policies on America and the world, and explore differing views on who among us might be the biggest winners or losers. Meredith Crowley is Professor of Economics at the University of Cambridge. She believes tariffs could lead to a much heavier economic burden on the lowest income people. Jeff Ferry is Chief Economist Emeritus at the Coalition for A Prosperous America. He believes tariffs can trigger growth and rebuild the US manufacturing industry. Dharshini David (DD): President Trump described tariffs as \"the most beautiful word in the dictionary\" - which is really intriguing. What's the attraction for him? Jeff Ferry (JF): I think Trump has made it pretty clear that he thinks tariffs are a 'beautiful' thing for several reasons. Firstly, because they can revive and rebuild the US manufacturing industry. He also sees the US is running a huge trade deficit. In 2024, we had a record goods trade deficit of $1.2 trillion which means the rest of the world, and particularly trade surplus countries, is generating large amounts of revenue by selling to the US market. This gives the US a powerful negotiating tool and we've seen him use that, regarding drugs and immigration with Canada and Mexico in the last few days. Meredith Crowley (MC): My presumption is that what is really concerning Trump is the decline in manufacturing jobs within the United States over the last 40 years. He observed that lots of jobs that used to exist in the US have migrated to other lower wage countries like Mexico and China and I think his hope would be that by imposing tariffs he could stimulate the creation of jobs. DD: We know countries are thinking of retaliatory measures as well. To what extent will these measures impact Trump's economic goals? JF : There is no doubt that a tariff policy, coupled with an investment and growth strategy policy and a national security policy, will grow the US economy and do a better job of delivering productivity growth than we've seen in the last 25 years, which frankly have been abysmal by traditional US standards. Five hundred years of history shows that the economics profession, in its obsession with short term equilibrium, has done a disservice to not just American workers and the American people, but actually, to British people and British workers - and workers in many countries. DD: In the post-war era, we saw the tearing down of trade barriers and the idea that globalisation was good. Are we now seeing a backlash against this? JF : We are seeing a historic shift away from the post WW2 consensus, which stemmed from the period when America was way ahead of the rest of the world - and America was very worried about the Communist threat. So what you call 'free trade,' and I would call the Bretton Woods fixed exchange rate consensus, was designed for America to support and even subsidise the growth of European economies and other economies. We've now moved to a new stage where it's well known the US economy started to falter in the 1970s, and China has risen to become the world's number one manufacturing power basically through exploiting all the rules in the system. We need a new system. MC : I have a different diagnosis of what happened in recent history. Over the past 40 years, it's clear more protection is very popular. Between 1981 and 1994, the US restricted imports of automobiles from Japan and that ultimately had two consequences. One, it raised the price of automobiles for Americans. Two, in the long run, it led to investment by Japanese manufacturers in the US, and today, the US has a vibrant automobile industry.  You could support US industry much more directly by having direct government support. Trump has now created uncertainty that Canadian manufacturers will have access to the US market in the future. And because Trump made good on his threats in 2018 to impose tariffs on China, major corporations might be revising plans to expand operations in Canada or Mexico to serve the US market. There will be a pullback on real economic activity in those trading partners. DD : Meredith, Trump has acknowledged there may be 'a little pain' for Americans in the short term because as you mentioned, tariffs tend to mean higher prices. MC :  A study on what happened in round one of Trump's tariffs on China in 2018 showed, in the first two years, that most of the cost increase was absorbed by importers and distributors and it didn't get passed on to consumers. The price increases though, tend to come more gradually. Once you realise the tariff is in place permanently, the manufacturer realises everyone's going to have to pay it and they gradually raise their prices. One of the concerns economists have is people who buy a lot of goods rather than services tend to be lower income people. So when you put a tariff on things like kids' trainers, backpacks and clothing, these kinds of consumer items, you're really placing a much heavier tax burden on the lowest income people in the country, rather than somebody who's spending their money on vacations and private education for children. DD : Jeff, are you concerned about a global trade war that could backfire on Trump's aims? JF : We have been in a trade war since 2001, since China entered the world trading community. The trade war is long-standing. Now America is taking action and a lot of people are throwing up their hands, not because they are concerned about a trade war, but because they're concerned they might lose a valuable market for their own products. But I want to go back to consumer prices. People focus purely on the negative. The purpose of the tariff is to stimulate domestic industry, so on the positive side, you create brand new investments in domestic industry. On the negative side you get a price increase. So it depends critically on the numbers in both cases. What we know from round one of Trump's tariffs, between 2018 and 2019, is the price of tariff goods went up, such as steel, but companies committed to building new factories like steel mills which have hired several hundreds of people - great blue collar jobs for people who generally speaking do not have a college degree. The current phase of globalisation which began around 1990 was just a huge mistake. The idea that the US could compete with Mexico on salaries, particularly to manufacturing workers, was just crazy. DD : Lets get Meredith's view on this. Would you agree that for higher wage economies, frankly, globalisation has not been a great idea since the 1990s? MC : I understand Jeff's point, that the only concern of the president should be the wellbeing of Americans. But, between 1990 and 2023, the number of people around the world living in extreme poverty on less than $2.15 (£1.75) a day fell from two billion to around 700 million. Over a billion people exiting poverty because of increasing globalisation is an astounding achievement of humanity. It is completely clear to everyone that within American society the benefits of globalisation have not been equal and so there is a real need within the US to think about how do we improve the wellbeing of less skilled people, and how do we get jobs into the economy to help them. Where I differ with Trump is I think there are more effective tools. You need an industrial policy or subsidies to production. American productivity is so high because we are constantly investing in labour saving technology but the consequence is that the less skilled have been left behind and their lives are materially worse than they were thirty years ago. JF : I agree one hundred percent with Meredith. DD : This is fascinating. If we see the kind of trade barriers that Trump wants to put in place, what does that mean for this issue of equality? MC : Once you start putting barriers between countries you create a lot of opportunity for what in the economics world we call monopoly profits. Once you limit entry, the existing producers get to jack up their prices and exploit consumers. If the US goes into a trade war with China, what's going to happen to imports from countries the US isn't interested in having a trade war with? If the US and China deepen their trade war, this could affect the supply chain participation of sub-Saharan African countries with the US and China, meaning it is going to be one of the areas of the world that bears some of the brunt of this trade war. So the spillover effects could be very, very negative. DD :  Jeff, is this a price worth paying? What kind of impact could we see on growth? JF : I don't think of it as a price worth paying, I think of it as an evolution of the world system where hopefully we'll get higher growth everywhere. And this is where I differ with the mainstream economics view which focuses far too much on trade and on minor productivity gains. The world has grown through the success of industries. The US prosperity from 1900 to 1970 was due largely to the automobile industry. What you saw was huge productivity gains as Henry Ford and all his successors invented and developed mass production. You saw wage increases and spending increases and we had the most prosperous economy in the world. So what we need is industrial growth and when you look at a national security framework, we cannot be dependent on China for as many goods as we are today. We are far too dependent on China here in the United States, Europe is far too dependent on China. So what's the resolution? Well the resolution is pretty obvious - we need to make certain goods here in the US.  Produced by: Rosemary McCabe, Rhoda Buchanan and Harriet Whitehead Top picture credit: Getty Images This transcript has been edited for clarity and brevity. BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below."
    },
    {
        "url": "https://www.bbc.com/news/articles/c5y7jmlyx02o",
        "headline": "How Spain's economy became the envy of Europe",
        "date": "2025-02-10",
        "content": "It's a chilly mid-winter afternoon in Segovia, in central Spain, and tourists are gathered at the foot of the city's Roman aqueduct, gazing up at its famous arches and taking selfies. Many of the visitors are Spanish, but there are also people from other European countries, Asians and Latin Americans, all drawn by Segovia's historic charm, gastronomy and dramatic location just beyond the mountains north of Madrid. \"There was a moment during Covid when I thought 'maybe tourism will never, ever be like it was before',\" says Elena Mirón, a local guide dressed in a fuchsia-coloured beret who is about to lead a group across the city. \"But now things are very good and I feel this year is going to be a good year, like 2023 and 2024. I'm happy, because I can live off this job I love.\" Spain received a record 94 million visitors in 2024 and is now vying with France, which saw 100 million, to be the world's biggest foreign tourist hub. And the tourism industry's post-Covid expansion is a major reason why the eurozone's fourth-biggest economy has been easily outgrowing the likes of Germany, France, Italy and the United Kingdom, posting an increase in GDP of 3.2% last year. By contrast, the German economy contracted by 0.2% in 2024, while France grew by 1.1%, Italy by 0.5%, and the UK by an expected 0.9%. This all helps explain why the Economist magazine has ranked Spain as the world's best-performing economy. \"The Spanish model is successful because it is a balanced model, and this is what guarantees the sustainability of growth,\" says Carlos Cuerpo,  the business minister in the Socialist-led coalition government. He points out that Spain was responsible for 40% of eurozone growth last year. Although he underlined the importance of tourism, Mr Cuerpo also pointed to financial services, technology, and investment as factors which have helped Spain bounce back from the depths of the pandemic, when GDP shrank by 11% in one year. \"We are getting out of Covid without scars and by modernising our economy and therefore lifting our potential GDP growth,\" he adds. That modernisation process is being aided by post-pandemic recovery funds from the EU's Next Generation programme. Spain is due to receive up to €163bn by 2026 ($169bn; £136bn), making it the biggest recipient of these funds alongside Italy. Spain is investing the money in the national rail system, low-emissions zones in towns and cities, as well as in the electric vehicle industry and subsidies for small businesses. \"Public spending has been high, and is responsible for approximately half our growth since the pandemic,\" says María Jesús Valdemoros, lecturer in economics at Spain's IESE Business School. Other major European economies have seen their growth stymied by their greater reliance than Spain on industry, which, she says, \"is suffering a lot at the moment due to factors such as the high cost of energy, competition from China and other Asian countries, the cost of the transition to a more sustainable environmental model and trade protectionism\". Since Covid, the other major economic challenge for Spain has been the cost-of-living crisis triggered by supply-chain bottlenecks and the Russian invasion of Ukraine in 2022. Inflation peaked at an annual rate of 11% in July of that year, with energy prices hitting Spaniards particularly hard, but by the end of 2024 it had fallen back to 2.8%. Madrid believes that subsidies it introduced to cut the cost of fuel consumption and encourage public transport use were key in mitigating the impact of the energy price rises, as well as several increases to the minimum wage. At the height of the European energy crisis, Spain and Portugal also negotiated with Brussels a so-called \"Iberian exception\", allowing them to cap the price of gas used to generate electricity in order to reduce consumers' bills. Mr Cuerpo argues that such measures have helped counter Spain's traditional vulnerability to economic turmoil. \"Spain is proving to be more resilient to successive shocks – including the inflation shock that came with the war in Ukraine,\" he said.  \"And I think this is part of the overall protective shield that we have put in place for our consumers and for our firms.\" The country's green energy output is seen as another favourable factor, not just in guaranteeing electricity, but also spurring investment. Spain has the second-largest renewable energy infrastructure in the EU. The latter is a boon for a country that is Europe's second-biggest car producer, according to Wayne Griffiths, the British-born CEO of Seat and Cupra. Although Spanish electric vehicle production is lagging behind the rest of Europe, he sees enormous potential in that area. \"[In Spain] we have all the factors you need to be successful: competitive, well-trained people and also an energy policy behind that,\" he says. \"There's no point in making zero-emission cars if you're using dirty energy.\" Despite these positives, a longstanding weakness of Spain's economy has been a chronically high jobless rate, which is the biggest in the EU and almost double the block's average. However, the situation did improve in the last quarter of 2024, when the Spanish jobless unemployment rate declined to 10.6%, its lowest level since 2008. Meanwhile the number of people in employment in Spain now stands at 22 million, a record high. A labour reform, encouraging job stability, is seen as a key reason for this. This reform increased restrictions on the use of temporary contracts by companies, favouring greater flexibility in the use of permanent contracts.  It has reduced the number of workers in temporary employment without hindering job creation. Also, although the arrival of immigrants has driven a fierce political debate, their absorption into the labour market is seen by many as crucial for a country with a rapidly ageing population. The Socialist prime minister, Pedro Sánchez, has been outspoken in underlining the need for immigrants, describing their contribution to the economy as \"fundamental\". The European Commission has forecast that Spain will continue to lead growth among the bloc's big economies this year and remain ahead of the EU average. However, challenges are looming on the horizon. The heavy reliance on tourism - and a growing backlash against the industry by local people - is one concern. Another is Spain's vast public debt, which is higher than the country's annual economic output. María Jesús Valdemoros warns that this is \"an imbalance that we need to correct, not just because the EU's new fiscal norms demand it, but because it could cause financial instability\". In addition, a housing crisis has erupted across the country, leaving millions of Spaniards struggling to find affordable accommodation. With an uncertain and deeply polarised political landscape, it is difficult for Sánchez's minority government to tackle such problems. But, while it attempts to resolve these conundrums, Spain is enjoying its status as the motor of European growth."
    }
]