[
    {
        "url": "https://www.cnbc.com/2025/03/26/tesla-drops-on-slowing-european-sales-concerns-about-trump-tariffs.html",
        "source": "cnbc",
        "headline": "Tesla shares drop on plunging European sales, concerns about Trump's tariffs",
        "content": "shares fell about 6% on Wednesday as data from Europe showed slowing sales last month, and investors grew increasingly concerned aboutPresident Donald Trump'splan for tariffs. The European Automobile Manufacturers' Association (ACEA) revealed on Tuesday that Tesla saw a 40% year-over-year drop in new vehicle registrations in Europe in February, while overall battery electric vehicle sales were up 26%. Meanwhile, the White Housesaidon Wednesday that President Trump will announce new tariffs on auto imports in the afternoon. The president has hyped April 2 as \"liberation day\" and \"the big one\" for rolling out his plan to impose heavy tariffs on foreign trading partners, but Trump hinted earlier this week that auto tariffs could arrive sooner. Movements of this magnitude have become commonplace for Tesla's stock. On 14 separate days this year, Tesla shares have gained or lost at least 5%. Wednesday's selloff, alongside a 2% drop in the Nasdaq, followed a five-day rally that included a12% jump on Monday. The trend for the year has been downward, particularly since President Trump began his second term in January, and brought Tesla CEOElon Muskwith him to the White House. As of mid-day Wednesday, Tesla was trading down about 36% since Inauguration Day, after falling 28% in February, the steepest drop for any month since December 2022. Following the ACEA report on Tuesday, RBC analysts wrote in a note that the February numbers only represented a drop of about 11,000 Tesla vehicle registrations in Europe, and emphasized that data for the month \"might not be indicative of true demand.\" New car buyers in Europe, the analysts said, \"could be holding out for the Model Y refresh,\" or a \"new affordable model,\" which they expect in the second half of the year. Tesla is set to fully ramp up production of the redesigned version of its Model Y SUV next month. The company implemented partial production shutdowns at certain factories earlier this year to upgrade Model Y manufacturing lines. Some prospective EV buyers have been turned off of late by Musk's political rhetoric and his work for the Trump administration, where he's leading an effort to slash federal government spending, cut the federal workforce, and has said he wants to privatize many services,including social security. William Blair analysts wrote in a note on Wednesday that, \"pushback from Musk's foray into politics\" has led to \"brand damage and even vandalism,\" for Tesla at a time when the company's supply has been impacted by its Model Y changeover, and \"Chinese competition continues to heat up.\" Still, the firm maintained its buy recommendation on Tesla's stock, pointing to growth in the company's energy storage business, and its prospects in driverless ride hailing. Musk has promised that Tesla will kick off a robotaxi service in Austin in June. The company has yet to begin production of its dedicated robotaxi, dubbed theCybercab. Waymo is already operating a commercial robotaxi service in Austin and other markets. And in China, several automakers are now offering an equivalent to Tesla's Full Self-Driving Supervised — a premium, partially automated driving system — as standard options rather than a paid service. In China this week, Tesla renamed its FSD system \"Intelligent Assisted Driving,\" according to CNEVPost, after previously branding it as \"Full Self-driving Capability.\" Tesla's system in all markets still requires a human at the wheel, ready to steer or brake at any time. WATCH:Tesla expectations 'near a bottom'",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-26 18:57:28",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/openai-expects-revenue-will-triple-to-12point7-billion-this-year-sources-say.html",
        "source": "cnbc",
        "headline": "OpenAI expects revenue will triple to $12.7 billion this year, source says",
        "content": "OpenAI expects revenue will triple to $12.7 billion in 2025, a source familiar with the situation told CNBC. The news comes one day after OpenAI announced a slew ofresponsibility changesfor C-suite executives. CEO Sam Altman will shift his focus away from day-to-day operations and focus more on research and product, the company said, while operating chief Brad Lightcap's role will expand to oversee the company's \"business and day-to-day operations.\" OpenAI faces intense competition in a generative AI \"arms race\" of sorts, from other high-valued startups like Anthropic and Perplexity and tech giants like Google and Microsoft, which has been the company's top backer and key strategic partner. Microsoft's AI business had over $13 billion in annual recurring revenue (ARR) in Q4, up 175% year over year. Bloombergwas first to report OpenAI's revenue expectations. This is breaking news. Please refresh for updates.",
        "tags": [
            "alphabet",
            "openai"
        ],
        "timestamp": "2025-03-26 19:02:58",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/25/amazon-testing-shopping-health-assistants-pushes-into-generative-ai.html",
        "source": "cnbc",
        "headline": "Amazon is testing shopping, health assistants as it pushes deeper into generative AI",
        "content": ", in an effort to infuse generative artificial intelligence across a wider swath of its e-commerce universe, recently began testing a shopping assistant and a health-focused chatbot with a subset of users. AI has become a major area of investment across Amazon, including in its retail, cloud computing, devices and health-care businesses. Within the retail business, Amazon has already launched a shopping chatbot, an AI assistant for sellers and AI shopping guides. The new services Amazon is testing appeared on its app or website in recent weeks. An Amazon spokesperson confirmed the features are being tested in beta with some customers. The shopping tool, called Interests AI, prompts users to describe an interest \"using your own words,\" and then it generates a curated selection of products. The feature lets consumers browse for products using more conversational language and is separate from the main search bar on Amazon's website.",
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-26 11:58:15",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/25/google-quantum-exec-says-tech-is-5-years-out-from-a-real-breakout-.html",
        "source": "cnbc",
        "headline": "Google quantum exec says tech is '5 years out from a real breakout'",
        "content": "One oftop executives working on quantum computers said he believe the technology is only five years away from running practical applications that can't be calculated on modern computers. Julian Kelly, Google Quantum AI's director of hardware, told CNBC's Deirdre Bosa that a quantum computer may be able to do cutting-edge physics and potentially generate new kinds of data. \"We think we're about five years out from a real breakout, kind of practical application that you can only solve on a quantum computer,\" said Kelly in an interview aired Tuesday. Quantum technology has enjoyed increased attention after Google announced a breakthrough in error correctionin Decemberthat the company said suggested a path to working quantum computers. , meanwhile, revealed a new quantum computing chip called Majorana in February. The company had to create an \"entirely new state of matter\" to get the chip to work, CEOSatya Nadellasaid. Google's most advancedquantum computer has 105 qubits, or the basic building block of a quantum computer, while experts say 1 million or more qubits will be needed for useful applications. Quantum computers have been a dream of physicists and scientists since the 1980s. While traditional computers are based around central processors or graphics processors with bits that are either 0 or 1, quantum qubits are on or off based on probability. \"Quantum computers speak quantum mechanics — they can access the way the universe works at the most fundamental level,\" Kelly said. The first applications for the technology will likely include using the system to simulate cutting-edge physics, Kelly said. That includes \"areas where you've got some system that's sort of just out of reach of what a classical computer to do,\" he added. Quantum computers may also be able to generate data used to train AI, although Kelly called this use \"speculative.\" He said that current artificial intelligence models fundamentally won't be able to work on quantum computers. \"One of the potential applications that you can think of for a quantum computer is generating new and novel data,\" Kelly said. The quantum computing field has also benefited in recent months from attention on artificial intelligence chips made byas investors search for another kind of next-generation processor that could spark a similar boom asgraphics processing units did during the recent wave of AI investment. Nvidia doesn't make quantum processors, but the company held a Quantum Day event last week where representatives from 12 leading quantum companies,and Microsoft talked about the potential of the technology. The chipmaker's summit came after Nvidia CEO Jensen Huang in January cast doubt on whether useful quantum computers would hit the marketin the next 15 years. Those comments caused the share prices of several public quantum companies to fall. Huang last week walked back his January comments,saying they were \"wrong,\"but he still signaled that he thought technology had a long way to go. \"Of course, quantum computing has the potential and all of our hopes that it will deliver extraordinary impact,\" Huang said last week. \"But the technology is insanely complicated.\"",
        "tags": [
            "nvidia",
            "microsoft",
            "alphabet"
        ],
        "timestamp": "2025-03-25 23:34:33",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/21/microsoft-posts-weekly-gain-to-end-longest-losing-streak-since-2008.html",
        "source": "cnbc",
        "headline": "Microsoft rallies in last 10 minutes of trading to avoid first eight-week losing streak since 2008",
        "content": "With about 10 minutes left until the market's close,stock was down for the week. It would've been the first eight-week losing streak since 2008. But the shares popped just before the end of trading, pushing the stock up 0.7% for the week to close at $391.26. It is still down 7% for the year. The last time Microsoft had a weekly slump like it has seen this year was between January and February 2008, when the country was in the middle of a financial crisis. Microsoft shares fell nine straight weeks. Microsoft's 2025 downdraft is notable as the company is viewed as central to the artificial intelligence boom. It has a hefty stake in OpenAI, is investing heavily in its Azure cloud infrastructure and has many products that are incorporating generative AI technologies. Along with its megacap peers, Microsoft has seen a recent pullback on concerns thatPresident Donald Trump'stariffs and massive cost cuts will hurt the economy, possibly leading to a recession. Since reaching a closing high of $467.56 in July 2024, Microsoft is down about 16%, pushing its market cap to $2.9 trillion. The company issueddisappointing revenue guidanceon Jan. 30. Within cloud and AI, competition is heating up across the board from rivals such as Amazon and Google, as well as from emerging startups. Earlier this week,announced its intent to acquire cloud security startup Wiz for$32 billion.",
        "tags": [
            "microsoft",
            "amazon"
        ],
        "timestamp": "2025-03-21 22:33:42",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/21/elon-musk-tells-tesla-employees-hang-onto-your-stock-in-all-hands.html",
        "source": "cnbc",
        "headline": "Elon Musk tells Tesla employees 'hang onto your stock,' urges vandals to 'stop being psycho'",
        "content": "DuringElon Musk'stwo months in Washington, D.C.,shares have been on aprecipitous decline,losing over 40% of their value. Protestsand campaigns against Tesla, Musk and his work in the Trump White House have erupted around the world. Criminal acts of vandalism andarsonhave also targeted some Tesla electric vehicles, showrooms and charging stations in a string of incidents in the U.S. and across Europe. At an all-hands meeting with Tesla employees on Thursday evening, Musk addressed some of those issues, while trying to reassure employees that they were still in good hands, and to \"hang onto your stock.\" The shares closed more than 5% higher on Friday at $248.71. \"It's very difficult like for people in the stock market, especially those that look in the rearview mirror — which is most people — to imagine a future where suddenly a 10 million vehicle fleet has five to ten times the usefulness,\" Musk said, touting his vision for autonomous vehicles that he's long promised. \"It's so profound and there's no comparison with anything in the past that it does not compute. But it will compute in the future.\" In recent months, Tesla's new vehicle sales have fallen in Europe and in parts of the U.S. and China. The company is facing trade uncertainty after multiple executive orders from President Trump imposed new tariffs on goods and materials from Canada, Mexico and China, home to crucial Tesla suppliers. National car shopping siteEdmunds said this weekthat Tesla owners are trading in their electric vehicles at record levels. \"If you read the news it feels like, you know, Armageddon,\" Musk said on the livestream on Thursday. \"It's like, I can't walk past the TV without seeing a Tesla on fire. Like what's going on? Some people, it's like listen, I understand if you don't wanna buy our product, but you don't have to burn it down. That's a bit unreasonable.\" He followed up saying, \"This is psycho, stop being psycho!\" Employees laughed with him.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-21 22:03:18",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/20/elon-musk-received-summons-in-sec-suit-over-twitter-disclosure.html",
        "source": "cnbc",
        "headline": "Elon Musk received court summons in SEC suit over failure to properly disclose Twitter stake",
        "content": "Elon Muskreceived a court summons last week in connection with the SEC's lawsuit over his alleged failure to properly disclose purchases of Twitter stock in 2022 before bidding to buy the company, according to a filing on Thursday. A process server delivered the civil summons to Musk on March 14, at the headquarters of SpaceX in Brownsville, Texas, the filing said. The server noted that upon his arrival at the SpaceX facility, three different security guards refused to accept the documents, and one told him he was trespassing. He \"placed the documents on the ground,\" and left while the guards photographed him and his car. The summons pertains to a case concerning Musk's eventual purchase of Twitter, now known as X, for $44 billion in 2022. Before the acquisition, Musk built up a position in the company of greater than 5%, which would've required disclosing his holdings to the public within 10 calendar days of reaching that threshold. According to theSecurities and Exchange Commission's civil complaint, filed in U.S. District Court in Washington, D.C., in January, Musk was more than 10 days late in reporting that material information, \"allowing him to underpay by at least $150 million for shares he purchased after his financial beneficial ownership report was due.\" Once he took over Twitter, Musk used the platform to promote then-candidate and nowPresident Donald Trump, and other Republican candidates and causes. Musk, who's also CEO of, spent some $290 million to help propel Trump back to the White House and now serves within the administration as a top advisor to the president. An answer from Musk, or his attorneys, is due on April 4. Musk has the option to dismiss by that date. The SEC, Musk and Quinn Emanuel partner Alex Spiro, his lawyer, didn't immediately respond to requests for comment. Trump's White House has directeddeep cutsin the budget and staff of independent federal regulatory agencies, including the SEC. The regulator offered $50,000 to many of its employees, encouraging them to resign or retire by March 21. The Trump administration has alsoreverseda 15-year-old policy that allowed the SEC's director of enforcement to issue formal orders of investigation. The agency will now require requests for formal orders of investigation to be pitched to and approved by a vote of SEC commissioners, a change likely to slow down probes like the one that led to the SEC's suit against Musk. Musk previously settled civil securities fraud charges brought by the SEC at Tesla, his autos business. In that matter, Musk and Tesla each had to pay $20 million in fines, and Musk had to temporarily relinquish his role as chairman of the Tesla board.",
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-21 15:50:04",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/20/nvidia-ceo-huang-says-was-wrong-about-timeline-for-quantum-computing.html",
        "source": "cnbc",
        "headline": "Nvidia CEO Huang says he was wrong about timeline for quantum, surprised his comments hurt stocks",
        "content": "CEO Jensen Huang on Thursday walked back comments he made in January, when he cast doubt on whether useful quantum computers would hit the market in the next 15 years. At Nvidia's \"Quantum Day\" event, part of the company's annual GTC Conference, Huang admitted that his comments came out wrong. \"This is the first event in history where a company CEO invites all of the guests to explain why he was wrong,\" Huang said. In January, Huangsent quantum computing stocks reelingwhen he said 15 years was \"on the early side\" in considering how long it would be before the technology would be useful. He said at the time that 20 years was a timeframe that \"a whole bunch of us would believe.\" In his opening comments on Thursday, Huang drew comparisons between pre-revenue quantum companies and Nvidia's early days. He said it took over 20 years for Nvidia to build out its software and hardware business. He also expressed surprise that his comments were able to move markets, and joked he didn't know that certain quantum computing companies were publicly traded. \"How could a quantum computer company be public?\" Huang said. The event included panels with representatives from 12 quantum companies and startups. It represents a truce of sorts between Nvidia, which makes more traditional computers, and the quantum computing industry. Several quantum execs fired back at Nvidia after Huang's earlier comments. A third panel included representatives fromandWeb Services, which are also investing in quantum technology and are among Nvidia's most important customers.",
        "tags": [
            "nvidia"
        ],
        "timestamp": "2025-03-20 19:00:20",
        "headline_tags": [
            "nvidia"
        ]
    }
]