[
    {
        "url": "https://www.cnbc.com/2025/03/26/trump-says-tesla-ceo-elon-musk-didnt-advise-on-auto-tariffs-despite-doge-role.html",
        "source": "cnbc",
        "headline": "Trump says Tesla CEO Elon Musk didn’t advise on auto tariffs 'because he may have a conflict'",
        "content": "After President Donald Trump said on Wednesday he would impose 25% tariffs on \"all cars that are not made in the United States,\" he said his key advisor,CEO Elon Musk, had not weighed in on the matter, \"because he may have a conflict.\" He added that Musk had never \"asked me for a favor in business whatsoever.\" Musk serves as a senior advisor to Trump, having earlier contributed $290 million to propel him back to the White House. While Musk remains at the helm of his companies, including SpaceX and Tesla, he is also leading the Department of Government Efficiency (DOGE), which is an effort to slash federal government spending, personnel and consolidate or eliminate various federal agencies and services. Earlier this month, Trump turned the South Lawn of the White House into atemporary Tesla showroom. The company delivered five of its electric vehicles there for the president to inspect after he had declared, in a post on Truth Social, that he would buy a Tesla to show support for Musk and the business. Musk stood by his side while Trump called the vehicles \"beautiful\" and praised the unorthodox design of the angular, steel Tesla Cybertruck. When asked by reporters whether the new tariffs would be good for Musk's autos business, Tesla, Trump said they may be \"net neutral or they may be good.\" He pointed to Tesla's vehicle assembly plants in Austin, Texas and Fremont, California and opined that, \"anybody that has plants in the United States — it's going to be good for them.\" Tesla recently wrote,in a letterto the U.S. Trade Representative, that \"even with aggressive localization\" of its supply chain domestically, \"certain parts and components are difficult or impossible to source within the United States.\" Thecompany urgedthe USTR to \"consider the downstream impacts of certain proposed actions taken to address unfair trade practices.\" Tesla and other automakers commonly buy headlamps, automotive glass, brakes, body panels, suspension parts, and printed circuit boards for various electrical systems in their vehicles from foreign suppliers in Mexico, Canada and China, especially. Musk and Tesla did not immediately respond to a request for comment about how the new 25% tariffs may impact their business. faces an onslaught of competition with more automakers selling fully electric models than ever before. However, the company's most formidable rival in battery electric vehicles, BYD in China, has never been authorized to sell its electric cars in the United States. Domestic automakers including,,and Tesla saw shares declining slightly after hours following the latest tariffs announcement.",
        "summary": "President Trump announced 25% tariffs on cars not made in the US, mentioning that Tesla CEO Elon Musk did not advise on the matter due to potential conflicts. Trump praised Musk and Tesla during a temporary Tesla showroom event at the White House, showcasing the Cybertruck. Tesla expressed concerns about impacts of proposed trade actions in a letter to the US Trade Representative.",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-27 00:44:35",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/utah-adopts-child-safety-law-requiring-apple-google-to-verify-user-ages.html",
        "source": "cnbc",
        "headline": "Utah governor signs online child safety law requiring Apple, Google to verify user ages",
        "content": "Utah Gov. Spencer Cox on Wednesday signed a bill that requires Apple and Google's mobile app stores to verify user ages and require parental permission for those under 18 to use certain apps, the governor's spokesperson told CNBC. The law is the first of its kind in the nation and represents a significant shift in how user ages are verified online, and says it's the responsibility of mobile app stores to verify ages — putting the onus on Apple and Google, instead of individual apps like Instagram, Snapchat and X, to do age checks. The App Store Accountability Act, orS.B. 142, could also kick off a wave of other states, including South Carolinaand California, passingsimilar legislation. The law is designed to protect children, who may not understand apps' terms of services and, therefore, can't agree to them, said Todd Weiler, a Republican state senator and the bill's sponsor. \"For the past decade or longer, Instagram has rated itself as friendly for 12 year olds,\" Weiler said at a state senatecommittee hearingin January. \"It's not.\" Apple and Google will need to request age verification checks when someone makes a new account in the state. That will most likely have to be done using credit cards, according to Weiler. If someone under 18 opens an app store account, Apple or Google will have to link it to a parent's account or request additional documentation. Parents will have to consent to in-app purchases. Neither company immediately returned a request for comment on Wednesday. Meta, X and Snap said on Wednesday they applauded Cox and Utah for passing the bill, and encouraged other states to consider similar approaches. \"Parents want a one-stop-shop to oversee and approve the many apps their teens want to download, and Utah has led the way in centralizing it within a device's app store,\" the companies said in a joint statement. \"This approach spares users from repeatedly submitting personal information to countless individual apps and online services.\" The Utah law is slated to take effect on May 7, but it is expected to be challenged in a legal fight over its validity. The state passed a similar age-verification law related to pornography in 2023, and arguments whether that law violates free speech wereheard by the Supreme Courtin January. Utah's adoption of the law is also the latest shot in a long-running skirmish between Facebook-parent Meta and Apple. Meta, which supported the bill, argues that app stores are the best place to do age verification on minors, instead of on individual apps. Meta has recently shifted its policy strategy to seek strategic advantages for itself and shift antitrust scrutiny onto Apple,CNBC reported last month. Apple says it makes the most sense for apps themselves to do age verification, and that due to privacy reasons, it doesn't want to collect the data needed for age verification. The \"right place to address the dangers of age-restricted content online is the limited set of websites and apps that host that kind of content,\" according to a paper Apple posted on its website last month. Utah's bill raises privacy and safety risks, Google said ina blog poston March 12. \"There are a variety of fast-moving legislative proposals being pushed by Meta and other companies in an effort to offload their own responsibilities to keep kids safe to app stores,\" Google Director of Public Policy Kareem Ghanem wrote. \"These proposals introduce new risks to the privacy of minors, without actually addressing the harms that are inspiring lawmakers to act.\" The push for age verification comes after Meta CEO Mark Zuckerberg, X CEO Lina Yaccarino, Snap CEO Evan Spiegel and other social media CEOs appeared before Congress in January 2024 for a hearing focused on online child safety. There, lawmakers criticized the companies, saying they failed to stem online child sexual exploitation on social media apps and needed to do more. Zuckerberg appearedrattledduring the hearing after senators told him he had \"blood on your hands.\" However, the legislation that came out of the meeting, the Kids Online Safety Act, failed to advance in Congress late last year. Meta has also been hit witha number of lawsuitsfiled by states relating to the well-being of children on Facebook and Instagram. -- CNBC's Jonathan Vanian contributed to this report. WATCH:Apple delays AI improvements to Siri until 2026: Here's what to know",
        "summary": "Utah Governor signed a bill requiring Apple and Google to verify user ages and obtain parental permission for certain apps used by individuals under 18. The law shifts the responsibility of age verification to mobile app stores like Apple and Google, rather than individual apps. The App Store Accountability Act aims to protect children who may not understand app terms of service. Apple and Google will need to implement age verification checks for new accounts, likely using credit cards, and link accounts of minors to parents for consent on in-app purchases.",
        "sentiment": {
            "company": "apple",
            "score": 0.2
        },
        "tags": [
            "apple",
            "alphabet",
            "meta"
        ],
        "timestamp": "2025-03-26 22:21:15",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/the-concern-with-coreweaves-250000-nvidia-chips-ahead-of-its-ipo.html",
        "source": "cnbc",
        "headline": "The concern with CoreWeave’s 250,000 Nvidia chips ahead of its IPO",
        "content": "With 250,000 highly-desiredgraphics processors, CoreWeave has become one of the most prominent \"GPU clouds,\" a status it hopes investors will value when it debuts on the public markets. But the world of artificial intelligence hardware is moving so quickly that it raises questions about how long those chips will remain on the cutting edge and in demand. It's a concern that could impact investor demand for shares of CoreWeave, one of the most anticipated IPOs in years. CoreWeave, which rents out remote access to computers based on Nvidia AI chips,said in a financial filing this monththat most of its AI chips are from Nvidia's Hopper generation. Those chips, such as the H100, were state-of-the-art in 2023 and 2024. They were scarce as AI companies bought or rented all the chips they could get in the wake of OpenAI ushering in the generative AI age with the release of ChatGPT in late 2022. But these days, Nvidia CEO Jensen Huang says that his company's Hopper chips are getting blown out of the water by their successors – the Blackwell generation of GPUs, which have been shipping since late 2024. Hopper chips are \"fine\" for some circumstances but \"not many,\" Huang joked at Nvidia's GTC conferencelast week. \"In a reasoning model, Blackwell is 40 times the performance of Hopper. Straight up. Pretty amazing,\" Huang said. \"I said before that when Blackwell starts shipping in volume, you couldn't give Hoppers away.\" That's great for Nvidia, which needs to find ways to keep selling chips to the companies committed to the AI race, but it's bad news for GPU clouds like CoreWeave. That's because the New Jersey company models the future trajectory of its business based on how much it anticipates being able to rent Nvidia chips out for over the next five to six years. Huang may have been kidding, but Nvidia spent much of its event detailing just how much better its Blackwell chips are. In Nvidia's view, the best way to decrease the high cost of serving AI is by buying faster chips. Blackwell systems are in full production and shipping to customers, and Nvidia plans to introduce an upgraded version of Blackwell in late 2026. When new chips come out, the older chips — the kind CoreWeave has a quarter of a million of — go down in price, Huang said. So too does the price of renting them. Older chips don't just stop working when new ones come out. Most companies, including CoreWeave, plan to use Hopper chips for six years. But Nvidia is telling customers that its newer, faster chips are capable of producing more AI content, which leads to more revenues at a better margin for clouds. An H100 would have to be priced 65% lower per hour than an Nvidia Blackwell GB200 NVL system for the two systems to be competitive in price per output to a renter. Put another way, the H100 would have to rent at 98 cents per hour to match the price per output of a Blackwell rack system priced at $2.20 per hour per GPU,SemiAnalysis estimated, speaking generally about AI rentals. H100s rented for as much as $8 per hour back in 2023 and often required long commitments and lead times, but now, usage of those chips can be summoned in minutes with a credit card. Some services now offer rented H100 access for under $2 per hour. The industry could be entering a period where the useful life of AI chips is reduced, Barclays analyst Ross Sandler wrote in a note on Friday. He was focused on hyperscalers —,and— but the trend affects smaller cloud providers like CoreWeave, too. \"These assets are becoming obsolete at a much more rapid pace given how much innovation and speed improvements happen with each generation,\" Sandler wrote. This threatens company earnings if they end up depreciating older equipment faster, he said. CoreWeave says that if there were to be changes to the \"significant\" assumptions it makes about the useful lifetime of its AI infrastructure, it could hurt its business or future prospects. CoreWeave has alsoborrowednearly $8 billion to buy Nvidia chips and build its data centers, sometimes using the GPUs it amassed as collateral. Analysts and investors are also increasingly asking questions about the useful lifespan of these new AI systems and whether their financial depreciation schedules should be accelerated because the technology is improving so fast. CoreWeave says in its filing that it seeks to offer state-of-the-art infrastructure and says it will continue spending to expand and improve its data centers. \"Part of this process entails cycling out outdated components of our infrastructure and replacing them with the latest technology available,\" the New Jersey company said. \"This requires us to make certain estimates with respect to the useful life of the components of our infrastructure and to maximize the value of the components of our infrastructure, including our GPUs, to the fullest extent possible.\" CoreWeave and Nvidia maintain a good relationship. CoreWeave will certainly buy more chips from Nvidia, which owns more than 5% of the New Jersey company. \"We're super proud of them,\" Huang said last week. But Nvidia's road map for releasing new chips that it proudly touts will make their predecessors obsolete is a threat to CoreWeave's ambitions. WATCH:CoreWeave begins marketing IPO, targeting price range of $47-$55 per share: Report",
        "summary": "CoreWeave, a prominent \"GPU cloud\" company with 250,000 Nvidia AI chips, is facing concerns about the longevity and demand for its Nvidia Hopper generation chips ahead of its IPO. Nvidia's CEO Jensen Huang highlighted the superior performance of the newer Blackwell generation GPUs over the Hopper chips, impacting the value proposition of CoreWeave's offerings. While Nvidia benefits from technological advancements to cater to the AI market demand, CoreWeave's reliance on older chips may pose challenges in attracting investor interest.",
        "sentiment": {
            "company": "nvidia",
            "score": -0.6
        },
        "tags": [
            "nvidia",
            "openai"
        ],
        "timestamp": "2025-03-26 21:00:01",
        "headline_tags": [
            "nvidia"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/amazon-pharmacy-chief-medical-officer-vin-gupta-departs-the-company.html",
        "source": "cnbc",
        "headline": "Amazon Pharmacy medical chief Gupta is latest health exec to leave company",
        "content": "has lost the chief medical officer of its pharmacy division after five years at the company. Dr. Vin Gupta, who most recently served as the medical chief of Amazon Pharmacy, joined Amazonin 2020as the company was in the early stages of a multiyear effort to build out a health-care business. Gupta has joined Manatt, Phelps & Phillips, LLP, a professional services firm, as a managing director to lead a portfolio dedicated to health innovation, according toa release. Amazon did not immediately name a successor for Gupta, whoseLinkedIn profilesays he left last month. \"We are grateful to Dr. Gupta for all of his contributions to Amazon Health Services and wish him the best in his next endeavor,\" an Amazon spokesperson told CNBC in a statement Wednesday. Gupta said in an emailed statement that Manatt, like Amazon, \"is deeply focused on scaled impact to address problems which matter to patients nationwide,\" including care access and the use of artificial intelligence \"at the point of need.\" For Amazon CEO Andy Jassy, Gupta's exit marks another high-profile departure across the health businesses. Earlier this month, One Medical CEO Trent Greenannouncedhe would step down from leading the primary care chain in April, after less than two years in the role. Amazon acquired One Medical for $3.9 billion in 2023, five years after snapping up online pharmacy PillPack for about $750 million. In addition to his role within the pharmacy business, Gupta held several other positions over the course of his five years at the company, including Covid response lead and chief medical officer of new products in Amazon's devices and services unit. Gupta joined Amazon months before it launched its pharmacy offering, a service that was born out of the PillPack deal in 2018. In his role as chief medical officer, Gupta helped roll out a prescription perk for U.S. Prime members calledRxPassand expanded its program formedication delivery by drones. Gupta was also involved with a moonshot incubator at Amazon called Grand Challenge, which launched under founderJeff Bezosas a way to develop experimental businesses, includinghealth-care initiatives. Disclosure: Dr. Vin Gupta contributes to NBC News as a medical analyst.",
        "summary": "Dr. Vin Gupta, the chief medical officer of Amazon Pharmacy, has left the company after five years. He has joined a professional services firm, Manatt, Phelps & Phillips, LLP, to lead a health innovation portfolio. Amazon has not yet named a successor for Gupta, who played key roles in the development of Amazon's health services, including the pharmacy offering and medication delivery initiatives.",
        "sentiment": {
            "company": "amazon",
            "score": 0.2
        },
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-26 22:26:12",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/tesla-drops-on-slowing-european-sales-concerns-about-trump-tariffs.html",
        "source": "cnbc",
        "headline": "Tesla shares drop on plunging European sales, concerns about Trump's tariffs",
        "content": "shares fell almost 6% on Wednesday as data from Europe showed slowing sales last month, and investors grew increasingly concerned aboutPresident Donald Trump'splan for tariffs. The European Automobile Manufacturers' Association (ACEA) revealed on Tuesday that Tesla saw a 40% year-over-year drop in new vehicle registrations in Europe in February, while overall battery electric vehicle sales were up 26%. Meanwhile, the White Housesaidon Wednesday that President Trump will announce new tariffs on auto imports in the afternoon. The president has hyped April 2 as \"liberation day\" and \"the big one\" for rolling out his plan to impose heavy tariffs on foreign trading partners, but Trump hinted earlier this week that auto tariffs could arrive sooner. Movements of this magnitude have become commonplace for Tesla's stock. On 14 separate days this year, Tesla shares have gained or lost at least 5%. Wednesday's selloff, alongside a 2% drop in the Nasdaq, followed a five-day rally that included a12% jump on Monday. The trend for the year has been downward, particularly since President Trump began his second term in January, and brought Tesla CEOElon Muskwith him to the White House. Tesla shares are down 36% since Inauguration Day, after falling 28% in February, the steepest drop for any month since December 2022. Following the ACEA report on Tuesday, RBC analysts wrote in a note that the February numbers only represented a drop of about 11,000 Tesla vehicle registrations in Europe, and emphasized that data for the month \"might not be indicative of true demand.\" New car buyers in Europe, the analysts said, \"could be holding out for the Model Y refresh,\" or a \"new affordable model,\" which they expect in the second half of the year. Tesla is set to fully ramp up production of the redesigned version of its Model Y SUV next month. The company implemented partial production shutdowns at certain factories earlier this year to upgrade Model Y manufacturing lines. Some prospective EV buyers have been turned off of late by Musk's political rhetoric and his work for the Trump administration, where he's leading an effort to slash federal government spending, cut the federal workforce, and has said he wants to privatize many services,including social security. William Blair analysts wrote in a note on Wednesday that, \"pushback from Musk's foray into politics\" has led to \"brand damage and even vandalism,\" for Tesla at a time when the company's supply has been impacted by its Model Y changeover, and \"Chinese competition continues to heat up.\" Still, the firm maintained its buy recommendation on Tesla's stock, pointing to growth in the company's energy storage business, and its prospects in driverless ride hailing. Musk has promised that Tesla will kick off a robotaxi service in Austin in June. The company has yet to begin production of its dedicated robotaxi, dubbed theCybercab. Waymo is already operating a commercial robotaxi service in Austin and other markets. And in China, several automakers are now offering an equivalent to Tesla's Full Self-Driving Supervised — a premium, partially automated driving system — as standard options rather than a paid service. In China this week, Tesla renamed its FSD system \"Intelligent Assisted Driving,\" according to CNEVPost, after previously branding it as \"Full Self-driving Capability.\" Tesla's system in all markets still requires a human at the wheel, ready to steer or brake at any time. WATCH:Tesla expectations 'near a bottom'",
        "summary": "Tesla shares dropped almost 6% following news of a 40% year-over-year decline in new vehicle registrations in Europe in February. Concerns about President Trump's plan for tariffs on auto imports also contributed to the stock decline. Despite the drop, RBC analysts believe the February numbers may not accurately reflect true demand, suggesting that buyers in Europe could be waiting for the Model Y refresh or a new affordable model expected later this year.",
        "sentiment": {
            "company": "tesla",
            "score": -0.6
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-26 20:21:09",
        "headline_tags": [
            "tesla"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/26/openai-expects-revenue-will-triple-to-12point7-billion-this-year-sources-say.html",
        "source": "cnbc",
        "headline": "OpenAI expects revenue will triple to $12.7 billion this year, source says",
        "content": "OpenAI expects revenue will triple to $12.7 billion in 2025, CNBC has confirmed. Bloombergwas first to report on the revenue figure, which was confirmed to CNBC by a source familiar with the matter who asked not to be named because the number is private. , OpenAI's principal investor and key strategic partner, recorded $13 billion in annual recurring revenue in the fourth quarter, up 175% from a year earlier. Earlier this week, OpenAI announced somekey changesin the C-suite. CEO Sam Altman will shift his focus away from day-to-day operations and focus more on research and product, the company said, while operating chief Brad Lightcap's role will expand to oversee \"business and day-to-day operations.\" OpenAI is facing increased competition in generative artificial intelligence from other high-value startups such as Anthropic and Perplexity and tech giants includingand Microsoft. As of last month, SoftBank wasset to invest$40 billion in OpenAI at a $260 billion valuation. Part of the funding is expected to be used for OpenAI's commitment to Stargate, the joint venture between SoftBank, OpenAI andannounced by President Donald Trump. On Tuesday, OpenAI announced it would introduce native image generation within ChatGPT. The feature has begun rolling out to ChatGPT PLUS, Pro and Team users, as well as users of ChatGPT's free tier, when they use OpenAI's 4o model. The company said ChatGPT Enterprise and Edu users will soon receive access.",
        "summary": "OpenAI expects its revenue to triple to $12.7 billion in 2025, with key changes in the C-suite announced recently. CEO Sam Altman will focus more on research and product, while operating chief Brad Lightcap's role expands. The company faces competition in generative AI from startups like Anthropic and tech giants like Microsoft.",
        "sentiment": {
            "company": "openai",
            "score": 0.7
        },
        "tags": [
            "openai"
        ],
        "timestamp": "2025-03-26 20:35:35",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/25/amazon-testing-shopping-health-assistants-pushes-into-generative-ai.html",
        "source": "cnbc",
        "headline": "Amazon is testing shopping, health assistants as it pushes deeper into generative AI",
        "content": ", in an effort to infuse generative artificial intelligence across a wider swath of its e-commerce universe, recently began testing a shopping assistant and a health-focused chatbot with a subset of users. AI has become a major area of investment across Amazon, including in its retail, cloud computing, devices and health-care businesses. Within the retail business, Amazon has already launched a shopping chatbot, an AI assistant for sellers and AI shopping guides. The new services Amazon is testing appeared on its app or website in recent weeks. An Amazon spokesperson confirmed the features are being tested in beta with some customers. The shopping tool, called Interests AI, prompts users to describe an interest \"using your own words,\" and then it generates a curated selection of products. The feature lets consumers browse for products using more conversational language and is separate from the main search bar on Amazon's website.",
        "summary": "Amazon is expanding its use of generative artificial intelligence by testing a shopping assistant and a health-focused chatbot with select users. These new AI services are part of Amazon's broader investment in AI across its retail, cloud computing, devices, and health-care businesses. The shopping tool, called Interests AI, allows users to describe their interests in their own words to generate a curated selection of products in a more conversational browsing experience.",
        "sentiment": {
            "company": "amazon",
            "score": 0.7
        },
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-26 11:58:15",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/25/google-quantum-exec-says-tech-is-5-years-out-from-a-real-breakout-.html",
        "source": "cnbc",
        "headline": "Google quantum exec says tech is '5 years out from a real breakout'",
        "content": "One oftop executives working on quantum computers said he believe the technology is only five years away from running practical applications that can't be calculated on modern computers. Julian Kelly, Google Quantum AI's director of hardware, told CNBC's Deirdre Bosa that a quantum computer may be able to do cutting-edge physics and potentially generate new kinds of data. \"We think we're about five years out from a real breakout, kind of practical application that you can only solve on a quantum computer,\" said Kelly in an interview aired Tuesday. Quantum technology has enjoyed increased attention after Google announced a breakthrough in error correctionin Decemberthat the company said suggested a path to working quantum computers. , meanwhile, revealed a new quantum computing chip called Majorana in February. The company had to create an \"entirely new state of matter\" to get the chip to work, CEOSatya Nadellasaid. Google's most advancedquantum computer has 105 qubits, or the basic building block of a quantum computer, while experts say 1 million or more qubits will be needed for useful applications. Quantum computers have been a dream of physicists and scientists since the 1980s. While traditional computers are based around central processors or graphics processors with bits that are either 0 or 1, quantum qubits are on or off based on probability. \"Quantum computers speak quantum mechanics — they can access the way the universe works at the most fundamental level,\" Kelly said. The first applications for the technology will likely include using the system to simulate cutting-edge physics, Kelly said. That includes \"areas where you've got some system that's sort of just out of reach of what a classical computer to do,\" he added. Quantum computers may also be able to generate data used to train AI, although Kelly called this use \"speculative.\" He said that current artificial intelligence models fundamentally won't be able to work on quantum computers. \"One of the potential applications that you can think of for a quantum computer is generating new and novel data,\" Kelly said. The quantum computing field has also benefited in recent months from attention on artificial intelligence chips made byas investors search for another kind of next-generation processor that could spark a similar boom asgraphics processing units did during the recent wave of AI investment. Nvidia doesn't make quantum processors, but the company held a Quantum Day event last week where representatives from 12 leading quantum companies,and Microsoft talked about the potential of the technology. The chipmaker's summit came after Nvidia CEO Jensen Huang in January cast doubt on whether useful quantum computers would hit the marketin the next 15 years. Those comments caused the share prices of several public quantum companies to fall. Huang last week walked back his January comments,saying they were \"wrong,\"but he still signaled that he thought technology had a long way to go. \"Of course, quantum computing has the potential and all of our hopes that it will deliver extraordinary impact,\" Huang said last week. \"But the technology is insanely complicated.\"",
        "summary": "Google's quantum executive, Julian Kelly, believes that practical applications for quantum computers are about five years away, with the potential to solve complex problems that modern computers cannot. Google has made significant advancements in quantum technology, including a breakthrough in error correction and the development of a new quantum computing chip called Majorana. Quantum computers operate on qubits, which function based on probability and have the potential to simulate cutting-edge physics and generate data for AI training.",
        "sentiment": {
            "company": "alphabet",
            "score": 0.8
        },
        "tags": [
            "nvidia",
            "microsoft",
            "alphabet"
        ],
        "timestamp": "2025-03-25 23:34:33",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/21/microsoft-posts-weekly-gain-to-end-longest-losing-streak-since-2008.html",
        "source": "cnbc",
        "headline": "Microsoft rallies in last 10 minutes of trading to avoid first eight-week losing streak since 2008",
        "content": "With about 10 minutes left until the market's close,stock was down for the week. It would've been the first eight-week losing streak since 2008. But the shares popped just before the end of trading, pushing the stock up 0.7% for the week to close at $391.26. It is still down 7% for the year. The last time Microsoft had a weekly slump like it has seen this year was between January and February 2008, when the country was in the middle of a financial crisis. Microsoft shares fell nine straight weeks. Microsoft's 2025 downdraft is notable as the company is viewed as central to the artificial intelligence boom. It has a hefty stake in OpenAI, is investing heavily in its Azure cloud infrastructure and has many products that are incorporating generative AI technologies. Along with its megacap peers, Microsoft has seen a recent pullback on concerns thatPresident Donald Trump'stariffs and massive cost cuts will hurt the economy, possibly leading to a recession. Since reaching a closing high of $467.56 in July 2024, Microsoft is down about 16%, pushing its market cap to $2.9 trillion. The company issueddisappointing revenue guidanceon Jan. 30. Within cloud and AI, competition is heating up across the board from rivals such as Amazon and Google, as well as from emerging startups. Earlier this week,announced its intent to acquire cloud security startup Wiz for$32 billion.",
        "summary": "Microsoft narrowly avoided its first eight-week losing streak since 2008 by rallying in the last 10 minutes of trading, closing the week up 0.7% at $391.26. Despite this, the stock is still down 7% for the year. The company's recent downturn is attributed to concerns about tariffs, cost cuts, and competition in the cloud and AI sectors.",
        "sentiment": {
            "company": "microsoft",
            "score": -0.3
        },
        "tags": [
            "microsoft",
            "amazon"
        ],
        "timestamp": "2025-03-21 22:33:42",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://www.cnbc.com/2025/03/21/elon-musk-tells-tesla-employees-hang-onto-your-stock-in-all-hands.html",
        "source": "cnbc",
        "headline": "Elon Musk tells Tesla employees 'hang onto your stock,' urges vandals to 'stop being psycho'",
        "content": "DuringElon Musk'stwo months in Washington, D.C.,shares have been on aprecipitous decline,losing over 40% of their value. Protestsand campaigns against Tesla, Musk and his work in the Trump White House have erupted around the world. Criminal acts of vandalism andarsonhave also targeted some Tesla electric vehicles, showrooms and charging stations in a string of incidents in the U.S. and across Europe. At an all-hands meeting with Tesla employees on Thursday evening, Musk addressed some of those issues, while trying to reassure employees that they were still in good hands, and to \"hang onto your stock.\" The shares closed more than 5% higher on Friday at $248.71. \"It's very difficult like for people in the stock market, especially those that look in the rearview mirror — which is most people — to imagine a future where suddenly a 10 million vehicle fleet has five to ten times the usefulness,\" Musk said, touting his vision for autonomous vehicles that he's long promised. \"It's so profound and there's no comparison with anything in the past that it does not compute. But it will compute in the future.\" In recent months, Tesla's new vehicle sales have fallen in Europe and in parts of the U.S. and China. The company is facing trade uncertainty after multiple executive orders from President Trump imposed new tariffs on goods and materials from Canada, Mexico and China, home to crucial Tesla suppliers. National car shopping siteEdmunds said this weekthat Tesla owners are trading in their electric vehicles at record levels. \"If you read the news it feels like, you know, Armageddon,\" Musk said on the livestream on Thursday. \"It's like, I can't walk past the TV without seeing a Tesla on fire. Like what's going on? Some people, it's like listen, I understand if you don't wanna buy our product, but you don't have to burn it down. That's a bit unreasonable.\" He followed up saying, \"This is psycho, stop being psycho!\" Employees laughed with him.",
        "summary": "Elon Musk addressed Tesla employees during an all-hands meeting, urging them to hold onto their stock amidst a 40% decline in share value. Musk reassured employees about the future of Tesla, emphasizing the potential of autonomous vehicles. The company is facing challenges with declining sales in Europe and parts of the U.S. and China, as well as trade uncertainty due to new tariffs.",
        "sentiment": {
            "company": "tesla",
            "score": 0.6
        },
        "tags": [
            "tesla"
        ],
        "timestamp": "2025-03-21 22:03:18",
        "headline_tags": [
            "tesla"
        ]
    }
]