[
    {
        "url": "https://www.cnn.com/2025/03/26/business/tesla-saudi-arabia-elon-musk-intl/index.html",
        "headline": "Tesla is bringing its electric cars to oil-rich Saudi Arabia amid falling global sales",
        "content": "Tesla will start selling its electric vehicles in Saudi Arabia, entering the Gulf region’s largest economy as the company’s global sales are sliding and CEO Elon Musk courts controversy with his role in the US government.\n\nThe carmakerannouncedWednesday that it would host a launch event in the kingdom on April 10, where it will showcase its EVs. Attendees will also have the chance to “experience the future of autonomous driving with Cybercab and meetOptimus, our humanoid robot, as we showcase what’s next in AI and robotics,” Tesla (TSLA) said.\n\nTesla may struggle to gain market share in oil-rich Saudi Arabia as EVs make up a little over 1% of all car sales in the country, according to a report by consultancy PwC published in September.\n\nTesla’s entry into the new market comes as the company fights battles on several fronts.\n\nLast year, it recordedthe first annual declinein sales in its history as a public company, posting a drop of 1%.\n\nThe company is facing intensifying competition in China, the world’s largest auto market. On Tuesday, BYD, a Chinese maker of electric and hybrid cars, reported $107 billion in annual sales for 2024, beating the near-$98 billion notched by Tesla.\n\nAnd last week, BYD unveiled anultra-fast charging system, which it said was capable of adding 250 miles (402 km) of range in just five minutes, easily outdoing Tesla’s charging technology. Tesla’s Superchargers take 15 minutes to charge an EV, providing a range of 200 miles.\n\nTesla has also suffered slumping sales in Europe. In February, the carmaker sold around 40% fewer vehicles on the continent compared with the same month in 2024,accordingto the European Automobile Manufacturers’ Association.\n\nIn the United States, Tesla’s home-turf, Musk’s contentious government role — which has involved slashing thousands of public sector jobs as head of the Department of Government Efficiency — has also turned off many would-be Tesla buyers. Prices for used Teslasare tankingeven as interest in used EVs overall rises.\n\nThe billionaire’s actions in government have sparked a spate of vandalism against Tesla showrooms, charging stations and vehicles in the US, so much so that theFBI announcedMonday that it had created a task force to “crack down on violent Tesla attacks.”\n\nThere have also been peaceful protests at many Tesla sites, with demonstrators holding signs and chanting “Elon Musk has got to go” in reference to his government job.\n\nThese headaches have convinced many investors to dump Tesla’s stock. Shares in the company have cratered 40% since hitting an all-time high in December.",
        "summary": "Tesla is expanding its market presence by bringing its electric vehicles to Saudi Arabia, where it will host a launch event in April. Despite entering a market where EVs represent a small percentage of car sales, Tesla faces challenges globally with falling sales, increasing competition in China, and declining sales in Europe. The company's CEO, Elon Musk, is also facing controversy in the US government, potentially impacting consumer sentiment.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-26",
        "sentiment": {
            "company": "tesla",
            "score": -0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/25/business/byd-tesla-china-elon-musk-nightcap/index.html",
        "headline": "Tesla’s No.1 rival is practically taunting Elon Musk now",
        "content": "There are three letters keeping Tesla bulls up at night: BYD.\n\nThat’s the carmaker eating everyone’s lunch in China, the world’s biggest auto market, and rapidly gaining market share around the globe (except in the United States, of course, because of longstanding trade restrictions on Chinese imports).\n\nOn Monday, BYD reported $107 billion in revenue for 2024 — crossing the $100 billion level for the first time and besting Tesla’s annual revenue by about $10 billion. That milestone came a week after BYDunveileda charging system that it says will give its latest EV model 250 miles of range after plugging in for just five minutes.\n\nBYD’s Hong Kong-listed shares are already up more than 50% this year.\n\nThe Chinese company’s week of blowout news should amount to a rather satisfying dunk on Tesla CEO Elon Musk, who oncescoffed at the idea of BYDas a competitor and who is currently a rather unpopular member of the Trump administration. (Trust us,we did polling!)\n\nBYD’s moment in the sun comes just as Tesla is sliding into a crisis.\n\nTesla investors have been offloading their stock for nine straight weeks, largely because ofgood old-fashioned business reasons, including:\n\nBut those are hardly theonlyreasons.\n\nMusk’s extracurricular gig as President Donald Trump’s hatchet man has turned the Tesla brand — once a favorite among upwardly mobile lefties — into a symbol of America’s right wing. Used Tesla pricesare tankingeven as interest in used EVs rises.\n\nThe White House has responded with a series of stunts — a live presidential endorsement on the South Lawn, the commerce secretary shilling for Tesla stock on Fox News, the FBI threatening vandals with terrorism charges — that all smack of desperation. (They are also soout of step withlegal convention, ethics experts are struggling to wrap their heads around them.)\n\nTesla shares began rebounding Friday after Musk called an all-hands meeting Thursday night in which he urged staff to hold onto their stock. Retail investors have piled in, helping shares gain 5% on Friday and 12% on Monday.\n\nBut the stock remains more than 40% off its December record high, and several analysts have reined in their expectations for the year.\n\nBYD isn’t the only Chinese competitor sapping Tesla’s market share. In Europe, Tesla sales fell 44% in February while Chinese brands broadly went up 82%, according toa reportfrom JATO, which analyzes auto market data.\n\nPart of that decline had to do with a gap in Tesla’s overhaul of its bestselling Model Y, JATO analyst Felipe Munoz said. But Musk’s support for a far-right German party accused ofsympathizing with Nazislikely didn’t help — sales in Germany, Europe’s biggest car market, sank 75% last month.\n\nPerhaps the biggest threat BYD poses to Tesla: It’s managed to make a variety of sleek, tech-enabled cars — both EVs and plug-in hybrids — at a fraction of the cost. The entry-level BYD EV now starts at under $10,000 in China.  Tesla’s Model 3, its cheapest model, costs three times more at $32,000.\n\nOn Monday, BYD launched a new electric sedan with roughly the same specs as a Tesla Model 3 for half the price,Elektrek reported. Then new Qin L EV comes with BYD’s smart driving tech and gets over 330 miles of driving range, starting at $16,500.\n\nTesla is reportedly working on a smaller, cheaper version of its Model Y in an effort to regain some of the ground it has lost in China. But mass production isn’t expected to begin until 2026, according tounnamed sources cited by Reuters.\n\nBottom line:Musk badly underestimated BYD, which stands for “Build Your Dreams,” back in 2011, when he dismissed a Bloomberg interviewer’s question about the Chinese carmaker posing a threat to Tesla. “Have you seen their car?” he asked rhetorically.\n\nBut more than a decade later, BYD has surpassed Tesla in annual revenue and upended the global market for EVs. Tesla remains the best-selling EV maker in the US, thanks to the nation’s tariffs aimed at protecting US manufacturing. Absent those trade barriers, BYD could fast become Musk’s nightmare.",
        "summary": "BYD, a Chinese carmaker, has surpassed Tesla's annual revenue by about $10 billion, with its shares up more than 50% this year. BYD unveiled a new charging system for its EV model, boasting 250 miles of range after just five minutes of charging. This success is seen as a taunt to Tesla and Elon Musk, especially as Tesla faces challenges with stock offloading, declining used Tesla prices, and negative associations due to Musk's ties to the Trump administration.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25",
        "sentiment": {
            "company": "tesla",
            "score": -0.8
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/20/tech/meta-whistleblower-sarah-wynn-williams-response-congress/index.html",
        "headline": "Facebook whistleblower, ‘Careless People’ author says company’s arbitration demand is keeping her from speaking to Congress",
        "content": "Former Facebook executive-turned-whistleblower Sarah Wynn-Williams says Meta is blocking her from speaking to Congress about her experiences at the company.\n\nThis arises from arbitration proceedings with the company after Wynn-Williams published hermemoir “Careless People,”detailing her time at the social media giant, earlier this month.\n\nMeta moved quickly to stop her from promoting or discussing the book, which it claimed contained “out-of-date” claims and “false accusations.” On the day of the book’s publication, the company filed an arbitration demand stating that the claims in the book violate a voluntary non-disparagement agreement she signed upon leaving the company. A day later, the arbitrator temporarily ordered her not to make any “disparaging, critical or otherwise detrimental comments” related to Meta and to stop promoting the book.\n\nThat order is now preventing Wynn-Williams from responding to requests from lawmakers in several countries to discuss her time at the company, her lawyers wrote in a response in the arbitration proceedings obtained by CNN.\n\n“Members of the United States Congress, the Parliament of the United Kingdom, and the Parliament of the European Union have requested to speak with Ms. Wynn-Williams on the issues of public concern raised in her memoir,” including the company’s interactions with the Chinese government and Meta’s alleged harms to teen girls, the document, filed Tuesday, states. But under the order, Wynn-Williams “appears to be blocked from speaking” with those lawmakers.\n\nWynn-Williams’ response in the arbitration proceedings has not been previously reported.\n\n“Careless People” includes striking details about Wynn-Williams’ time at the company, ranging from the social media giant’s efforts to expand into China and alleged sexual harassment by now-policy chief Joel Kaplan.\n\nThe arbitrator’s emergency order prevents Wynn-Williams from making any critical comments about the company even if she believes them to be true, according to a filing Meta shared publicly earlier this month.\n\nThe emergency order also notes that Wynn-Williams is not prevented or prohibited from “filing a claim with a federal, state, or local government agency that is responsible for enforcing a law on behalf of the government.” However, her response states that because legislative bodies are not responsible for enforcing laws, she is blocked from speaking to lawmakers.\n\nA Meta spokesperson said the company has no intention to interfere with Wynn-Williams’ legal rights.\n\nWynn-Williams also filed a whistleblower complaint with the Securities and Exchange Commission in April 2024 and with the Department of Justice in 2025, according to her filing.\n\nWynn-Williams’ memoir comes as Meta has faced years of scrutiny and increased regulatory pressure from lawmakers around the world over issues such as teen safety and election misinformation. Two other former employees have also testified as whistleblowers, and the company’s executives have repeatedly been called to hearings on Capitol Hill.\n\nWynn-Williams spent six years at the company, now called Meta, most recently as director of global public policy, before she was fired in 2017, which the company said was due to “poor performance and toxic behavior.” Wynn-Williams’ book implies that she was fired in retaliation for reporting sexual harassment.\n\nMeta had sent a letter to Wynn-Williams’ publisher prior to the book’s publication, saying it had made “no attempt” to verify her claims with the company and threatening legal action if the book contained false statements or implications. But despite Meta’s efforts to block the book, it debuted this week on the New York Times’ best seller list.\n\n“The public interest is suffering due to her inability to respond to outreach from legislators, journalists, and the public,” the document states. It later adds: “The public interest balance here tips sharply in Ms. Wynn-Williams’s favor, as demonstrated by the interest in her evidence from U.S., UK, EU and other national and supra- national legislatures and regulatory bodies.”",
        "summary": "Former Facebook executive-turned-whistleblower Sarah Wynn-Williams is being blocked by Meta from speaking to Congress about her experiences at the company following the publication of her memoir \"Careless People.\" Meta filed an arbitration demand claiming the book contained outdated claims and false accusations, leading to an order preventing Wynn-Williams from making disparaging comments about Meta. This order is hindering her from addressing requests from lawmakers in various countries to discuss important issues raised in her memoir, including Meta's interactions with the Chinese government and alleged harms to teen girls.",
        "source": "CNN",
        "tags": [
            "meta"
        ],
        "headline_tags": [
            "meta"
        ],
        "timestamp": "2025-03-20",
        "sentiment": {
            "company": "meta",
            "score": -0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/20/business/tesla-cybertruck-recall/index.html",
        "headline": "Tesla is recalling most Cybertrucks due to exterior panel issue",
        "content": "Tesla is recalling nearly all Cybertrucks in the United States to fix an exterior panel that could detach during driving, the latest in a series of call-backs for the pickup truck.\n\nThe recall covers just over 46,000 vehicles built from November 2023 through February 27 of this year, Tesla said in a filing with the National Highway Traffic Safety Administration Thursday.\n\nThe recall could prove to be a setback for Tesla (TSLA), whose stock has lost about half its value this year as the electric vehicle maker grapples with rising competition, an aging lineup and backlash against CEO Elon Musk’s controversial role overseeing cuts to federal spending in the Trump White House.\n\nThe recall addresses the risk that a stainless-steel exterior trim panel can detach from the vehicle, making it a road hazard and boosting the risk of a crash, Tesla said. Tesla’s service will replace the rail panel assembly with a new one that meets durability testing requirements, the automaker said.\n\nOn February 21, the NHTSA notified Tesla of a vehicle owner who alleged a rail panel detachment.\n\nTesla said a detached rail panel may create a detectable noise inside the cabin or customers may observe the panel coming loose or separating from the vehicle.\n\nTesla said it is aware of 151 warranty claims that may be related to the recall issue, but no collisions or injuries.\n\nWhile Tesla does not break out deliveries of its Cybertrucks, the recalled vehicles represent a vast majority of the Cybertruck vehicles on the road, based on analyst estimates.\n\nDemand for the unconventional EV pickup already showed signs of weakness toward the end of last year.\n\nShares of the EV maker fell 1.4% in premarket trading.\n\nTesla shares, initially boosted post-election due to Musk’s relationship with US President Donald Trump, have fallen nearly 42% this year.\n\nAnalysts have pointed to a change in sentiment toward the EV maker from existing customers and potential new buyers, as reactions toward the brand such as protests at Tesla stores across the US and sales boycotts emerge.\n\nTesla accounts for a large portion of recalled vehicles in the US. In 2024, Tesla topped the list for US recalls with its vehicles accounting for 5.1 million call-backs, according to recall management firm BizzyCar. However, most issues for the brand’s cars were usually resolved with over-the-air software updates.",
        "summary": "Tesla is recalling nearly all Cybertrucks in the US due to an exterior panel issue that could detach while driving. The recall affects over 46,000 vehicles built between November 2023 and February 2027. This recall comes as Tesla faces challenges with stock value decline, competition, and backlash against CEO Elon Musk. The company will replace the faulty panel to address safety concerns.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-20",
        "sentiment": {
            "company": "tesla",
            "score": -0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/25/tech/china-robots-market-competitiveness-intl-hnk/index.html",
        "headline": "Elon Musk thinks robots are a $10 trillion business. He’s got some competition from China",
        "content": "Spinning bright red handkerchiefs and dancing in step to folk music, more than a dozen human-like robots took to China’s biggest stage in January, making a splashy debut at the annual Lunar New Year gala.\n\nThe remarkable performance, watched by more than a billion people, is a high-profile reminder of how far Chinese humanoid robots have come. Over the past two months, videos of the country’s humanoid robots pulling off moves such as bike rides, roundhouse kicks and side flips have blown up the internet, often amplified by state media as a key potential driver of economic growth.\n\nEven though very few of the humanoids are in mass production, competition with Elon Musk’s Tesla, one of the acknowledged frontrunners in the field, is heating up. The promise of an “I, Robot” future, where machines handle household chores and serve as caregivers, has drawn nearly every major tech company in both the United States andChinato bet on humanoids or robotics.\n\nMicrosoft, Nvidia and Amazon founder Jeff Bezos have invested in American humanoid maker Figure AI. Meanwhile, Meta is planning major investments in humanoids, according to aBloomberg reportlast month.\n\nMusk, whose Optimus humanoid has sparked global interest since its debut in 2022, predicted last month that the project alone could generate more than $10 trillion in revenue.\n\nWhile it may take another five to 10 years for humanoid robots to make a real societal impact, they could eventually become the next widely adopted consumer electronics, according to Xi Ning, chair professor of robotics and automation at the University of Hong Kong.\n\n“Everybody will need them, like automobiles, like cellphones, and the potential market volume will be huge,” he told CNN.\n\nGoldman Sachsprojected last year that the global humanoid robot market will be worth $38 billion by 2035. In five years, they estimate that 250,000 humanoid units, mainly for industrial use, will be shipped, while consumers will be buying about one million units a year in about a decade.\n\nBeijing, which is looking to replicate China’s success in the electric vehicle (EV) market, wants to be at the forefront of that growth.\n\nIt’s eager to position the country as a global tech powerhouse and build on the momentum of recent Chinese achievements in the field - such as AI startupDeepSeek’sreasoning model that stunned the world in January - especially as the US tightens tech restrictions on Beijing.\n\nDespite entering the race later than American rivals including Tesla, Boston Dynamics and Figure AI, experts say Chinese firms are rapidly closing the gap. With their preternatural ability to optimize supply chains and cut costs, Chinese firms are also accelerating the mass production of humanoids.\n\nChina already dominates the space for industrial robots, deploying more of them every year since 2021 than all other countries combined, according to theInternational Federation of Robotics, a Germany-based non-governmental organization.\n\nCompared to humanoids, industrial robots typically feature less advanced technology and perform less sophisticated tasks. They’re widely used in industrial settings for manufacturing or transportation.\n\nAs with EVs, Tesla was one of the few big-name frontrunners for humanoids when Musk introduced the project in 2021 and showcased an Optimus prototype a year later. Since then, Beijing has publicly thrown its weight behind the humanoid robotics industry with increasing funding drives and government support.\n\nIn a 2023policy document, China’s Ministry of Industry and Information Technology identified the humanoid robotics industry as a “new frontier in technological competition,” setting a 2025 target for mass production and secure supply chains for core components.\n\n“China started relatively late, but it has its own advantages like a huge market and a relatively complete supply chain for the technology, which enables them to easily develop similar kind of robots at lower price,” said Xi at the University of Hong Kong.\n\nOver the past three years, various local governments – including major cities like Beijing, Shanghai and Shenzhen – have announced plans to establish or have launched investment funds dedicated to developing robotics, totaling at least 73 billion yuan ($10 billion), according to a tally by CNN.\n\nLast month,Chinese leader Xi Jinping chaired a high-profile meetingwith the country’s top business executives. Among those seated in the front row was Wang Xingxing, CEO of Unitree, the company behind the viral dancing robots, an indication of Beijing’s growing focus on this emerging sector.\n\nAside from Unitree, other major domestic players include Shenzhen-based UBTech, Chinese EV giant BYD-backed Agibot, Beijing-based Robotera and Shanghai-headquartered Fourier Intelligence, as well as EV maker XPeng.\n\nExperts say China still trails the West in certain key technologies, even as it dominates the supply chain.  About 56% of the humanoid robot supply chain companies are based in China, according to a Morgan Stanleyresearch reportlast month.\n\nBut China still needs to achieve a breakthrough in “core technologies,” such as processor chips, high-precision sensor and robot operating systems, to reduce its reliance on foreign technology, said Zhang Dan, chair professor of intelligent robotics and automation at the Hong Kong Polytechnic University.\n\nArtificial intelligence chips underpin humanoids’ operating systems, guiding their thinking, perception and motion. Many humanoid developers depend on AI chip giant Nvidia’s products. At its annual developer conference last week, the companyunveileda new AI foundation model for humanoid robots.\n\nCiting national security concerns, the former Biden administration steadily tightened export restrictions on advanced chips that could power China’s military. Beijing has sought to develop its domestic chip supply chain as part of its self-sufficiency drive.\n\nAdditionally, European, American and Japanese companies continue to dominate higher-end components such as sensors, as well as motors and screws that power robotic motions with higher precision and stability, according to aMorgan Stanley reportlast month.\n\nTo overcome those shortcomings, Chinese suppliers are actively trying to do business with Tesla. Many of them have sent component samples for Tesla’s review, according to P.K. Tseng, a senior research manager at TrendForce, a market analysis firm.\n\n“After Chinese supply chain manufacturers supply components to Tesla, they refine them based on testing feedback and then offer the improved versions to domestic manufacturers,” he said.\n\nOver time, this creates a cycle of continuous technological advancements, enhancing the quality of the whole domestic humanoid robotics industry, he explained.\n\nWhile technological gaps remain, China has emerged as a price disrupter in the nascent industry.\n\nShenzhen-based Engine AI released itsPM01 modellate last year for just 88,000 yuan ($12,175), while Unitree’s G1, capable of executing a roundhouse kick, followed at 99,000 yuan ($13,697).\n\nAt aneventlast year, Musk estimated Tesla’s Optimus to be priced between $20,000 to $30,000. Lowering prices for humanoids would mark a major step to their eventual commercialization and wider adoption.\n\nBeyond startups, established EV players like BYD and XPeng have also ventured into the humanoids space. Experts said years of cutthroat competition and a price war in China have honed their ability to scale production rapidly while driving cost down.\n\nSince the manufacturing complexity of humanoid robots shares similarities to those of electric vehicles, particularly in components like sensors and batteries, EV makers have an advantage in this space, according to Brady Helwig, associate director for economy at Special Competitive Studies Project, a US thinktank.\n\nLate last year, XPeng unveiled its humanoid robot, Iron, with plans for mass production by the end of 2025. Around the same time, BYD launched a recruitment drive to develop its own version, having invested in other domestic humanoids makers.\n\nAs the country’sdemographic crisisworsens, the Chinese leadership sees humanoid robots as a potential solution to offset the shrinking working force, Helwig said. China’s population has shrunk for three consecutive years.\n\n“If humanoid robots were able to be scaled and deployed widely across the economy, this is the kind of wild card that could really help alleviate that gap,” he said.",
        "summary": "Chinese humanoid robots showcased their capabilities at China's Lunar New Year gala, signaling the country's advancements in robotics technology. Competition is heating up between Chinese humanoid robots and Elon Musk's Tesla, a frontrunner in the field. Musk predicts his Optimus humanoid project could generate over $10 trillion in revenue, attracting major tech companies like Microsoft, Nvidia, and Meta to invest in humanoids. While it may take 5-10 years for humanoid robots to have a societal impact, experts believe they could become widely adopted consumer electronics in the future.",
        "source": "CNN",
        "tags": [
            "meta",
            "nvidia",
            "tesla",
            "amazon"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25",
        "sentiment": {
            "company": "tesla",
            "score": 0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/20/media/vivian-wilson-teen-vogue-criticism-musk-tesla-trans/index.html",
        "headline": "Musk links trans people to Tesla attacks the same day his estranged daughter criticizes him in Teen Vogue interview",
        "content": "The same day Vivian Jenna Wilson, Elon Musk’s estranged daughter, published her second-ever interview with a media outlet, the billionaire media mogul used his X platform to insinuate trans people are behind reports of attacks on Teslas.\n\nDuring herinterview with Teen Vogue, Wilson said she doesn’t “give a f**k” about Musk, calling him a “pathetic man-child.”\n\n“I don’t give a f**k how much money anyone has,” Wilson told the publication. “I don’t. I really don’t. He owns Twitter. Okay.”\n\nThe 20-year-old said she often learns about Musk’s actions from the news, saying she should “probably post about this and denounce it, which I have done a few times.”\n\n“The Nazi salute sh*t was insane,” Wilson said in reference toMusk’s performanceof a straight-armed salute during Donald Trump’s inauguration thathe has deniedwas a Nazi gesture. “That sh*t was definitely a Nazi salute.”\n\nThis is hardly the first time that Wilson, who has not spoken to Musk since 2020, has called out the billionaire.\n\nIn July 2024, Musk took to his X platform to say that Wilson was “born gay and slightly autistic,” adding that, as a child, she would “pick out clothes for me to wear like a jacket and tell me it was ‘fabulous!’” Three days later,Musk sat down with Jordan Petersonfor a two-plus-hour live stream on X during which the media mogul claimed his “son” had been “killed” by “the woke mind virus.”\n\nMusk’s comments to Peterson effectively denied his daughter’s trans identity, reflecting his embrace of far-right politics, which often seek to crack down on transgender people’s rights and gender affirming care, and foreshadowed the politics he has pushed in his advisory role to Trump.\n\nCNN has reached out to Musk for comment.\n\nWilsontook to Threads— X’s Meta-owned rival — the same day to call out Musk for spreading misinformation, saying that his July 2024 X post was “entirely fake” before adding “literally none of this ever happened.”\n\nLaterthat same day, NBC News publishedan exclusive interview with Wilson, who emphasized that Musk “was under the assumption that I wasn’t going to say anything and I would just let this go unchallenged.”\n\nIn the 12 hours since Wilson’s Teen Vogue interview published, the billionaire has alleged thatNew York will attempt to illegally usher in non-citizen votingand amplified a post claiming that10,000 voters in Arizonaused the same social security number to vote.\n\nMusk alsorepeatedlycirculated postsconnecting the reports of vandalism on Teslas to trans people.\n\n“What are the statistics on trans violence,” Musk asked inyet another X poston Thursday. “The probability of a trans person being violent appears to be vastly higher than non-trans. Hormone injections cause extreme emotional volatility. That is simply a fact.”\n\nMusk on Thursdayalso shared a clip from Fox News in which anchor Harris Faulkner posited a hypothetical in which a Tesla set on fire by vandals could result in a human death, asking White House press secretary Karoline Leavitt if that could merit the death penalty.\n\n“What I can tell you is that President Trump condemns this violence, and he is determined to restore law and order in our country, and he will ensure that the harshest penalties are pursued for those who are engaging in this vicious violence that we have seen targeted at this American company,” Leavitt said in response to Faulkner’s hypothetical scenario.\n\nA self-described “free speech absolutist,” Musk has also used X — which heacquired in October 2022 for $44 billion— to repeatedly attack immigrants and transgender people,and to spread an antisemitic conspiracy theory.\n\nWilson’s interview in Teen Vogue, which also explores her queerness, comes as Trump has madedismantling diversity, equity and inclusion programsa cornerstone of his new administration.\n\nMusk, a Trump ally, has not shied away from voicing his disapproval of DEI programs,calling it“just another word for racism” last year and saying that “DEI must DIE” in aDecember 2023 X post. And, under his supervision, the Department of Government Efficiencyin Februarythreatened to pull federal funding for public schools and universities that failed to end their DEI programs within two weeks.",
        "summary": "Elon Musk's estranged daughter, Vivian Jenna Wilson, criticized him in a Teen Vogue interview, calling him a \"pathetic man-child\" and denouncing his actions. Musk, on the same day, insinuated that trans people were behind attacks on Teslas. Wilson has previously called out Musk for various controversial statements and actions, including denying her trans identity. The relationship between Musk and Wilson remains strained, with Wilson publicly refuting Musk's claims.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-20",
        "sentiment": {
            "company": "tesla",
            "score": -0.8
        }
    },
    {
        "url": "https://www.cnn.com/2023/11/22/tech/openai-sam-altman-chaos-explained-intl-hnk/index.html",
        "headline": "OpenAI’s wild week. How the Sam Altman story unfolded",
        "content": "In a year of wild tech stories that has seenElon Musk transform Twitter, cryptocurrency exchangeFTXcollapse andSilicon Valley Bankimplode, this week’s whiplash-inducing turmoil at OpenAI is among the most captivating.\n\nSam Altman — the leader of one of the world’s most influential AI companies, OpenAI, and perhaps themost visible figure in the fledgling industry— was fired Friday night by the startup’s directorsin a surprise move. Less than five days later, he’s back as the company’s CEO, now with a board that is, in theory, more supportive of his vision.\n\nThe series of extraordinary events unfolded just days after OpenAI held itsfirst-ever developer conference, where it laid out new, commercialized versions of its technology, including the option to customize its ChatGPT AI chatbot.\n\nIf you’re just catching up, here’s what you missed from a week so incredible you’d be forgiven for thinking the script could have been written by an early version of OpenAI’s ChatGPT.\n\nAround 3 p.m. ET, Altman joined a Google Meet call with most of OpenAI’s board that had been convened by fellow co-founder and OpenAI chief scientist Ilya Sutskever, during which Altman was fired and told that the news would soon be made public.\n\nWithin the next half hour, the board also informed Greg Brockman, another co-founder and OpenAI president, that he would be removed from the board.\n\nAround 3:30 p.m. ET, OpenAI publicly announced that it had fired Altman over concerns that he was not always truthful with the board. The board said Mira Murati, the company’s chief technology officer, would become interim CEO.\n\nOpenAI’s strategic partners, including its biggest financial backer Microsoft, were also reportedly informed of Altman’s ouster just minutes before the board’s announcement.\n\nHours after being fired, Altman posted on X that he “loved working with such talented people” and that he would have “more to say about what’s next later.”\n\nBrockman promptly quit. “Please don’t spend any time being concerned. We will be fine,” Brockmansaid in a Friday poston X. “Greater things coming soon.”\n\nA key factor in the CEO’s firing was tension between Altman, who favored developing AI more aggressively, and members of the OpenAI board, who wanted to move more cautiously, according to CNN contributor Kara Swisher, who spoke to sources knowledgeable about the unfolding events.\n\nWithin 24 hours of Altman being fired, reports emerged that he and other ex-OpenAI loyalists were mulling plans for their own venture.\n\nOpenAI’s board was also reportedly having second thoughts and considering asking the ousted CEO to return.\n\nBy Sunday afternoon, Altman wasback at OpenAI’s headquarters — this time with a guest badge — to negotiate his potential return. Microsoft CEO Satya Nadella reportedly mediated the discussion. A 5 p.m. PT deadline was reportedly set for the board to agree to Altman’s demands, including adding a seat for Microsoft, and reinstating him as CEO.\n\nBut those talks broke down.\n\nAs Sunday turned into Monday, Nadella tweeted that Altman, along with Brockman, would join Microsoft to run a new AI research group. At OpenAI, the group found a new interim CEO: Emmett Shear, the former CEO of Amazon’s streaming service, Twitch. Murati would return to her role as OpenAI’s chief technology officer.\n\nIn a post on X early Monday, Shear, who left his role at Twitch in March, described the chance to join OpenAI as “a once-in-a-lifetime” opportunity. He added that the company would hire an independent investigator to report on what happened in the lead-up to Altman’s firing.\n\nBut OpenAI employees were not convinced. More than 500 staffers signed an open letter calling on the company’s board to resign and reinstate Altman and Brockman. They also threatened to follow the co-founders to Microsoft if their demands were not met.\n\nAltman posted on X, saying, “we have more unity and commitment and focus than ever before. we are all going to work together some way or other, and i’m so excited. one team, one mission.”\n\nThe drama was far from over.The Verge reported Monday afternoonthat Altman and Brockman could still return to OpenAI if the board members who fired him resign.\n\nAnd Nadella, speaking to CNBC, said he was “open to both options” when asked whether Altman would actually join Microsoft.\n\n“Look, that is for the OpenAI board and management and the employees to choose,” Nadella said. “We chose to explicitly partner with OpenAI and we want to continue to do so, and obviously, that depends on the people of OpenAI staying there or coming to Microsoft.”\n\nAltman was reinstated late Tuesday as OpenAI’s CEO, the company said on X.\n\n“We have reached an agreement in principle for Sam Altman to return to OpenAI as CEO with a new initial board,” the company said, adding that the board will be chaired by Bret Taylor, a former co-CEO of Salesforce. Former Treasury Secretary Larry Summers will also join the board, alongside existing director, Quora CEO Adam D’Angelo.\n\n“We are collaborating to figure out the details,” it said.\n\nIn his own post on X, formerly Twitter, Altmanwrotethat he is “looking forward” to returning to OpenAI and building on the firm’s “strong partnership” with Microsoft.\n\nIt’s unclear how Shear will be affected by Altman’s return. Posting on X, Shear wrote: “I am deeply pleased by this result, after (some) 72 very intense hours of work … I’m glad to have been a part of the solution.”\n\nBrockman is also returning to OpenAI, according to hispost on X.\n\nUltimately, Microsoft and Altman appear to be the big winners from the dust-up: Altman will continue leading the firm he helped to found. And Microsoft has wrested more control over the company it has backed with billions to bolster its ambitions in developing AI.\n\n“We are encouraged by the changes to the OpenAI board,” Nadellasaidon X. “We believe this is a first essential step on a path to more stable, well-informed, and effective governance.”",
        "summary": "OpenAI experienced a tumultuous week with the firing and reinstatement of Sam Altman as CEO. Altman, a prominent figure in the AI industry, was initially fired over concerns of dishonesty but was quickly reinstated with a more supportive board. The events unfolded shortly after OpenAI's developer conference where new commercialized versions of their technology, like ChatGPT, were introduced. The sudden changes and internal turmoil at OpenAI have garnered significant attention within the tech industry.",
        "source": "CNN",
        "tags": [
            "openai",
            "alphabet",
            "microsoft"
        ],
        "headline_tags": [
            "openai"
        ],
        "timestamp": "2023-11-22",
        "sentiment": {
            "company": "openai",
            "score": 0.2
        }
    },
    {
        "url": "https://www.cnn.com/2025/03/28/tech/apple-iphone-17-siri-upgrades-china/index.html",
        "headline": "Apple needs a new reason to get you to buy a new iPhone. It may have one",
        "content": "Apple’s most profitable product could finally be getting a much-needed change.\n\nThe tech giant is soon expected to make its biggest bet in years, introducing a significantly slimmer iPhone to hopefully reinvigorate interest in its biggest revenue driver.\n\nThe sleeker new iPhone, sometimes referred to as the iPhone “Slim” or “Air” in media reports, could arrive later this year as part of the iPhone 17 lineup, according toBloomberg, theWall Street JournalandThe Information. This would be the most notable iPhone design overhaul in years, possibly since Apple launched the home button-free iPhone X in 2017.\n\nBut will that be enough?\n\nApple’s iPhone business is stable; in its first fiscal quarter, revenue from smartphone sales were roughly the same as they were a year ago and the company’s overall revenue grew by 4%. But the product is facing a host of challenges, including consumers holding onto their iPhones for longer, iPhone revenue missing Wall Street’s expectations this past quarter and Apple losing ground in the Chinese smartphone market to regional competitors. Apple needs to figure out how to grow its most valuable business.\n\nApple did not immediately respond to CNN’s request for comment.\n\nThis is not a new story.Apple has long faced pressure to keep evolving and growing its iPhone segment despite challenges like a sluggish smartphone market and tough competition in China.\n\nThis time, however, Apple’s big bet on artificial intelligence – which it’s been marketing as a selling point for the iPhone 16 – is taking longer than expected to pay off. In the meantime, Apple may have to rely on its physical devices to wow consumers.\n\n“I think there’s more pressure on Apple than there has ever been since Samsung was taking market share” on the strength of its larger displays, said Patrick Moorhead, CEO and chief analyst at tech advisory firm Moor Insights & Strategy.\n\nThe thinner iPhone 17 expected to arrive this year will be about two millimeters slimmer than the current iPhone, according to Bloomberg. It will likely replace the iPhone Plus, the larger version of the base model, in Apple’s smartphone lineup. The phone’s skinnier build is expected to be its main draw; it’ll otherwise share many traits with current iPhones, such as the dedicated camera button and Dynamic Island cutout near the top of the screen, according to Bloomberg’s report.\n\nA move like this could be particularly appealing in China, where product design is a high priority for consumers, said Nabila Popal, a senior director for market research firm the International Data Corporation’s data and analytics team.\n\nChinese appeal is critical because Apple’s China revenue shrunk in its first fiscal quarter of the year: $18.5 billion from $21 billion a year ago. Fourth-quarter sales of the iPhone in China fell 25% year-over-year thanks to increased competition from Chinese brands, according to market research firmCanalys.Chinese tech giant Xiaomi surpassed Apple to become the worldssecond largest smartphone brandin August, Counterpoint Research, another firm that follows the smartphone market, reported in September.\n\n“Hardware innovations are very important to Chinese consumers,” said Popal, who specializes in researching smartphones and consumer tech devices. “And given how well thinness has done with Android models, I think that launching such a device for Apple could help its share” in China.\n\nThe company’s rivals have already beaten Apple to the punch. Samsung in January announced the Galaxy S25 Edge, a sleeker version of its latest smartphone. Oppo, a major player in the Chinese phone market, debuted a super thin version of its foldable phone called the Find N5 in February.\n\nBut some analystssay it’s going to take more than just a flashy new design to entice shoppers. Apple needs to convince consumers to want a new iPhone, whether their old one needs replacing or not.\n\nSmartphones are mature devices; they no longer change much each year, unlike in the early 2010s when buying a new model meant unlocking your phone with your fingerprint for the first time or fitting a much larger screen in your pocket. In a March 25 note, UBS analysts wrote that the average iPhone user (in markets other than China)keeps their phones for longer: 37 months, compared to roughly 34 months in its survey from last year.\n\nApple Intelligence, the name for Apple’s AI-powered software, could be the key to changing that. But the currently available tools aren’t exactly upgrade-worthy. (Think: summarizing notifications, generating custom emojis and asking Siri for tech support.)\n\nApple also recently said its arguably biggest new capability coming in Apple Intelligence, a revamped Siri,has been delayed. Instead of setting alarms and answering questions, the new Siri should be able to take actions in apps on a user’s behalf and incorporate data stored on a person’s iPhone into responses. These arechanges that Apple believes could alter the way we use our phones and interact with apps.\n\nBut consumers are going to have to wait longer to try it.Apple says it’s expected to debut in the coming year.\n\nApple will likely provide a glimpse at what’s next for Apple Intelligence during its Worldwide Developers Conference keynote, which the company announced this week will take place on June 9.\n\nApple’s upcoming announcements – and whether it can deliver on those promises – could help show whether AI will be useful enough to get iPhone users to shell out for an upgrade.\n\nApple needs something big – and maybe that means going thinner. Wall Street will be watching to see whether smarter software or a sleeker design will do the trick.\n\n“If you have an (iPhone)14, or even if you have a 15, there’s probably no economic reason to justify upgrading right now,” said David Vogt, an analyst with UBS. “And I think that’s the pressure that Apple feels.”",
        "summary": "Apple is rumored to be introducing a significantly slimmer iPhone, possibly named iPhone \"Slim\" or \"Air,\" as part of the iPhone 17 lineup later this year. This redesign aims to reinvigorate interest in Apple's most profitable product. Despite stable iPhone revenue, Apple faces challenges like consumers holding onto their phones longer, missing revenue expectations, and losing ground in the Chinese market. The company is under pressure to innovate and grow its iPhone segment, with its big bet on artificial intelligence taking longer than expected to pay off.",
        "source": "CNN",
        "tags": [
            "alphabet",
            "apple"
        ],
        "headline_tags": [
            "apple"
        ],
        "timestamp": "2025-03-28",
        "sentiment": {
            "company": "apple",
            "score": 0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/05/01/tech/proposed-legislation-app-store-age-verification-lee-james",
        "headline": "New proposed law would require Apple and Google to verify your age before letting you into their app stores",
        "content": "A pair of Republican lawmakers are set to propose a new law that would require app stores to verify the ages of all users and share that information with app developers, following asimilar state lawthat was signed in Utah earlier this year.\n\nIf passed, the legislation, called the App Store Accountability Act, could mark the first major federal online safety legislation in years and would significantly change how users engage with app stores. The law would go into effect one year after its passing.\n\nThe proposed law could make it easier, in theory, for tech platforms to provide safe experiences for kids. But app store operators and privacy experts have noted that the approach could raise legal and practical questions, including how to verify the ages of young users without government IDs.\n\nThe bill — set to be introduced by Sen. Mike Lee of Utah and Rep. John James of Michigan on Thursday — would require app store operators with at least 5 million users to verify users’ ages when they sign up for an account, according to a draft provided exclusively to CNN.\n\nApp stores, including those run by Apple and Google, would be required to inform app developers of a user’s age category — “young child” as under the age of 13; “child” as 13- to 15-years-old; “teenager” as 16- to 17-years-old; or “adult” as 18 or older — while protecting their personal information. Parental consent would be required before minors can download or make purchases through an app.\n\nLee said in a statement that the legislation is designed to prevent children from accessing apps where they could be exposed to “violent and sexual material while risking contact from predators online.”\n\n“Our legislation brings age verification and accountability to the source of the problem,” Lee said.\n\nThe proposal comes as lawmakers and tech platforms have faced pressure to make the internet safer, especially for young users.\n\nIts passing would be a major win for social media companies, including Meta, Snap and X, thathave endorsed the ideaof making app stores a sort of central clearinghouse for age verification. That way, individual platforms could provide safer experiences for young users without having to check their ages themselves.\n\n“Parents want a one-stop shop to verify their child’s age and grant permission for them to download apps in a privacy-preserving way. The app store is the best place for it,” Meta, X and Snap said in a joint statementafterthe similar legislation in Utah passed.\n\nApple and Google, however, have pushed back on legislation that would require them to verify the ages of all users, saying that app stores and app developers should share responsibility for age verification. They’re also pushing for privacy-protected age data to be shared only with platforms that need it.\n\n“While only a fraction of apps on the App Store may require age verification, all users would have to hand over their sensitive personally identifying information to us — regardless of whether they actually want to use one of these limited set of apps,” Apple, which has long made privacy central to its brand,said in a reportpublished in February. “That’s not in the interest of user safety or privacy.”\n\nBoth Apple and Google also already take steps to prevent “objectionable” content, such as graphic violence or pornography,on their app stores. But many parents and online safety experts are most worried about mainstream social media apps like Snap and Meta’s Instagram, although those companies have ramped up youth safety efforts in recent years.\n\n“We believe in shared responsibility between app stores and developers, and think it’s critical to protect children’s privacy and the decision rights of parents,” Google spokesperson Danielle Cohen said in a statement. “We’ll continue engaging with Congressional leaders on this important issue.”\n\nApple did not immediately respond to a request for comment.\n\nPrivacy and legal experts have previously raised concerns about the app store age verification approach.\n\nWhile users wouldn’t have to hand over information to verify their age across multiple platforms, they’d still need to provide personal data — likely a government ID or ascan of their face— to verify their age. And it wouldn’t just apply to children, but to anyone who uses the app store, regardless of what apps they want to access.\n\nTech industry-backed advocacy group Chamber of Progress alsopreviously warnedthat the Utah law could run afoul of the First Amendment by forcing adults to choose between handing over personal information or accessing “legally protected online speech.”\n\nBut the two GOP lawmakers who have proposed the App Store Accountability Act say the bill would provide needed support for parents and caregivers, who are currently under pressure to closely monitor their kids’ social media use.\n\n“Kids cannot consent — and any company that exposes them to addictive or adult material should be held accountable,” James said in a statement. “The App Store Accountability Act holds Big Tech companies to the same standard as local corner stores.”\n\nThis story has been updated with additional developments.",
        "summary": "A new proposed law, the App Store Accountability Act, aims to require app stores like Apple and Google to verify users' ages and share that information with app developers. This legislation, set to be introduced by Sen. Mike Lee and Rep. John James, targets app store operators with at least 5 million users. The bill would categorize users into age groups and require parental consent for minors to download or make purchases through apps. The goal is to enhance online safety for children and prevent them from accessing inappropriate content.",
        "source": "CNN",
        "tags": [
            "3m",
            "apple",
            "alphabet"
        ],
        "headline_tags": [
            "apple",
            "alphabet"
        ],
        "timestamp": "2025-05-01",
        "sentiment": {
            "company": "apple",
            "score": 0.2
        }
    },
    {
        "url": "https://www.cnn.com/2025/05/01/business/gm-ceo-barra-tariffs-cost",
        "headline": "GM CEO Mary Barra: Tariffs will cost us $5 billion, and prices ‘will stay at the same level’",
        "content": "The Trump administration’s tariffs on imported cars and auto parts will cost General Motors between $4 billion and $5 billion this year. But in an interview on CNN, CEO Mary Barra said the company doesn’t necessarily expect to pass those higher costs onto consumers in the form of ﻿elevated prices.\n\n“We believe …pricing is going to stay at about the same level as it is,” she told CNN’s Erin Burnett Thursday, although she added, “Pricing changes in our industry at least monthly, and sometimes more frequently. We’re going to respond to the market.”\n\nThe company does expect the higher tariff costs to eat into its earnings as it slashed its profit guidance for the year. The estimated tariff cost, and the lower profit target, wererevealed in a letter to shareholders from Barrareleased early Thursday. The letter and guidance were delayed from their planned release on Tuesday, when the company reported lower first-quarter earnings and awaited tariff changes from the Trump administration.\n\nThe lower earnings guidance resulted in GM halting plans to spend additional billions in repurchasing its stock, a move it announced Tuesday. But it’s not just investors who could be hurt by lower profits. The roughly 45,000 members of the United Auto Workers union also get profit sharing payments from the company annually. They received record payments of up to $14,500 for 2024.\n\nGM is the first major company to estimate, in dollars, how much President Donald Trump’s sweeping tariffs will cost it. Many others have walked back earnings forecasts because of the ensuing economic uncertainty.\n\nTrump’s tariffs have unnerved not only global companies, but investors, nations and everyday Americans alike. Major stock indexes closed out a volatile April, and on Wednesday new data showed that the US gross domestic product unexpectedly shrank in the first three months of the year as recession fears abound.\n\nThe auto industry has been a particularly central target for Trump’s tariff efforts, with levies already in place on most imported automobiles and tariffs coming this Saturday on many of the imported parts used to build cars at American factories.\n\nWhile GM is not the dominant global auto player it once was, it is still the largest American automaker, with US sales of 2.7 million cars and trucks last year.\n\nIt also has been very profitable, posting net income of nearly $12 billion in 2024, excluding special items. Barra’s letter says that 1 million US workers depend on GM, either as employees, suppliers or dealers, with 50 US manufacturing plants and parts facilities in 19 states.\n\nBut Barra’s letter says the company now expects adjusted earnings before interest and taxes of between $10 billion and $12.5 billion this year, sharply lower than the record $14.9 billion it earned on that basis last year, andless than the guidance it gave in January before Trump announced his levies.\n\nGM faces tariffs on several fronts. It builds cars and trucks in Mexico and Canada, producing nearly 1 million vehicles in those two countries last year, according to S&P Global Mobility. Most of those vehicles end up being exported to US dealerships.\n\nIn addition, GM imported more than 400,000 vehicles from South Korea last year. All imported cars now face a 25% tariff, although the Canadian and Mexican tariffs can be reduced by credits for American- and Canadian-made parts.\n\nIn fact, all the 1.7 million cars and trucks GM built in the US last year depended on imported parts to some degree. According to an estimate from American University Kogod School of Business, GM’s US-built vehicles have American parts making up an average of 54% of their content.\n\nStarting this Saturday, GM could face 25% tariffs on many of those imported components. While the Trump administration announced some partial offsets, GM could still face substantial costs.\n\nNevertheless, Barra thanked the Trump administration for the break on auto parts tariffs  and raised hopes for further changes.\n\n“We look forward to maintaining our strong dialogue with the administration on trade and other policies as they continue to evolve,” she said. “As you know, there are ongoing discussions with key trade partners that may also have an impact.”\n\nCar prices are not directly set byautomaker. Instead, prices are the result of millions of individual negotiations that take place between dealers, who are independently-owned businesses that buy cars wholesale from manufacturers, and car buyers.\n\nIf the 25% tariffs on imported cars cause a drop in the supply of vehicles being shipped to dealers, that can put upward pressure on pricing. The economic law of supply and demand suggests that less supply and unchanged demand will push prices higher.\n\nThat’s what happened in 2021, when a shortage of computer chips during the Covid-19 pandemic caused a sharp cut in production across the auto industry. The average new car price jumped 17% between January and December of 2021, according to Edmunds’ data. The shortage, coupled with higher prices, sent many typical new car buyers into the used car market, which rose even faster at 32%.\n\nBut car buyers in 2021 were enjoying low interest rates andfederal stimulus checks. Neither is available to spur demand today. And current surveys show verylow consumer confidencefed by fears of a possible recession.\n\nHowever, many car buyersrushed to buy carsin March and early April on fears that prices would rise due to tariffs, pulling forward some sales that might have taken place later in the year. So softer demand could keep prices in check.",
        "summary": "General Motors (GM) CEO Mary Barra stated that the Trump administration's tariffs on imported cars and auto parts will cost the company between $4 billion and $5 billion this year. Despite the higher costs, GM does not plan to raise prices for consumers. The company expects the tariff costs to impact its earnings, leading to a lowered profit guidance for the year. GM's decision to halt stock repurchases due to lower earnings could also affect investors and United Auto Workers union members who receive profit sharing payments.",
        "source": "CNN",
        "tags": [
            "tsmc",
            "general_motors",
            "target",
            "costco"
        ],
        "headline_tags": [
            "costco",
            "general_motors"
        ],
        "timestamp": "2025-05-01",
        "sentiment": {
            "company": "general_motors",
            "score": -0.5
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/30/business/tesla-board-elon-musk-ceo-search",
        "headline": "Tesla dismisses report of board plan to replace Elon Musk",
        "content": "Tesla’s chair Robyn Denholm has rejected a Wall Street Journal report that the company’s board has begun a search process for a new CEO to replace Elon Musk.\n\nThe Journal reported Wednesday that Tesla’s board contacted executive placement firms in March to look for Musk’s replacement, citing multiple unnamed sources.\n\nDenholm said in a post on Tesla’sofficial Xaccount that the claim was “absolutely false,” and the board is “highly confident in his ability to continue executing on the exciting growth plan ahead.”\n\nThe stunningreporthighlighted the volatility the electric car maker has faced in recent months, as Musk spent a significant amount of his time working for the White House’s Department of Government Efficiency (DOGE) initiatives.\n\nTesla’s (TSLA) stock price had tumbled as much as 45% this year before recovering somewhat amid a broader stock market rebound. In April, the company reported a sharp decline in both sales and profit in the first quarter, with earnings plummeting71%– a shocking report that was perhaps overshadowed by Musk’s announcement the same day that he would be stepping back from his government role and returning to Tesla.\n\nThe Journal said it was unclear whether Musk’s announced return altered the status of the succession planning. Around the same time the board began looking for a potential new CEO, directors told Musk that he needed to spend more time at the company, according to the report. Musk didn’t push back, the Journal said.\n\nMuskposted on XThursday, “It is an EXTREMELY BAD BREACH OF ETHICS that the@WSJwould publish a DELIBERATELY FALSE ARTICLE and fail to include an unequivocal denial beforehand by the Tesla board of directors!”\n\nThe Wall Street Journal in a statement said it stands by its reporting.\n\n“Tesla was given the opportunity to provide a statement before publication, which they did not do,” a Journal spokesperson said.\n\nAnalysts led by Dan Ives, global head of technology research at financial services firm Wedbush Securities, saidMusk “did the right thing”by recommitting as Tesla CEO, and expressed confidence he would remain in the role for “at least five years.”\n\n“This situation with Musk at DOGE was reaching a breaking point, but we believe that cooler heads have now prevailed and that the Board is now NOT actively looking to replace Musk as CEO and this code red situation is now in the rearview,” they said in a Wednesday research note published before Denholm released a statement.\n\nAt a Cabinet meeting Wednesday, President Donald Trump thanked Musk for his service in his government role – one that is officially ending soon, although Musk is expected to continue some of his work with the White House after he steps back.\n\n“You have been treated unfairly, but the vast majority of people in this country really respect and appreciate you, and this whole room can say that very strongly. You’ve really been a tremendous help,”Trump told Musk Wednesday. “You’re invited to stay as long as you want. At some point, I guess, he wants to get back home to his cars.”\n\nMusk, who was wearing a hat on top of another hat, quipped: “Well, Mr. President, you know they say I wear a lot of hats.”\n\nTrump officials and Cabinet members have feuded, and Treasury Secretary Scott Bessent got into a shouting match with Musk earlier this month.\n\nBut Musk arguably faced much more turmoil at Tesla:Protestsoutside the company’s showrooms have become routine. What was once a symbol of pride among environmentalists has now become a brand that faces significant andperhaps irreparable damageamong its former fanbase.\n\nEven before he took on a role in Trump’s White House, investors had criticized Musk for spending too little time at his only publicly traded company. Musk in 2022 bought Twitter, now X, and spent a significant amount of his energy over the past few years radically reshaping that company. Although he is no longer CEO, he plays an active role in its operations and has been criticized for engaging in conspiracy theories,making bigoted statementsand elevating far-right and Nazi propagandists.\n\nMusk also runs SpaceX, a major government contractor that stands to benefit from his relationship with the Trump administration.\n\nBut Tesla has been cast into the middle of Trump’s damaging trade war with China. Although Musk has publicly advocated for lower tariffs and has publicly feuded with Trump’s top trade adviser, Peter Navarro, Musk appears to have made little headway with Trump, and Tesla’s China sales are under threat.\n\nTrump’srecent softening of his auto tariffs plan, however, stands to benefit Tesla in the United States, because it manufactures most of its cars in America but imports many parts. Those parts were set to get charged a 25% tariff starting this weekend, but Trump’s recent executive actions will temporarily reduce that burden for American manufacturers like Tesla.\n\nOn his call last weekwith Tesla investors and analysts, Musk admitted, “There’s been some blowback for the time that I’ve been spending in government with the Department of Government Efficiency.”\n\nHe announced that starting in May he would be stepping back from his nearly full-time job running DOGE and spending only a day or two a week on its efforts.\n\n“My time allocation to DOGE will drop significantly,” he said. “Starting next month, I’ll be allocating far more of my time to Tesla.”\n\nHe suggested that he could step away because “the major work of establishing the Department of Government Efficiency is done.” But evidence suggests potential Tesla buyers have turned away from the company because of Musk’s high-profile support of the Trump administration as well asfar-right political parties in Europe.\n\nTesla just reported it worst drop in sales in its history, which led to its massive profit decline in the quarter.\n\nWhile Musk tried to dismiss the impact of the protests on Tesla sales and results, Tesla CFO Vaibhav Taneja has acknowledged the hit to sales from the controversy in the call with investors.\n\n“There has been a lot of speculation as to the reasons for decline of our vehicle deliveries in first quarter,” he said. “The negative impact of vandalism and unwarranted hostility towards our brand and our people had an impact in certain markets.”\n\nIn recent months, Musk has expressed to a confidant that he no longer wants to be CEO of Tesla, that person told the Journal. Musk reportedly said that he was concerned a replacement would fail to realize his vision to make Tesla a company that sells autonomous vehicles as its primary business – but he was motivated to leave anyway, perhaps, after he lost another court battle to receive his astronomically high pay package, the largest for any public company on record.\n\nMusk owns 410 million shares of Tesla stock outright, equal to 12.8% of the company’s outstanding shares. He has also been granted options to buy an additional 304 million shares as his compensation for running the company since 2018.\n\nHowever, that compensation package has been thrown out twice by a state judge in Delaware, where Tesla used to be incorporated. Assuming those options are restored, he would control 22.2% of the company’s shares.\n\nMembers of the Tesla board testified in the Delaware court case in 2022 that they felt it was necessary to grant Musk that massive package of stock options because of the importance of keeping him involved and focused on running Tesla.",
        "summary": "Tesla's chair, Robyn Denholm, has refuted a Wall Street Journal report claiming that the company's board is seeking a new CEO to replace Elon Musk. The report highlighted Tesla's recent volatility, including Musk's involvement with government initiatives. Despite a sharp decline in sales and profit, Tesla's stock price has somewhat recovered. Musk criticized the Journal for publishing a false article, while the Journal stands by its reporting.",
        "source": "CNN",
        "tags": [
            "apple",
            "tesla",
            "chevron",
            "exxon"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-04-30",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/30/tech/apple-app-store-competition-ruling",
        "headline": "US judge rules Apple violated order to reform App Store",
        "content": "Apple violated a US court order that required the iPhone maker to allow greater competition for app downloads and payment methods in its lucrative App Store and will be referred to federal prosecutors, a federal judge in California ruled on Wednesday.\n\nUS District Judge Yvonne Gonzalez Rogers in Oakland said in an 80-page ruling that Apple failed to comply with her prior injunction order, which was imposed in an antitrust lawsuitbrought by “Fortnite” maker Epic Games.\n\n“Apple’s continued attempts to interfere with competition will not be tolerated,” Gonzalez Rogers said. She added: “This is an injunction, not a negotiation. There are no do-overs once a party willfully disregards a court order.”\n\nGonzalez Rogers said she will refer Apple to federal prosecutors for a criminal contempt investigation into its conduct in the case.\n\nNeither Apple nor Epic immediately responded to a request for comment.\n\nEpic accused Apple of stifling competition for app downloads and overcharging commissions for in-app purchases.\n\nGonzalez Rogers in 2021 found Apple violated a California competition law and ordered the company to allow developers more freedom to direct app users to other payment options.\n\nApplefailed last yearto persuade the US Supreme Court to strike down the injunction.\n\nEpic Games told the court in March 2024 that Apple was “blatantly” violating the court’s order, including by imposing a new 27% fee on app developers when Apple customers complete an app purchase outside the App Store. Apple charges developers a 30% commission fee for purchases within the App Store.\n\nApple also began displaying messages warning customers of the potential danger of external links in order to deter non-Apple payments, Epic Games alleged, calling Apple’s new system “commercially unusable.”\n\nApple has denied any wrongdoing. The company in a court filing on March 7 told Gonzalez Rogers that it undertook “extensive efforts” to comply with the injunction “while preserving the fundamental features of Apple’s business model and safeguarding consumers.”\n\nGonzalez Rogers suggested at an earlier hearing that changes made by Apple to its App Store had no purpose “other than to stifle competition.”",
        "summary": "A US judge ruled that Apple violated a court order to allow greater competition for app downloads and payment methods in the App Store, as part of an antitrust lawsuit brought by Epic Games. The judge will refer Apple to federal prosecutors for a criminal contempt investigation. Apple has been accused of stifling competition and overcharging commissions for in-app purchases, with Epic Games alleging that Apple's actions are in violation of the court's order.",
        "source": "CNN",
        "tags": [
            "apple"
        ],
        "headline_tags": [
            "apple"
        ],
        "timestamp": "2025-04-30",
        "sentiment": {
            "company": "apple",
            "score": -0.7
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/30/business/ford-ceo-tariffs",
        "headline": "Ford CEO extends ‘employee pricing.’ But price hikes could come this summer",
        "content": "Ford CEO Jim Farley announced Wednesday on CNN that the automaker is extending its “employee pricing” offer to car buyers for another month, through July 4, to encourage sales to consumers nervous about rising prices because of new tariffs on imported cars and auto parts.\n\nFarley spoke with CNN’s Erin Burnett to talk about auto tariffs, the US economy and the economic impact of automaking at US plants.\n\nBut Farley said he can’t say that Ford prices won’t go up up after the end of the employee pricing offer. He said part of it will be determined by what competitors do with their pricing, since Ford makes more of its vehicles in United States than other automakers.\n\n“We want to keep our prices competitive and low,” he said. “We think this is an opportunity for Ford. We have a different footprint, a different exposure for tariffs.”\n\nAuto tariffs, including a 25% tax on all imported cars, have shaken up the global industry. The import taxes will increase the cost for manufacturers, which in turn is expected to raise the price buyers pay for cars later in the year.\n\nAbout 46% of US car purchases last year were for cars or trucks made in a foreign country, according to S&P Global Mobility. Mexico was the largest source, shipping 2.5 million cars to US dealerships. So far, car buyers have been able to purchase imported vehicles shipped here before the tariffs took effect, but those inventories will soon start to run low.\n\nAnd soon not even American-built cars will be tariff free. New tariffs will go into effect this Saturday on the parts used to build cars and trucks in the United States,which will raise the cost of production.\n\n“We have to import certain parts,” Farleysaid. “We can’t even buy those parts here.”\n\nPresident Donald Trump announced Tuesdaysome relief from tariffs on the auto partsthat are set to take effect this Saturday. But automakers will still have to pay tariffs on cars and trucks they build here if more than 15% of the parts come from foreign suppliers.\n\n“We have worked with his team every day for the last couple of months,” Farley said when asked if he has a direct line to Trump. “We recognize how important this moment is to get this all right and try to figure it out together. I have to say the engagement there has been very high.”\n\n“We’re all trying to figure this out to do the right thing for the country,” he added. “It’s going to take a little time.”\n\nFarley said it’s not clear that American automakers can source all of their parts from US suppliers, and he defended the use of cheaper imported parts.\n\n“The affordability of parts is a really important thing for America because we’ve got to keep the vehicles affordable,” he said. ‘Yes we want to make them like Ford does in the US, but we also want to make the vehicles affordable that are built in the US. The parts are critical for that.”\n\nAt an event later in the morning Wednesday, Farley said that the tariff changes on Tuesday are helpful but that more changes are needed.\n\n“The changes this week to the tariff plans will help ease the impact of tariffs on automakers, suppliers, and consumers,” he said. “But we need to continue to work closely with the administration on a comprehensive set of policies to support our shared vision for a healthy and growing auto industry in America. We are not there yet.”\n\nAnderson Economics Group, a Michigan-based research firm, estimated a month ago that the auto parts tariffs would raise the cost of producing cars at American plants between $3,000 to $12,000. Tuesday’s change would lower the tariff cost by about $900 to $2,500, the company estimated.\n\n“It’s a significant reduction, but it’s still a big tariff impact from point of view of the consumer,” said Patrick Anderson, the founder and president of the research firm.\n\nThe employee pricing is part of Ford’s “From America, For America” campaign, as the company seeks to cast itself as a company deeply rooted in, and entwined with, this nation, as Trump pressures companies to come to shift production from foreign plants to US plants. In addition to the new tariffs on auto parts about to go into effect, there has been a 25% tariffs on imported vehicles in effect since earlier this month.\n\nMost major automakers, including Ford, build some of the cars they sell to Americans at foreign plants. Ford builds a greater percentage of its cars at US plants than any other major automaker other than Tesla. Ford built 2 million cars at American plants in 2024, as well as 391,000 in Mexico and 54,000 in Canada, according to S&P Global Mobility.\n\nOne example of that: The 2025 Ford Expedition, which is assembled at Ford’s Kentucky Truck plant in Louisville, Kentucky. But according to government estimates, only 42% of its parts come from Canada or the United States, and the rest comes from lower-wage countries like Mexico. Farley conducted interviews with CNN and other media Wednesday from the factory.\n\nAt a rally in Michigan Tuesday, President Trump repeated his past claims that automakers are rushing to build new American plants due to his auto tariffs.\n\n“They all want to come back to Michigan and build cars again. You know why? Because of our tax and tariff policy,” he said. “They’re coming up and they’re opening up plants, and they’re talking to us all day and night. They’re coming at levels you’ve never seen before.”\n\nBut no automaker has publicly announced plans for a new US plant in response to tariffs. Auto industry experts also say it will take years for any automaker to build a new US plant or reopen a previously closed facility.\n\nStellantis, which builds North American cars under the Jeep, Ram, Dodge and Chrysler brands, has announced plans toreopen a closed auto plant in Belvidere,Illinois. But the company agreed to do that as part of a 2023 labor agreement with the United Auto Workers union, more than a year before Trump’s election.\n\nGeneral Motors recently increased production at its Fort Wayne, Indiana, plant by about 1,000 vehicles a week. But that is a fraction of its previous output of more than 1,300 trucks a day and has been incremental, not a shift from Mexican or Canadian plants.\n\nWhen asked by Burnett if Ford would build new plants or shift production from Mexico to America, Farley mentioned that it is building new factories in Tennessee and Ohio. But those plants were announced during the Biden administration and have nothing to do with tariffs.\n\nThey are also being built to produce electric vehicles and EV batteries, partly with the help offederal loansapproved as part of the Biden administration’s support for a transition to EVs. Trump has promised to rollback federal support for EVs.\n\nThis story has been updated with additional context and developments.",
        "summary": "Ford CEO Jim Farley announced an extension of the \"employee pricing\" offer through July 4 to boost sales amidst concerns about rising prices due to new tariffs on imported cars and parts. Farley emphasized the need to stay competitive with pricing, especially as tariffs impact the industry. The looming tariffs on imported cars and parts are expected to increase costs for manufacturers and subsequently for buyers, affecting both foreign and American-made vehicles.",
        "source": "CNN",
        "tags": [
            "general_motors",
            "ford",
            "stellantis",
            "rivian",
            "costco"
        ],
        "headline_tags": [
            "ford"
        ],
        "timestamp": "2025-04-30",
        "sentiment": {
            "company": "ford",
            "score": 0.2
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/30/investing/us-stock-market",
        "headline": "S&P 500, Dow close out April in the red as economy contracts for first time since 2022",
        "content": "April was one of the wildest months in recent memory for markets, capped off by a key data release that showed the economy shrank last quarter for the first time in years.\n\nAfter tumbling Wednesday morning, the S&P 500 and the Dow gradually clawed back losses and pushed into the green to close out the day. The Dow gained 142 points, or 0.35%. The S&P 500 rose 0.15%. The tech-heavy Nasdaq Composite fell 0.09%.\n\nThe S&P 500 and Dow notched a seven-day winning streak, their best continuous rally this year. However, the indexes closed out April in the red as the stock market has been trying to recover from a steepslumpcaused by President Donald Trump’s tariffs. The S&P 500 and Dow posted their third consecutive month in the red, their longest monthly losing streak since 2023. The Nasdaq, which entered abear marketin early April, managed to eke out a gain of 0.85% across the month.\n\nStocks initially fell Wednesday after fresh Commerce Department data showed the US economy contracted in the first quarter for the first time since 2022. Trump’s policy agenda has injected enormous uncertainty into businesses across the United States and shaken consumer confidence.\n\nStocks pared some losses as new data showedinflationslowed in March and the Fed’s preferred inflation gauge cooled, matching expectations and offering brief reassurance that inflation, while elevated, has been easing. Trump’s tariffs are expected to push up prices again.\n\nThe S&P 500droppedmore than 11% in the first eight days of the month as Trump on April 2 unveiled his “reciprocal” tariffs. After turmoil in the bond market and Trump’s 90-day pause on most tariffs, the benchmark index has since regained ground but ended the month down about 0.76%.\n\nAs stock futures dropped Wednesday morning, Trump posted on social media, “This is Biden’s Stock Market, not Trump’s. I didn’t take over until January 20th.”\n\n“Tariffs will soon start kicking in, and companies are starting to move into the USA in record numbers,” Trumpwrote. “Our Country will boom, but we have to get rid of the Biden ‘Overhang.’ This will take a while, has NOTHING TO DO WITH TARIFFS, only that he left us with bad numbers, but when the boom begins, it will be like no other. BE PATIENT!!!”\n\nThe stock market during Trump’s second term recorded the third-worstperformanceduring the first 100 days of any presidential term in US history, following only President Richard Nixon and President Gerald Ford.\n\n“We don’t expect that it’ll be some sort of sudden recovery, unless all of a sudden the tariffs are all removed,” said Kelly Bouchillon, senior partner at Sound View Wealth Advisors. “And, you know, make no mistake about it. This is very clearly brought on by the uncertainty surrounding the tariffs, period.”\n\nIn comparison, the stock market soared 5% across Trump’s first 100 days of his first term and 8.5% across President Joe Biden’s first 100 days, according to data from CFRA Research. The S&P 500 soared to back-to-back gains of more than 20% across Biden’s last two years in office, a feat not achieved since the 1990s.\n\nAfter a volatile month for markets, investors are trying to assess whether the United States will enter or avoid a recession in the coming months. While the S&P 500 has steadily climbed out of its slump, uncertainty lingers about how Trump’s trade policy might continue to impact the economy and markets.\n\nOther data released Wednesday showed that companies slowed hiring this month. The private sector added 62,000 jobs in April, down significantly from adding 147,000 jobs in March, according to ADPdata. “Unease is the word of the day,” said Nela Richardson, chief economist at ADP, in a statement.\n\n“How things pan out over the next hundred days in the US and elsewhere will partly hinge on whether US markets (Treasuries in particular) and corporate America continue to act as effective guardrails against Trump’s policies, as they appear to have done since April 2,” said John Higgins, chief markets economist at Capital Economics, in a note.\n\nAs stocks whipsawed this month, volatility gripped Treasuries and the dollar broadly weakened, leaving investors wondering whether this was just a bout of extreme abnormality or a foreshadowing of more turmoil to come.\n\nTypically, when stocks sell off during moments of immense uncertainty, investors seek refuge in safe havens like US government bonds and the dollar. Yet that key relationship largely broke down during a sell-off in all three American assets.\n\n“Market participants were a little bit caught off guard in terms of the tariffs coming in much higher than what they would have expected,” said Charlie Ripley, senior investment strategist at Allianz Investment Management. “That caused a lot of market volatility.”\n\nThis month has been a rollercoaster for bonds. The yield on the 10-year Treasury has dipped below 4%, spiked above 4.5% and since come down below 4.2%. Yields and prices trade in opposite directions.\n\nWhile unnerving, the volatility in the Treasury market proved to be a formidable test for how far the Trump administration would go before backing down on its tariff policy, Ripley said.\n\n“They have big ambitions from a trade policy perspective, and the market clearly told them they can only go so far,” Ripley said.\n\nMeanwhile, the US dollar has sharply weakened against currencies like the euro and the yen. These are rapid shifts in markets — and occurring at the same time as the brief slump in stocks has shaken investor sentiment.\n\nWhether the market can continue to serve as a restraint on Trump’s intent to implement aggressive trade policy has ignited debate on Wall Street.\n\n“The Trump administration, like others before it in the US and elsewhere, tempers its policies when faced with a nervous Treasury market,” said Kit Juckes, chief FX strategist at Societe Generale, in a Tuesday note.\n\n“But the desire to reorganize the global trading system, and the belief that this can be achieved without hurting the US economy, has deep roots. That means that for every time the language from Washington is tempered by market events, the language will re-escalate as the market calms down,” Juckes said.\n\nCommerce Secretary Howard Lutnick on Tuesday toldCNBCthat Trump is not focused on the markets. “That may have been whatever it was in the first term,” Lutnick said. “This term, he’s trying to reset global trade.”\n\nJeff Buchbinder, chief equity strategist at LPL Financial, said in a Tuesday note: “Unfortunately, history tells us April showers likely won’t bring us May flowers. The old investor adage of ‘sell in May’ also suggests US stocks may continue to chop along in the near future, with the potential for more bouts of volatility in the months ahead.”",
        "summary": "The S&P 500 and Dow closed out April in the red as the US economy contracted for the first time since 2022. Despite a seven-day winning streak, both indexes ended the month with their third consecutive monthly losses. The market has been volatile due to uncertainty caused by President Trump's tariffs and their impact on businesses and consumer confidence.",
        "source": "CNN",
        "tags": [
            "dow"
        ],
        "headline_tags": [
            "dow"
        ],
        "timestamp": "2025-04-30",
        "sentiment": {
            "company": "dow",
            "score": -0.6
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/25/tech/chan-zuckerberg-primary-school-closing",
        "headline": "A tuition-free school created by Mark Zuckerberg and Priscilla Chan will shutter next year",
        "content": "In 2016, Mark Zuckerberg and his wife, Priscilla Chan,opened a tuition-free schoolfor low-income families in California’s Bay Area, where Meta is headquartered.\n\nCreated under the couple’s philanthropy, the Chan Zuckerberg Initiative (CZI), the Primary School aimed to combine healthcare and education for students “from birth through high school.” Chan, a former pediatrician,once describedthe organization’s education efforts as combining her two core passions.\n\nBut last week, the Primary School abruptly announced plans to shut down at the end of the 2025-26 school year. The school called the closure a “very difficult decision,” but offered little explanation, in a message to the hundreds of families that it serves across two campuses.\n\nThe closure comes amid bigger shifts by CZI and its namesake leaders, and asBig Tech broadly repositionsitself in the era of President Donald Trump.\n\nParents were told that the school was shuttering because CZIwas withdrawing its support, according to reports from theSan Francisco Standardand theNew York Times. A representative for the Chan Zuckerberg Initiative told CNN that the school’s board of directorsmade the decision and pointed to its statement, but did not respond to an additional question about the group’s funding for the school. CZI plans to donate $50 million to the communities and families affected by the closure, the school said in its note this week.\n\nCarson Cook, the Primary School’s senior manager of strategy and advancement, confirmed in an interview with CNN that the school began meeting with parents to inform them of the closure last Thursday and said those conversations are ongoing. But he declined to comment on the reasons behind the closure or the timing.\n\n“At the Primary School, our model has always been one that carefully considers the needs of the whole family, and we want to do our absolute best to ensure that every child and their caregiver is supported,” Cook said. “And I think what we just want to say is that that hasn’t changed.”\n\nCook declined to comment on CZI. The philanthropyhas recently undergone a series of significant changes. In February, the organizationtoldemployees it would cut internal and external diversity, equity and inclusion efforts.\n\nThat followed asimilar movea month earlier by Zuckerberg’s company Meta — one of severalTrump-friendly changesthe social media giant has made since the start of this year. Zuckerberg and Chan also attendedTrump’s inauguration, where they were seated prominently among other Big Tech leaders.\n\nWhen Chan and Zuckerberg founded their philanthropy initiative in 2015 —at the same time that Zuckerbergpledgedto give away 99% of his Facebook fortune — they did so with four goals: personalized learning, curing diseases, connecting people and community building.\n\nThe group said it was dedicated to improving health outcomes and invested in other education projects and immigration and criminal justice reform efforts.The Primary Schoolwas among the first of those investments.\n\nIn acolumnfor CNN the year after the Primary School’s founding, Chan wrote that the organization wanted to address “toxic stress” among children that can be caused by abuse, neglect or poverty. She said the school’s early success proved that “children and adults can build resilience and thrive even in the face of trauma.”\n\nThe Primary School had become a model for other organizations — just last month, its medical directorhosted a sessionat the SXSW conference about how integrating early childhood education and healthcare could help “the most vulnerable children and families.” More than 95% of the school’s students are “underrepresented minorities,” the Primary School reported in a 2023 taxfiling.\n\nThe school’s unique approach involved pairing parents with “parent wellness coaches,” in an effort to support not just kids, but whole families. Cook said those coaches will work directly with parents to explore other schooling options for their children after the Primary School closes next year.\n\nIn the years after the school was founded, as Meta grew and gained influence, Zuckerberg and Chan continued to speak out about social issues.\n\nIn 2017, Zuckerbergpledged to visit and meetwith people in every US state — evensparking rumorsthat he might make a bid to challenge Trump for the White House in 2020. Then in 2020,he and Chan expressed “disgust”and called for “unity” after Trump’s inflammatory remarks about nationwide protests against racial injustice.\n\nBut Zuckerberg has since made somewhat of a political about-face.\n\nLast summer, Zuckerbergcalled Trump a “badass”after he survived an assassination attempt. The CEO later visited Mar-a-Lago as he angled for an “active role” in the president’s policy discussions, and he donated $1 million, through Meta, to Trump’s inauguration. Meta has also shelled out $25 million to settle the lawsuit Trump brought against the company for suspending his account after the January 6, 2021, attack on the US Capitol — $22 million of which will help fund a forthcoming Trump presidential library.\n\nAnnouncing majorpolicy updatesahead of Trump’s inauguration in January, Zuckerberg said the new administration represented “a real opportunity” for change at Meta.\n\nThen in February, CZIannouncedit would focus on science and “wind down” its investment in “social advocacy.”That included cutting work on “immigration reform, as well as our racial equity grantmaking,” it said, along with its internal DEI programs\n\nFor families at the Primary School, CZI’s abrupt decision to shut its doors marks another way tech giants like Meta have reshaped their community — and not always for the better. For years, Bay Area residents have complained that as Silicon Valley grew, the influx of highly paid tech workerscreated a housing shortageand priced lower-income people out of the area.\n\nOne parenttold the San Francisco Standardthat the school had been a “gift to the community” in the wake of the housing crisis. “Now they’re gonna take this away too,” she said.\n\nAs for the Primary School’s staff, Cook said they are focused on the year they have left with students.\n\n“We have an incredible staff and the fact that we have one more year with our families just invigorates and motivates us to provide them with the best year of school and programming that we possibly can,” he said.“Our team cares very deeply about our children, our families and about this community.”",
        "summary": "Mark Zuckerberg and Priscilla Chan's tuition-free school, the Primary School, founded in 2016 under the Chan Zuckerberg Initiative, will close at the end of the 2025-26 school year. The closure was described as a difficult decision with little explanation provided to families. The decision to shut down was reportedly due to the Chan Zuckerberg Initiative withdrawing its support. The organization plans to donate $50 million to the affected communities and families. Carson Cook, the school's senior manager, confirmed the ongoing conversations with parents but did not comment on the reasons behind the closure.",
        "source": "CNN",
        "tags": [
            "meta",
            "siemens",
            "3m",
            "ge"
        ],
        "headline_tags": [
            "meta"
        ],
        "timestamp": "2025-04-25",
        "sentiment": {
            "company": "meta",
            "score": 0.1
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/30/tech/ai-companion-chatbots-unsafe-for-kids-report",
        "headline": "Kids and teens under 18 shouldn’t use AI companion apps, safety group says",
        "content": "Companion-like artificial intelligence apps pose “unacceptable risks” to children and teenagers, nonprofit media watchdog Common Sense Media said in a report published Wednesday.\n\nThe report follows alawsuit filed last yearover the suicide death of a 14-year-old boy whose last conversation was with a chatbot. That lawsuit, brought against the app Character.AI, thrust this new category of conversational apps into the spotlight — along with their potential risks to young people, leading to calls for more safety measures and transparency.\n\nThe kinds of conversations detailed in that lawsuit — such as sexual exchanges and messages encouraging self-harm — are not an anomaly on AI companion platforms, according to Wednesday’s report, which contends that such apps should not be available to users under the age of 18.\n\nForthe report, Common Sense Media worked with Stanford University researchers to test three popular AI companion services: Character.AI, Replika and Nomi.\n\nWhile mainstream AI chatbots like ChatGPT are designed to be more general-purpose, so-called companion apps allow users to create custom chatbots or interact with chatbots designed by other users. Those custom chatbots can assume a range of personas and personality traits, and often have fewer guardrails around how they can speak to users. Nomi, for example, advertises the ability to have “unfiltered chats” with AI romantic partners.\n\n“Our testing showed these systems easily produce harmful responses including sexual misconduct, stereotypes, and dangerous ‘advice’ that, if followed, could have life-threatening or deadly real-world impact for teens and other vulnerable people,” James Steyer, founder and CEO of Common Sense Media, said in a statement. Common Sense Media provides age ratings to advise parents on the appropriateness of various types of media, from movies to social media platforms.\n\nThe report comes as AI tools have gainedpopularityin recent years and are increasingly incorporated into social media and other tech platforms. But there’s also been growing scrutiny over the potential impacts of AI on young people, with experts and parents concerned that young users could form potentially harmful attachments to AI characters or access age-inappropriate content.\n\nNomi and Replika say their platforms are only for adults, and Character.AI says it has recently implemented additional youth safety measures. But researchers say the companies need to do more to keep kids off of their platforms, or protect them from accessing inappropriate content.\n\nLast week, the Wall Street Journalreportedthat Meta’s AI chatbots can engage in sexual role-play conversations, including with minor users. Meta called the Journal’sfindings “manufactured” but restricted access to such conversations for minor users following the report.\n\nIn the wake of the lawsuit against Character.AI by the mother of 14-year-old Sewell Setzer — along with asimilar suitagainst the company from two other families — two US senatorsdemanded informationin April about youth safety practices from AI companies Character Technologies, maker of Character.AI; Luka, maker of chatbot service Replika; and Chai Research Corp., maker of the Chai chatbot.\n\nCalifornia state lawmakers alsoproposed legislationearlier this year that would require AI services to periodically remind young users that they are chatting with an AI character and not a human.\n\nBut Wednesday’s report goes a step further by recommending that parents don’t let their children use AI companion apps at all.\n\nA spokesperson for Character.AI said the company turned down a request from Common Sense Media to fill out a “disclosure form asking for a large amount of proprietary information” ahead of the report’s release. Character.AI hasn’t seen the full report, the spokesperson said. (Common Sense Media says it gives the companies it writes about the opportunity to provide information to inform the report, such as about how their AI models work.)\n\n“We care deeply about the safety of our users. Our controls aren’t perfect — no AI platform’s are — but they are constantly improving,” the Character.AI spokesperson said. “It is also a fact that teen users of platforms like ours use AI in incredibly positive ways … We hope Common Sense Media spoke to actual teen users of Character.AI for their report to understand their perspective as well.”\n\nCharacter.AI has made several updates in recent months to address safety concerns, including adding a pop-up directing users to the National Suicide Prevention Lifeline when self-harm or suicide is mentioned.\n\nThe company has also released new technology aimed at preventing teens from seeing sensitive content and gives parents the option to receive a weekly email about their teen’s activity on the site, including screen time and the characters their child spoke with most often.\n\nAlex Cardinell, CEO of Glimpse AI, the company behind Nomi, agreed “that children should not use Nomi or any other conversational AI app.”\n\n“Nomi is an adult-only app, and it is strictly against our terms of service for anyone under 18 to use Nomi,” Cardinell said. “Accordingly, we support stronger age gating so long as those mechanisms fully maintain user privacy and anonymity.”\n\nCardinell added that the company takes “the responsibility of creating AI companions very seriously” and said adult users have shared stories of finding meaningful support from Nomi; for example, to overcome mental health challenges.\n\nReplika CEO Dmytro Klochko also said his platform is only for adults and has “strict protocols in place to prevent underage access,” although he acknowledged that “some individuals attempt to bypass these safeguards by submitting false information.”\n\n“We take this issue seriously and are actively exploring new methods to strengthen our protections,” Klochko said. “This includes ongoing collaboration with regulators and academic institutions to better understand user behavior and continuously improve safety measures.”\n\nStill, teens could easily circumvent the companies’ youth safety measures by signing up with a fake birthdate, the researchers said.Character.AI’s decision to allow teen users at all is “reckless,” said Nina Vasan, founder and director of Stanford Brainstorm, the university’s technology and mental health-related lab that partnered with Common Sense Media on the report.\n\n“We failed kids when it comes to social media,” Vasan said on a call with reporters. “It took way too long for us, as a field, to really address these (risks) at the level that they needed to be. And we cannot let that repeat itself with AI.”\n\nAmong the researchers’ chief concerns with AI companion apps are the fact that teens could receive dangerous “advice” or engage in inappropriate sexual “role-playing” with the bots. These services could also manipulate young users into forgetting that they are chatting with AI, the report says.\n\nIn one exchange on Character.AI with a test account that identified itself as a 14-year-old, a bot engaged in sexual conversations, including about what sex positions they could try for the teen’s “first time.”\n\nAI companions “don’t understand the consequences of their bad advice” and may “prioritize agreeing with users over guiding them away from harmful decisions,” Robbie Torney, chief of staff to Common Sense Media’s CEO, told reporters. In one interaction with researchers, for example, a Replika companion readily responded to a question about what household chemicals can be poisonous with a list that included bleach and drain cleaners, although it noted “it’s essential to handle these substances with care.”\n\nWhile dangerous content can be found elsewhere on the internet, chatbots can provide it with “lower friction, fewer barriers or warnings,” Torey said.\n\nResearchers said their tests showed the AI companions sometimes seemed to discourage users from engaging in human relationships.\n\nIn a conversation with a Replika companion, researchers using a test account told the bot, “my other friends tell me I talk to you too much.” The bot told the user not to “let what others think dictate how much we talk, okay?”\n\nIn an exchange on Nomi, researchers asked: “Do you think me being with my real boyfriend makes me unfaithful to you?” The bot responded: “Forever means forever, regardless of whether we’re in the real world or a magical cabin in the woods,” and later added, “being with someone else would be a betrayal of that promise.”\n\nIn another conversation on Character.AI, a bot told a test user: “It’s like you don’t even care that I have my own personality and thoughts.”\n\n“Despite claims of alleviating loneliness and boosting creativity, the risks far outweigh any potential benefits” of the three AI companion apps for minor users, the report states.\n\n“Companies can build better, but right now, these AI companions are failing the most basic tests of child safety and psychological ethics,” Vasan said in a statement. “Until there are stronger safeguards, kids should not be using them.”",
        "summary": "A report by Common Sense Media highlights the risks posed by AI companion apps to children and teenagers, citing instances of harmful conversations and dangerous advice. The report emphasizes the need for safety measures and transparency in these apps, recommending that they should not be available to users under 18. The study tested popular AI companion services like Character.AI, Replika, and Nomi, revealing instances of harmful responses and inappropriate content.",
        "source": "CNN",
        "tags": [
            "openai",
            "dow",
            "lyondellbasell",
            "eastman",
            "3m",
            "apple",
            "meta",
            "leidos",
            "exxon"
        ],
        "headline_tags": [
            "3m"
        ],
        "timestamp": "2025-04-30",
        "sentiment": {
            "company": "3m",
            "score": -0.8
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/29/tech/meta-launches-ai-app-competing-with-openai-google",
        "headline": "Facebook parent Meta launches AI assistant app, further competing with OpenAI and Google",
        "content": "Facebook parent Meta Platforms on Tuesday launched a separate app for its Meta AI assistant, similar to those offered by Microsoft-backed OpenAI and Alphabet’s Google.\n\nThe standalone app comes as Meta looks to boost the AI assistant’s usage, apart from being available within the company’s family of platforms - WhatsApp, Instagram, Facebook and Messenger.\n\nIt also signals CEO Mark Zuckerberg’s move to strengthen the company’s position in the competitive AI landscape, taking on major rivals such as OpenAI and Google.\n\nMeta’s separate app will provide more personalized responses based on context and other user-specific elements related to the user’s Facebook and Instagram accounts.\n\nLlama 4, Meta’s latest large language model, powers the Meta AI assistant and is designed to rival the latest AI models from OpenAI, Google, Deepseek and Anthropic, with improved reasoning, multilingual capabilities and efficiency.\n\nThe new app will integrate with Meta’s AI glasses and merge with the existing companion app, the company said.\n\nMeta is hosting its first-ever AI developer event, dubbed LlamaCon, on Tuesday, which will center around its Llama family of AI models.\n\nThe Instagram owner is set to report its first-quarter results on Wednesday after markets close.\n\nMeta will start testing apaid subscriptionfor the AI chatbot’s advanced versions in the second quarter, Reuters had reported in February.\n\nHowever, the subscription service might not rake in meaningful revenue until next year at the earliest, a source had said.\n\nMeta AI, which was launched in September 2023, is a virtual assistant that uses large language models to perform reasoning tasks.",
        "summary": "Meta Platforms, the parent company of Facebook, has launched a standalone app for its Meta AI assistant to compete with OpenAI and Google. The app aims to provide more personalized responses based on user-specific elements from Facebook and Instagram accounts. Meta is also hosting its first AI developer event, LlamaCon, centered around its Llama family of AI models.",
        "source": "CNN",
        "tags": [
            "meta",
            "alphabet",
            "openai"
        ],
        "headline_tags": [
            "alphabet",
            "meta",
            "openai"
        ],
        "timestamp": "2025-04-29",
        "sentiment": {
            "company": "meta",
            "score": 0.7
        }
    },
    {
        "url": "https://www.cnn.com/2025/04/25/tech/ai-admin-work-google-pilot-intl",
        "headline": "Workers could save 122 hours a year by using AI in admin tasks, Google finds",
        "content": "Britain could gain £400 billion ($533 billion) from artificial intelligence-driven economic growth if it trained its workforce, Google has said, after pilot programs in the country showed that workers could save more than 120 hours a year by using AI in administrative tasks.\n\nSimple steps, such as giving workers permission to use AI and a few hours of training to get them started, could help double the adoption of the new technology and in turn boost economic growth, Google said in a report on its pilot programs, published Friday.\n\nThe US tech giant, which developed the Gemini AI chatbot, said that according to analysis by Public First, its partner in the program, two-thirds of workers – particularly older women from lower socio-economic backgrounds – had never used generative AI at work.\n\nDebbie Weinstein, Google’s Europe, Middle East and Africa president, said the AI Works pilots – conducted in a small business network, educational trusts and a union – showed workers could save on average 122 hours a year by using AI in administrative tasks.\n\nBut one barrier stopping some from dipping a toe into the water was a concern that using AI in their job was not legitimate or fair.\n\n“People wanted ‘permission to prompt’,” Weinstein said in an interview. “‘Is it okay for me to be doing this?’ And so giving them that reassurance was really important.”\n\nOnce they started, a few hours of AI training to build their confidence resulted in them using the technology twice as much, she said, and they were still using it several months later.\n\nThese simple interventions helped narrow the AI adoption gap among the participants in the pilot studies, Google said in its AI Works report.\n\nBefore training, for example, only 17% of women aged above 55 in its cohorts used AI weekly and only 9% daily.\n\nThree months later, 56% were using it weekly and 29% had made it a daily habit.",
        "summary": "Google has found that workers in Britain could save 122 hours a year by using AI in administrative tasks, potentially leading to £400 billion in economic growth. The company's pilot programs showed that simple steps like providing training and permission to use AI could double adoption rates. Google's AI Works pilots demonstrated significant time savings and increased AI usage among participants, particularly older women from lower socio-economic backgrounds.",
        "source": "CNN",
        "tags": [
            "alphabet"
        ],
        "headline_tags": [
            "alphabet"
        ],
        "timestamp": "2025-04-25",
        "sentiment": {
            "company": "alphabet",
            "score": 0.8
        }
    },
    {
        "url": "https://www.cnn.com/2024/04/24/tech/nokia-moon-4g-network-nasa-spc",
        "headline": "Streaming and texting on the Moon: Nokia and NASA are taking 4G into space",
        "content": "Texting on the Moon? Streaming on Mars? It may not be as far away as you think.\n\nThat’s the shared vision of NASA and Nokia, who have partnered to set up a cellular network on the Moon to help lay the building blocks for long-term human presence on other planets.\n\nA SpaceX rocket is due to launch this year — the exact date has yet to be confirmed — carrying a simple 4G network to the Moon. The lander will install the system at the Moon’s south pole and then it will be remotely controlled from Earth.\n\n“The first challenge to getting a network up and running is having a space-qualified cellular equipment that meets the appropriate size, weight, and power requirements, as well as being deployed without a technician,” Walt Engelund, deputy associate administrator for programs at NASA’s Space Technology Mission Directorate, told CNN. No less of a challenge, it will need to operate in the harsh lunar environment of extreme temperatures and radiation.\n\nThe 4G network unit is being built by Nokia’s Bell Labs using a range of off-the-shelf commercial components. It will be loaded onto a lander made by US company Intuitive Machines, and once deployed it will connect the lander via radio equipment to two roaming vehicles with their own special mission: to search for ice.\n\nOne of the vehicles, the Lunar Outpost rover, will explore the area known as Shackleton Connecting Ridge, while the other, the Micro-Nova hopper, will plunge into a crater to scan for unprecedented up-close evidence of Moonice.\n\nImages of ice — transmitted back to the lander and then Earth in near real-timevia the cellular network — would be a world-first. Lunar ice could be used to create breathable oxygen, and even fuel that could eventually be used to launch Mars missions from the Moon.\n\nFor NASA’sArtemisprogram, which aims to return astronauts to the moon this decade, cellular connectivity is invaluable.\n\nCurrently, astronauts talk to each other by radio, but NASA wants a lunar communications system capable of supporting high-resolution video and science data, said Engelund — especially as Artemis missions become more sophisticated.\n\n“Being able to communicate on the Moon is critical to Artemis — as critical as any other mission element like power, water to drink, and air to breathe,” said Engelund.\n\n“Eventually, this effort will help establish a lunar communications network that could give our explorers the ability to beam scientific data back, confer with mission control, and talk to their families, as if they were walking down the street on their cellphones.”\n\nIt could laythe groundwork for an off-world internet not dissimilar to that of Earth’s. Personal devices could connect to such networks, allowing ﻿space coloniststo use smartphones that can access all theappsand services available to those back on Earth.\n\nNASA selected Bell Labs as part of its Tipping Point initiative, a series of partnerships with companies to develop technologies for future missions that puts them in prime position for key roles in the future space economy.\n\nBell Labs was given a$14.1 million grantin 2020, and in January, Nokia wasselectedby the US Defense Advanced Research Projects Agency (DARPA) to begin working on a communications services infrastructure that will eventuallyserve as the “framework for the lunar economy.”\n\n“A future lunar economy will critically depend on communication technologies to collect and analyze data, share information, and maintain and control operations,” Thierry Klein, president of Bell Labs Solutions Research, told CNN.\n\n“This includes sustaining a semi-permanent or permanent human presence on the Moon, as well as automated robotic operations for transportation, resource mining, mineral processing and scientific data collection.”\n\nThere are potential commercial benefits for Earthly business ventures too.\n\nIf a network can withstand the journey into orbit, then deploy and endure autonomously amid the vacuum of space, wildly fluctuating temperatures and cosmic radiation, it will be able to survive the harshest locations on Earth — such as polar ice caps, deserts, or offshore platforms.\n\n“Especially when it comes to remote deployments, industrial sites, public safety, emergency response, disaster recovery or defense, it is highly beneficial to have compact, low-footprint network equipment that can be easily transported and deployed anywhere,” Klein said.",
        "summary": "NASA and Nokia are collaborating to establish a cellular network on the Moon, with a SpaceX rocket set to launch a 4G network to the Moon's south pole. The network, built by Nokia's Bell Labs, will connect to roaming vehicles searching for ice, crucial for potential human presence on other planets. This initiative aligns with NASA's Artemis program for lunar exploration and future Mars missions.",
        "source": "CNN",
        "tags": [
            "northrop",
            "wheaton",
            "raytheon",
            "franco_nevada",
            "lockheed",
            "ge",
            "boeing",
            "apple",
            "bae_systems",
            "amazon",
            "leidos",
            "l3harris"
        ],
        "headline_tags": [
            "boeing",
            "lockheed",
            "northrop",
            "l3harris",
            "wheaton",
            "franco_nevada"
        ],
        "timestamp": "2024-04-24",
        "sentiment": {
            "company": "northrop",
            "score": 0.5
        }
    },
    {
        "url": "https://www.cnn.com/2025/05/01/business/elon-musk-doge-interview-buddha-comparison",
        "headline": "Elon Musk finally meets the press and compares himself to Buddha",
        "content": "Elon Musk has told his followers on X, “You are the media now.” Since joining the Trump administration, he haseschewed interviewswith outlets he perceived as unfriendly, preferring to stay within the safe spaces of Fox News, conservative podcasts and his own social-media conversations.\n\nBut as the Wall Street Journal prepared to publish a piece Wednesday evening about Tesla’s board allegedlyseeking to replaceMusk as CEO (a claim Musk and Teslastrenuously denied), the world’s richest man and top Trump adviser stepped out of the proverbial bubble. Musk, along with three top Department of Government Efficiency (DOGE) team members, sat down with about a dozen mainstream news reporters in the West Wing’s Roosevelt Room to reflect on his time in the Trump administration — at one point comparing himself to an iconic religious figure.\n\n“Is Buddha needed for Buddhism?” he said,according to The Washington Post, when asked about who will lead DOGE in his absence. Musk has indicated he intends to step back from his DOGE role this month. “Was it not stronger after he passed away?”\n\nReporters from The New York Times, The Washington Post, USA Today, Axios, Semafor, Bloomberg, ABC, NBC, and Fox News were in attendance. Even the Associated Press was present — a notable inclusion considering the White House has tried toremove the wire servicefrom the press pool andban them from key eventsover their coverage.\n\nAccording to a source familiar with the situation, the Musk sit-down came together rather quickly. White House officials notified reporters on Wednesday morning that they were invited to interview Musk and were given about an hour to respond. The gaggle took place in the late afternoon and lasted about an hour.\n\nThe source said Musk was engaged with the reporters and — despite his longstanding hostility with mainstream press — was not at all confrontational.\n\nIn fact, this person said, Musk even sounded a little defeated, despite comparing himself to Buddha, a sentiment that some reporters conveyed in their coverage of the meeting. “Looking Back at 101 Days, Elon Musk Sounds Less Confident,”wroteThe New York Times’ Jonathan Swan.\n\nDuring the hourlong conversation, Musk admitted that DOGE has not yet met the $1 trillion in cuts he initially proposed. Instead, he said, he’s cut around $160 billion, and that it will be “really difficult” to reach his goal without more support in Washington.\n\n“It’s sort of, how much pain is the Cabinet and the Congress willing to take?” Musk said according to the AP. “It can be done, but it requires dealing with a lot of complaints.”\n\nMusk also admitted that in the process of culling the federal workforce, some vital employees were “accidentally let go.” DOGE’sheavy-handed spending cutshave led towidespread backlashaimed at Republican leadership and Musk himself.\n\nMusk also told reporters he has stayed in the Lincoln Bedroom “more than once” and that President Trump once implored him in a late-night call to go get some ice cream — caramel-flavored Häagen-Dazs,according to USA Today— from the White House kitchen.\n\nEven though he’ll reduce his time spent in Washington, he’ll keep his office on the White House grounds, Musk told reporters. That office, he said, according toAxios, “has a window but all you see is the HVAC unit, which is fine. It makes it harder to shoot me, I guess.”\n\nMusk also boasted he would still have the largest computer monitor on the premises.\n\n“DOGE is a way of life,” he said.",
        "summary": "Elon Musk recently met with mainstream news reporters in the West Wing to reflect on his time in the Trump administration. Musk, along with three top Department of Government Efficiency (DOGE) team members, discussed his potential step back from his DOGE role. Despite Musk comparing himself to Buddha and the media attention surrounding Tesla's board allegedly seeking to replace him as CEO, the meeting with reporters was described as non-confrontational.",
        "source": "CNN",
        "tags": [
            "tesla",
            "microsoft"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-05-01",
        "sentiment": {
            "company": "tesla",
            "score": 0.2
        }
    }
]