[
    {
        "url": "https://www.cnn.com/2025/03/26/business/tesla-saudi-arabia-elon-musk-intl/index.html",
        "headline": "Tesla is bringing its electric cars to oil-rich Saudi Arabia amid falling global sales",
        "content": "Tesla will start selling its electric vehicles in Saudi Arabia, entering the Gulf region’s largest economy as the company’s global sales are sliding and CEO Elon Musk courts controversy with his role in the US government.\n\nThe carmakerannouncedWednesday that it would host a launch event in the kingdom on April 10, where it will showcase its EVs. Attendees will also have the chance to “experience the future of autonomous driving with Cybercab and meetOptimus, our humanoid robot, as we showcase what’s next in AI and robotics,” Tesla (TSLA) said.\n\nTesla may struggle to gain market share in oil-rich Saudi Arabia as EVs make up a little over 1% of all car sales in the country, according to a report by consultancy PwC published in September.\n\nTesla’s entry into the new market comes as the company fights battles on several fronts.\n\nLast year, it recordedthe first annual declinein sales in its history as a public company, posting a drop of 1%.\n\nThe company is facing intensifying competition in China, the world’s largest auto market. On Tuesday, BYD, a Chinese maker of electric and hybrid cars, reported $107 billion in annual sales for 2024, beating the near-$98 billion notched by Tesla.\n\nAnd last week, BYD unveiled anultra-fast charging system, which it said was capable of adding 250 miles (402 km) of range in just five minutes, easily outdoing Tesla’s charging technology. Tesla’s Superchargers take 15 minutes to charge an EV, providing a range of 200 miles.\n\nTesla has also suffered slumping sales in Europe. In February, the carmaker sold around 40% fewer vehicles on the continent compared with the same month in 2024,accordingto the European Automobile Manufacturers’ Association.\n\nIn the United States, Tesla’s home-turf, Musk’s contentious government role — which has involved slashing thousands of public sector jobs as head of the Department of Government Efficiency — has also turned off many would-be Tesla buyers. Prices for used Teslasare tankingeven as interest in used EVs overall rises.\n\nThe billionaire’s actions in government have sparked a spate of vandalism against Tesla showrooms, charging stations and vehicles in the US, so much so that theFBI announcedMonday that it had created a task force to “crack down on violent Tesla attacks.”\n\nThere have also been peaceful protests at many Tesla sites, with demonstrators holding signs and chanting “Elon Musk has got to go” in reference to his government job.\n\nThese headaches have convinced many investors to dump Tesla’s stock. Shares in the company have cratered 40% since hitting an all-time high in December.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-26"
    },
    {
        "url": "https://www.cnn.com/2025/03/25/business/byd-tesla-china-elon-musk-nightcap/index.html",
        "headline": "Tesla’s No.1 rival is practically taunting Elon Musk now",
        "content": "There are three letters keeping Tesla bulls up at night: BYD.\n\nThat’s the carmaker eating everyone’s lunch in China, the world’s biggest auto market, and rapidly gaining market share around the globe (except in the United States, of course, because of longstanding trade restrictions on Chinese imports).\n\nOn Monday, BYD reported $107 billion in revenue for 2024 — crossing the $100 billion level for the first time and besting Tesla’s annual revenue by about $10 billion. That milestone came a week after BYDunveileda charging system that it says will give its latest EV model 250 miles of range after plugging in for just five minutes.\n\nBYD’s Hong Kong-listed shares are already up more than 50% this year.\n\nThe Chinese company’s week of blowout news should amount to a rather satisfying dunk on Tesla CEO Elon Musk, who oncescoffed at the idea of BYDas a competitor and who is currently a rather unpopular member of the Trump administration. (Trust us,we did polling!)\n\nBYD’s moment in the sun comes just as Tesla is sliding into a crisis.\n\nTesla investors have been offloading their stock for nine straight weeks, largely because ofgood old-fashioned business reasons, including:\n\nBut those are hardly theonlyreasons.\n\nMusk’s extracurricular gig as President Donald Trump’s hatchet man has turned the Tesla brand — once a favorite among upwardly mobile lefties — into a symbol of America’s right wing. Used Tesla pricesare tankingeven as interest in used EVs rises.\n\nThe White House has responded with a series of stunts — a live presidential endorsement on the South Lawn, the commerce secretary shilling for Tesla stock on Fox News, the FBI threatening vandals with terrorism charges — that all smack of desperation. (They are also soout of step withlegal convention, ethics experts are struggling to wrap their heads around them.)\n\nTesla shares began rebounding Friday after Musk called an all-hands meeting Thursday night in which he urged staff to hold onto their stock. Retail investors have piled in, helping shares gain 5% on Friday and 12% on Monday.\n\nBut the stock remains more than 40% off its December record high, and several analysts have reined in their expectations for the year.\n\nBYD isn’t the only Chinese competitor sapping Tesla’s market share. In Europe, Tesla sales fell 44% in February while Chinese brands broadly went up 82%, according toa reportfrom JATO, which analyzes auto market data.\n\nPart of that decline had to do with a gap in Tesla’s overhaul of its bestselling Model Y, JATO analyst Felipe Munoz said. But Musk’s support for a far-right German party accused ofsympathizing with Nazislikely didn’t help — sales in Germany, Europe’s biggest car market, sank 75% last month.\n\nPerhaps the biggest threat BYD poses to Tesla: It’s managed to make a variety of sleek, tech-enabled cars — both EVs and plug-in hybrids — at a fraction of the cost. The entry-level BYD EV now starts at under $10,000 in China.  Tesla’s Model 3, its cheapest model, costs three times more at $32,000.\n\nOn Monday, BYD launched a new electric sedan with roughly the same specs as a Tesla Model 3 for half the price,Elektrek reported. Then new Qin L EV comes with BYD’s smart driving tech and gets over 330 miles of driving range, starting at $16,500.\n\nTesla is reportedly working on a smaller, cheaper version of its Model Y in an effort to regain some of the ground it has lost in China. But mass production isn’t expected to begin until 2026, according tounnamed sources cited by Reuters.\n\nBottom line:Musk badly underestimated BYD, which stands for “Build Your Dreams,” back in 2011, when he dismissed a Bloomberg interviewer’s question about the Chinese carmaker posing a threat to Tesla. “Have you seen their car?” he asked rhetorically.\n\nBut more than a decade later, BYD has surpassed Tesla in annual revenue and upended the global market for EVs. Tesla remains the best-selling EV maker in the US, thanks to the nation’s tariffs aimed at protecting US manufacturing. Absent those trade barriers, BYD could fast become Musk’s nightmare.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25"
    },
    {
        "url": "https://www.cnn.com/2025/03/25/cars/china-byd-annual-sales-pass-tesla-intl-hnk/index.html",
        "headline": "Chinese EV titan BYD annual sales hit $100 billion eclipsing rival Tesla",
        "content": "China’s EV giant BYD recorded revenues of 777 billion yuan ($107 billion) for 2024, surging ahead Elon Musk’s Tesla in annual sales amid intensifying competition in the global market for clean-energy cars.\n\nIn a filing on Monday, BYD reported a 29% jump in sales from the previous year on deliveries of 4.27 million cars, including fully electric vehicles and hybrids.\n\nBy comparison, Tesla’s 2024 revenue was $97.7 billion, and it delivered 1.79 million battery-powered vehicles. Its annual deliveries declined for the first time last year by 1.1%.\n\nIn its latestannual report, BYD CEO Wang Chuanfu said the company experienced “rapid development” last year.\n\n“BYD has become an industry leader in every sector from batteries, electronics to new energy vehicles, breaking the dominance of foreign brands and reshaping the new landscape of the global market,” he said.\n\nBYD has been increasingly challenging the once dominant EV player Tesla.\n\nLast week, BYD unveiled anultra-fast charging systemthat it said was capable of adding 250 miles of range in just five minutes, outpacing Tesla’s charging technology. Tesla’s Superchargers take 15 minutes to charge and provide a range of 200 miles.\n\nIn addition, BYD launched anadvanced driver-assistance systemlast month for most of its models at no extra cost. Analysts said the free upgrade of its proprietary “God’s Eye” system increased pressure on Tesla and other Chinese EV makers. In contrast, Tesla’s Full Self-Driving (FSD) service is available to US customers for a $99 monthly subscription or a one-time payment of $8,000.\n\n“Eventually, Tesla may have to cut its FSD price in China,” Seth Goldstein, an analyst at Morningstar, wrote in a Monday research note.\n\nTesla has struggled to keep pace with BYD in China, particularly as its long-awaited FSD service remains stalled in the country, pending regulatory approval.\n\nTesla aims for a full rollout of FSD in China this year. Last week, it launched limited free FSD trials in China, only to halt them by Monday. Tesla’s customer support account on Chinese social media platform Weibo said it is working to secure regulatory approval for FSD.\n\n“All relevant parties are actively advancing the process, and once everything is ready, we will roll out the updates as soon as possible,” it said in a statement in response to a recent post by Tesla vice president Grace Tao, whose account was flooded with user complaints about the trial’s abrupt suspension.\n\nChinese EVs are virtually locked out of the US market due to tariffs. But BYD dominates China, the world’s largest auto market.\n\nIn 2024, BYD had a 32% share of China’s total market for new energy vehicle sales, which includes hybrids. Tesla claimed only 6.1% of the market, despite reaching a record high in terms of shipments, according to theChina Passenger Car Association.\n\nTesla is struggling in Europe, too, where itssales fell in February for the second consecutive month: The company sold around 40% fewer vehicles on the continent compared with February 2024,accordingto the European Automobile Manufacturers’ Association.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25"
    },
    {
        "url": "https://www.cnn.com/2025/03/20/tech/meta-whistleblower-sarah-wynn-williams-response-congress/index.html",
        "headline": "Facebook whistleblower, ‘Careless People’ author says company’s arbitration demand is keeping her from speaking to Congress",
        "content": "Former Facebook executive-turned-whistleblower Sarah Wynn-Williams says Meta is blocking her from speaking to Congress about her experiences at the company.\n\nThis arises from arbitration proceedings with the company after Wynn-Williams published hermemoir “Careless People,”detailing her time at the social media giant, earlier this month.\n\nMeta moved quickly to stop her from promoting or discussing the book, which it claimed contained “out-of-date” claims and “false accusations.” On the day of the book’s publication, the company filed an arbitration demand stating that the claims in the book violate a voluntary non-disparagement agreement she signed upon leaving the company. A day later, the arbitrator temporarily ordered her not to make any “disparaging, critical or otherwise detrimental comments” related to Meta and to stop promoting the book.\n\nThat order is now preventing Wynn-Williams from responding to requests from lawmakers in several countries to discuss her time at the company, her lawyers wrote in a response in the arbitration proceedings obtained by CNN.\n\n“Members of the United States Congress, the Parliament of the United Kingdom, and the Parliament of the European Union have requested to speak with Ms. Wynn-Williams on the issues of public concern raised in her memoir,” including the company’s interactions with the Chinese government and Meta’s alleged harms to teen girls, the document, filed Tuesday, states. But under the order, Wynn-Williams “appears to be blocked from speaking” with those lawmakers.\n\nWynn-Williams’ response in the arbitration proceedings has not been previously reported.\n\n“Careless People” includes striking details about Wynn-Williams’ time at the company, ranging from the social media giant’s efforts to expand into China and alleged sexual harassment by now-policy chief Joel Kaplan.\n\nThe arbitrator’s emergency order prevents Wynn-Williams from making any critical comments about the company even if she believes them to be true, according to a filing Meta shared publicly earlier this month.\n\nThe emergency order also notes that Wynn-Williams is not prevented or prohibited from “filing a claim with a federal, state, or local government agency that is responsible for enforcing a law on behalf of the government.” However, her response states that because legislative bodies are not responsible for enforcing laws, she is blocked from speaking to lawmakers.\n\nA Meta spokesperson said the company has no intention to interfere with Wynn-Williams’ legal rights.\n\nWynn-Williams also filed a whistleblower complaint with the Securities and Exchange Commission in April 2024 and with the Department of Justice in 2025, according to her filing.\n\nWynn-Williams’ memoir comes as Meta has faced years of scrutiny and increased regulatory pressure from lawmakers around the world over issues such as teen safety and election misinformation. Two other former employees have also testified as whistleblowers, and the company’s executives have repeatedly been called to hearings on Capitol Hill.\n\nWynn-Williams spent six years at the company, now called Meta, most recently as director of global public policy, before she was fired in 2017, which the company said was due to “poor performance and toxic behavior.” Wynn-Williams’ book implies that she was fired in retaliation for reporting sexual harassment.\n\nMeta had sent a letter to Wynn-Williams’ publisher prior to the book’s publication, saying it had made “no attempt” to verify her claims with the company and threatening legal action if the book contained false statements or implications. But despite Meta’s efforts to block the book, it debuted this week on the New York Times’ best seller list.\n\n“The public interest is suffering due to her inability to respond to outreach from legislators, journalists, and the public,” the document states. It later adds: “The public interest balance here tips sharply in Ms. Wynn-Williams’s favor, as demonstrated by the interest in her evidence from U.S., UK, EU and other national and supra- national legislatures and regulatory bodies.”",
        "source": "CNN",
        "tags": [
            "meta"
        ],
        "headline_tags": [
            "meta"
        ],
        "timestamp": "2025-03-20"
    },
    {
        "url": "https://www.cnn.com/2025/03/25/tech/china-robots-market-competitiveness-intl-hnk/index.html",
        "headline": "Elon Musk thinks robots are a $10 trillion business. He’s got some competition from China",
        "content": "Spinning bright red handkerchiefs and dancing in step to folk music, more than a dozen human-like robots took to China’s biggest stage in January, making a splashy debut at the annual Lunar New Year gala.\n\nThe remarkable performance, watched by more than a billion people, is a high-profile reminder of how far Chinese humanoid robots have come. Over the past two months, videos of the country’s humanoid robots pulling off moves such as bike rides, roundhouse kicks and side flips have blown up the internet, often amplified by state media as a key potential driver of economic growth.\n\nEven though very few of the humanoids are in mass production, competition with Elon Musk’s Tesla, one of the acknowledged frontrunners in the field, is heating up. The promise of an “I, Robot” future, where machines handle household chores and serve as caregivers, has drawn nearly every major tech company in both the United States andChinato bet on humanoids or robotics.\n\nMicrosoft, Nvidia and Amazon founder Jeff Bezos have invested in American humanoid maker Figure AI. Meanwhile, Meta is planning major investments in humanoids, according to aBloomberg reportlast month.\n\nMusk, whose Optimus humanoid has sparked global interest since its debut in 2022, predicted last month that the project alone could generate more than $10 trillion in revenue.\n\nWhile it may take another five to 10 years for humanoid robots to make a real societal impact, they could eventually become the next widely adopted consumer electronics, according to Xi Ning, chair professor of robotics and automation at the University of Hong Kong.\n\n“Everybody will need them, like automobiles, like cellphones, and the potential market volume will be huge,” he told CNN.\n\nGoldman Sachsprojected last year that the global humanoid robot market will be worth $38 billion by 2035. In five years, they estimate that 250,000 humanoid units, mainly for industrial use, will be shipped, while consumers will be buying about one million units a year in about a decade.\n\nBeijing, which is looking to replicate China’s success in the electric vehicle (EV) market, wants to be at the forefront of that growth.\n\nIt’s eager to position the country as a global tech powerhouse and build on the momentum of recent Chinese achievements in the field - such as AI startupDeepSeek’sreasoning model that stunned the world in January - especially as the US tightens tech restrictions on Beijing.\n\nDespite entering the race later than American rivals including Tesla, Boston Dynamics and Figure AI, experts say Chinese firms are rapidly closing the gap. With their preternatural ability to optimize supply chains and cut costs, Chinese firms are also accelerating the mass production of humanoids.\n\nChina already dominates the space for industrial robots, deploying more of them every year since 2021 than all other countries combined, according to theInternational Federation of Robotics, a Germany-based non-governmental organization.\n\nCompared to humanoids, industrial robots typically feature less advanced technology and perform less sophisticated tasks. They’re widely used in industrial settings for manufacturing or transportation.\n\nAs with EVs, Tesla was one of the few big-name frontrunners for humanoids when Musk introduced the project in 2021 and showcased an Optimus prototype a year later. Since then, Beijing has publicly thrown its weight behind the humanoid robotics industry with increasing funding drives and government support.\n\nIn a 2023policy document, China’s Ministry of Industry and Information Technology identified the humanoid robotics industry as a “new frontier in technological competition,” setting a 2025 target for mass production and secure supply chains for core components.\n\n“China started relatively late, but it has its own advantages like a huge market and a relatively complete supply chain for the technology, which enables them to easily develop similar kind of robots at lower price,” said Xi at the University of Hong Kong.\n\nOver the past three years, various local governments – including major cities like Beijing, Shanghai and Shenzhen – have announced plans to establish or have launched investment funds dedicated to developing robotics, totaling at least 73 billion yuan ($10 billion), according to a tally by CNN.\n\nLast month,Chinese leader Xi Jinping chaired a high-profile meetingwith the country’s top business executives. Among those seated in the front row was Wang Xingxing, CEO of Unitree, the company behind the viral dancing robots, an indication of Beijing’s growing focus on this emerging sector.\n\nAside from Unitree, other major domestic players include Shenzhen-based UBTech, Chinese EV giant BYD-backed Agibot, Beijing-based Robotera and Shanghai-headquartered Fourier Intelligence, as well as EV maker XPeng.\n\nExperts say China still trails the West in certain key technologies, even as it dominates the supply chain.  About 56% of the humanoid robot supply chain companies are based in China, according to a Morgan Stanleyresearch reportlast month.\n\nBut China still needs to achieve a breakthrough in “core technologies,” such as processor chips, high-precision sensor and robot operating systems, to reduce its reliance on foreign technology, said Zhang Dan, chair professor of intelligent robotics and automation at the Hong Kong Polytechnic University.\n\nArtificial intelligence chips underpin humanoids’ operating systems, guiding their thinking, perception and motion. Many humanoid developers depend on AI chip giant Nvidia’s products. At its annual developer conference last week, the companyunveileda new AI foundation model for humanoid robots.\n\nCiting national security concerns, the former Biden administration steadily tightened export restrictions on advanced chips that could power China’s military. Beijing has sought to develop its domestic chip supply chain as part of its self-sufficiency drive.\n\nAdditionally, European, American and Japanese companies continue to dominate higher-end components such as sensors, as well as motors and screws that power robotic motions with higher precision and stability, according to aMorgan Stanley reportlast month.\n\nTo overcome those shortcomings, Chinese suppliers are actively trying to do business with Tesla. Many of them have sent component samples for Tesla’s review, according to P.K. Tseng, a senior research manager at TrendForce, a market analysis firm.\n\n“After Chinese supply chain manufacturers supply components to Tesla, they refine them based on testing feedback and then offer the improved versions to domestic manufacturers,” he said.\n\nOver time, this creates a cycle of continuous technological advancements, enhancing the quality of the whole domestic humanoid robotics industry, he explained.\n\nWhile technological gaps remain, China has emerged as a price disrupter in the nascent industry.\n\nShenzhen-based Engine AI released itsPM01 modellate last year for just 88,000 yuan ($12,175), while Unitree’s G1, capable of executing a roundhouse kick, followed at 99,000 yuan ($13,697).\n\nAt aneventlast year, Musk estimated Tesla’s Optimus to be priced between $20,000 to $30,000. Lowering prices for humanoids would mark a major step to their eventual commercialization and wider adoption.\n\nBeyond startups, established EV players like BYD and XPeng have also ventured into the humanoids space. Experts said years of cutthroat competition and a price war in China have honed their ability to scale production rapidly while driving cost down.\n\nSince the manufacturing complexity of humanoid robots shares similarities to those of electric vehicles, particularly in components like sensors and batteries, EV makers have an advantage in this space, according to Brady Helwig, associate director for economy at Special Competitive Studies Project, a US thinktank.\n\nLate last year, XPeng unveiled its humanoid robot, Iron, with plans for mass production by the end of 2025. Around the same time, BYD launched a recruitment drive to develop its own version, having invested in other domestic humanoids makers.\n\nAs the country’sdemographic crisisworsens, the Chinese leadership sees humanoid robots as a potential solution to offset the shrinking working force, Helwig said. China’s population has shrunk for three consecutive years.\n\n“If humanoid robots were able to be scaled and deployed widely across the economy, this is the kind of wild card that could really help alleviate that gap,” he said.",
        "source": "CNN",
        "tags": [
            "amazon",
            "tesla",
            "nvidia",
            "meta"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-25"
    },
    {
        "url": "https://www.cnn.com/2025/03/20/media/vivian-wilson-teen-vogue-criticism-musk-tesla-trans/index.html",
        "headline": "Musk links trans people to Tesla attacks the same day his estranged daughter criticizes him in Teen Vogue interview",
        "content": "The same day Vivian Jenna Wilson, Elon Musk’s estranged daughter, published her second-ever interview with a media outlet, the billionaire media mogul used his X platform to insinuate trans people are behind reports of attacks on Teslas.\n\nDuring herinterview with Teen Vogue, Wilson said she doesn’t “give a f**k” about Musk, calling him a “pathetic man-child.”\n\n“I don’t give a f**k how much money anyone has,” Wilson told the publication. “I don’t. I really don’t. He owns Twitter. Okay.”\n\nThe 20-year-old said she often learns about Musk’s actions from the news, saying she should “probably post about this and denounce it, which I have done a few times.”\n\n“The Nazi salute sh*t was insane,” Wilson said in reference toMusk’s performanceof a straight-armed salute during Donald Trump’s inauguration thathe has deniedwas a Nazi gesture. “That sh*t was definitely a Nazi salute.”\n\nThis is hardly the first time that Wilson, who has not spoken to Musk since 2020, has called out the billionaire.\n\nIn July 2024, Musk took to his X platform to say that Wilson was “born gay and slightly autistic,” adding that, as a child, she would “pick out clothes for me to wear like a jacket and tell me it was ‘fabulous!’” Three days later,Musk sat down with Jordan Petersonfor a two-plus-hour live stream on X during which the media mogul claimed his “son” had been “killed” by “the woke mind virus.”\n\nMusk’s comments to Peterson effectively denied his daughter’s trans identity, reflecting his embrace of far-right politics, which often seek to crack down on transgender people’s rights and gender affirming care, and foreshadowed the politics he has pushed in his advisory role to Trump.\n\nCNN has reached out to Musk for comment.\n\nWilsontook to Threads— X’s Meta-owned rival — the same day to call out Musk for spreading misinformation, saying that his July 2024 X post was “entirely fake” before adding “literally none of this ever happened.”\n\nLaterthat same day, NBC News publishedan exclusive interview with Wilson, who emphasized that Musk “was under the assumption that I wasn’t going to say anything and I would just let this go unchallenged.”\n\nIn the 12 hours since Wilson’s Teen Vogue interview published, the billionaire has alleged thatNew York will attempt to illegally usher in non-citizen votingand amplified a post claiming that10,000 voters in Arizonaused the same social security number to vote.\n\nMusk alsorepeatedlycirculated postsconnecting the reports of vandalism on Teslas to trans people.\n\n“What are the statistics on trans violence,” Musk asked inyet another X poston Thursday. “The probability of a trans person being violent appears to be vastly higher than non-trans. Hormone injections cause extreme emotional volatility. That is simply a fact.”\n\nMusk on Thursdayalso shared a clip from Fox News in which anchor Harris Faulkner posited a hypothetical in which a Tesla set on fire by vandals could result in a human death, asking White House press secretary Karoline Leavitt if that could merit the death penalty.\n\n“What I can tell you is that President Trump condemns this violence, and he is determined to restore law and order in our country, and he will ensure that the harshest penalties are pursued for those who are engaging in this vicious violence that we have seen targeted at this American company,” Leavitt said in response to Faulkner’s hypothetical scenario.\n\nA self-described “free speech absolutist,” Musk has also used X — which heacquired in October 2022 for $44 billion— to repeatedly attack immigrants and transgender people,and to spread an antisemitic conspiracy theory.\n\nWilson’s interview in Teen Vogue, which also explores her queerness, comes as Trump has madedismantling diversity, equity and inclusion programsa cornerstone of his new administration.\n\nMusk, a Trump ally, has not shied away from voicing his disapproval of DEI programs,calling it“just another word for racism” last year and saying that “DEI must DIE” in aDecember 2023 X post. And, under his supervision, the Department of Government Efficiencyin Februarythreatened to pull federal funding for public schools and universities that failed to end their DEI programs within two weeks.",
        "source": "CNN",
        "tags": [
            "tesla"
        ],
        "headline_tags": [
            "tesla"
        ],
        "timestamp": "2025-03-20"
    },
    {
        "url": "https://www.cnn.com/2023/11/22/tech/openai-sam-altman-chaos-explained-intl-hnk/index.html",
        "headline": "OpenAI’s wild week. How the Sam Altman story unfolded",
        "content": "In a year of wild tech stories that has seenElon Musk transform Twitter, cryptocurrency exchangeFTXcollapse andSilicon Valley Bankimplode, this week’s whiplash-inducing turmoil at OpenAI is among the most captivating.\n\nSam Altman — the leader of one of the world’s most influential AI companies, OpenAI, and perhaps themost visible figure in the fledgling industry— was fired Friday night by the startup’s directorsin a surprise move. Less than five days later, he’s back as the company’s CEO, now with a board that is, in theory, more supportive of his vision.\n\nThe series of extraordinary events unfolded just days after OpenAI held itsfirst-ever developer conference, where it laid out new, commercialized versions of its technology, including the option to customize its ChatGPT AI chatbot.\n\nIf you’re just catching up, here’s what you missed from a week so incredible you’d be forgiven for thinking the script could have been written by an early version of OpenAI’s ChatGPT.\n\nAround 3 p.m. ET, Altman joined a Google Meet call with most of OpenAI’s board that had been convened by fellow co-founder and OpenAI chief scientist Ilya Sutskever, during which Altman was fired and told that the news would soon be made public.\n\nWithin the next half hour, the board also informed Greg Brockman, another co-founder and OpenAI president, that he would be removed from the board.\n\nAround 3:30 p.m. ET, OpenAI publicly announced that it had fired Altman over concerns that he was not always truthful with the board. The board said Mira Murati, the company’s chief technology officer, would become interim CEO.\n\nOpenAI’s strategic partners, including its biggest financial backer Microsoft, were also reportedly informed of Altman’s ouster just minutes before the board’s announcement.\n\nHours after being fired, Altman posted on X that he “loved working with such talented people” and that he would have “more to say about what’s next later.”\n\nBrockman promptly quit. “Please don’t spend any time being concerned. We will be fine,” Brockmansaid in a Friday poston X. “Greater things coming soon.”\n\nA key factor in the CEO’s firing was tension between Altman, who favored developing AI more aggressively, and members of the OpenAI board, who wanted to move more cautiously, according to CNN contributor Kara Swisher, who spoke to sources knowledgeable about the unfolding events.\n\nWithin 24 hours of Altman being fired, reports emerged that he and other ex-OpenAI loyalists were mulling plans for their own venture.\n\nOpenAI’s board was also reportedly having second thoughts and considering asking the ousted CEO to return.\n\nBy Sunday afternoon, Altman wasback at OpenAI’s headquarters — this time with a guest badge — to negotiate his potential return. Microsoft CEO Satya Nadella reportedly mediated the discussion. A 5 p.m. PT deadline was reportedly set for the board to agree to Altman’s demands, including adding a seat for Microsoft, and reinstating him as CEO.\n\nBut those talks broke down.\n\nAs Sunday turned into Monday, Nadella tweeted that Altman, along with Brockman, would join Microsoft to run a new AI research group. At OpenAI, the group found a new interim CEO: Emmett Shear, the former CEO of Amazon’s streaming service, Twitch. Murati would return to her role as OpenAI’s chief technology officer.\n\nIn a post on X early Monday, Shear, who left his role at Twitch in March, described the chance to join OpenAI as “a once-in-a-lifetime” opportunity. He added that the company would hire an independent investigator to report on what happened in the lead-up to Altman’s firing.\n\nBut OpenAI employees were not convinced. More than 500 staffers signed an open letter calling on the company’s board to resign and reinstate Altman and Brockman. They also threatened to follow the co-founders to Microsoft if their demands were not met.\n\nAltman posted on X, saying, “we have more unity and commitment and focus than ever before. we are all going to work together some way or other, and i’m so excited. one team, one mission.”\n\nThe drama was far from over.The Verge reported Monday afternoonthat Altman and Brockman could still return to OpenAI if the board members who fired him resign.\n\nAnd Nadella, speaking to CNBC, said he was “open to both options” when asked whether Altman would actually join Microsoft.\n\n“Look, that is for the OpenAI board and management and the employees to choose,” Nadella said. “We chose to explicitly partner with OpenAI and we want to continue to do so, and obviously, that depends on the people of OpenAI staying there or coming to Microsoft.”\n\nAltman was reinstated late Tuesday as OpenAI’s CEO, the company said on X.\n\n“We have reached an agreement in principle for Sam Altman to return to OpenAI as CEO with a new initial board,” the company said, adding that the board will be chaired by Bret Taylor, a former co-CEO of Salesforce. Former Treasury Secretary Larry Summers will also join the board, alongside existing director, Quora CEO Adam D’Angelo.\n\n“We are collaborating to figure out the details,” it said.\n\nIn his own post on X, formerly Twitter, Altmanwrotethat he is “looking forward” to returning to OpenAI and building on the firm’s “strong partnership” with Microsoft.\n\nIt’s unclear how Shear will be affected by Altman’s return. Posting on X, Shear wrote: “I am deeply pleased by this result, after (some) 72 very intense hours of work … I’m glad to have been a part of the solution.”\n\nBrockman is also returning to OpenAI, according to hispost on X.\n\nUltimately, Microsoft and Altman appear to be the big winners from the dust-up: Altman will continue leading the firm he helped to found. And Microsoft has wrested more control over the company it has backed with billions to bolster its ambitions in developing AI.\n\n“We are encouraged by the changes to the OpenAI board,” Nadellasaidon X. “We believe this is a first essential step on a path to more stable, well-informed, and effective governance.”",
        "source": "CNN",
        "tags": [
            "microsoft",
            "openai",
            "alphabet"
        ],
        "headline_tags": [
            "openai"
        ],
        "timestamp": "2023-11-22"
    }
]