[
    {
        "url": "https://www.npr.org/2025/03/26/nx-s1-5288157/new-york-times-openai-copyright-case-goes-forward",
        "source": "npr",
        "headline": "Judge allows 'New York Times' copyright case against OpenAI to go forward",
        "content": "A federal judge on Wednesday rejected OpenAI's request to toss out a copyrightlawsuitfromThe New York Timesthat alleges that the tech company exploited the newspaper's content without permission or payment. Inan orderallowing the lawsuit to go forward, Judge Sidney Stein, of the Southern District of New York, narrowed the scope of the lawsuit but allowed the case's main copyright infringement claims to go forward. Stein did not immediately release an opinion but promised one would come \"expeditiously.\" The decision is a victory for the newspaper, which has joined forces with other publishers, includingThe New York Daily Newsand the Center for Investigative Reporting, to challenge the way that OpenAI collected vast amounts of data from the web to train its popular artificial intelligence service, ChatGPT. Attorney Steven Lieberman, who is on the legal team representing the news publishers, celebrated the judge's ruling. \"We appreciate the opportunity to present a jury with the facts about how OpenAI and Microsoft are profiting wildly from stealing the original content of newspapers across the country,\" Lieberman said in a statement to NPR. Lawyers forThe New York Timesbelieve that the paper's articles are one of the biggest sources of copyrighted text that OpenAI used to build ChatGPT into the premier AI chatbot, and they allege that OpenAI violated copyright laws in its siphoning of the newspaper's journalism. In a statement to NPR, OpenAI spokesman Jason Deutrom said the company welcomes the judge's narrowing of the case, adding that lawyers for the ChatGPT maker \"look forward to making it clear that we build our AI models using publicly available data, in a manner grounded in fair use, and supportive of innovation.\" OpenAI leaders have argued that the company's mass data scraping, including articles fromThe Times, is protected under a legal doctrine known as \"fair use.\" It allows for material to be reused without permission in certain instances, including for research, teaching and commentary. The judge's ruling means that the suit can now proceed to trial, but a trial date has not been set. Evidence gathering, including depositions with executives on both sides of the case, are expected to happen confidentially, along with public pretrial hearings to settle disputes over evidence and other matters. The legal fight between one of the world's most influential news outlets and Silicon Valley's leading AI company puts a lot on the line for both the news industry and the future of AI tools. For publishers, the fear is that powerful chatbots that can quickly summarize news articles when queried will mean that readers visit news websites less often, prompting a drop in advertising that could affect the industry's bottom line. And while the suit only names OpenAI and its financial backer, Microsoft, other AI companies also scrape the web for content to train their models. For the most part, the AI industry has followed OpenAI's lead when it comes to training chatbot and other AI services, operating under the premise that processing data found on the open web into chatbot answers is legally protected by copyright law. But the law remains unsettled on the matter. Courts have said fair use of a copyrighted work must generate something new that is \"transformative,\" or comments on or refers back to an original work.The Timesargues that this does not apply to how OpenAI reproduces the paper's original reporting. Another part of the legal analysis will involve an idea known as \"market substitution,\" referring to whether chatbot answers are a substitute for, say, readingThe Timeswebsite, or if chatbots and newspapers operate in different marketplaces. Ina hearingin New York in January, lawyers for the publishers argued that when ChatGPT was asked questions about subjects covered byThe Times, the chatbot regurgitated articles verbatim. Yet OpenAI's legal team shot back that the news outlets appeared to have specifically manipulated prompts to essentially force the chatbot to spit out large chunks lifted from the paper's website. This is not how most people interact with the service, nor how the chatbot is designed to operate, said Joseph Gratz, a lawyer for OpenAI. \"This isn't a document retrieval system. It is a large language mode,\" Gratz said.",
        "summary": "A federal judge rejected OpenAI's request to dismiss a copyright lawsuit filed by The New York Times, accusing OpenAI of using the newspaper's content without permission or payment. The judge allowed the case to proceed, focusing on copyright infringement claims. The lawsuit alleges that OpenAI collected data from the web, including articles from The New York Times, to train its AI service, ChatGPT. OpenAI maintains that they build their AI models using publicly available data in a manner consistent with fair use.",
        "sentiment": {
            "company": "openai",
            "score": 0.1
        },
        "tags": [
            "microsoft",
            "openai"
        ],
        "timestamp": "2025-03-26 21:07:35",
        "headline_tags": [
            "openai"
        ]
    },
    {
        "url": "https://www.npr.org/2025/03/23/nx-s1-5333729/amazon-smart-speakers-disable-a-privacy-setting-that-allowed-local-storage-of-voice-recordings",
        "source": "npr",
        "headline": "Amazon smart speakers disable a privacy setting that allowed local storage of voice recordings",
        "content": "NPR's Ayesha Rascoe talks to Jennifer Tuohy of The Verge about changes to Amazon's smart speakers. Users will no longer be able to opt not to have their voice recordings sent to the cloud.",
        "summary": "Amazon has disabled a privacy setting on its smart speakers that allowed users to store voice recordings locally. This change means that voice recordings will now be sent to the cloud by default.",
        "sentiment": {
            "company": "amazon",
            "score": -0.6
        },
        "tags": [
            "amazon"
        ],
        "timestamp": "2025-03-23 12:02:55",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/04/nx-s1-5328683/microsoft-50-year-anniversary-computing-revolution",
        "source": "npr",
        "headline": "Microsoft turns 50: A look back at everything from the Altair to the Zune",
        "content": "It all started with two kids who shared a geeky hobby. Growing up in Seattle, childhood friends Bill Gates and Paul Allen were obsessed with an emerging industry called computing. As teenagers, they haunted the University of Washington's computer lab, the only place they could get their hands on the technology that so fascinated them. By 1971, they'd taken so many liberties with the lab's equipment that its directorsent Allen a letterdemanding he turn in his key. Little did Allen know that in 2017, he'd read that letter aloud to a crowd gathered to celebrate the dedication of a new computer science school in his name. By then, Gates and Allen had accomplished their goal of helping put a computer on every desk and in every home, laying the foundation for the digital technology that has since proliferated into every corner of our lives. They called their company Microsoft, and it led the personal computing revolution. In 1975, the two friends were in their twenties: Gates was studying at Harvard and Allen had dropped out of college to take a job at Honeywell. Allen had a lightbulb moment that would change their lives — and ours — when he spottedan ad on the coverofPopular Electronics.It was for a build-it-yourself computer called an Altair 8800. A company called MITS sold the computer as a kit. An Altair was about the size of an apple crate, with no screen, just lights and switches on the front. You'd program it by punching holes into paper. Allen wondered if he and his friend could create a programming language for it. Allen \"went running to Bill and said, 'We have to catch this train,'\" said Ed Lazowska, a computer science professor and Bill and Melinda Gates chair emeritus at the Allen School at the University of Washington. \"The rest is history.\" Together, they built something called an \"interpreter,\" which would tell the computer how to execute commands from the user. They offered to license the program to MITS, which could sell it along with the kits. MITS said yes. They were in business. Allen and Gates moved to Albuquerque to work with MITS, forming an informal partnership called \"Micro-soft.\" Their program for the Altair became Microsoft BASIC — think of it as the root of all their software that was to come. Microsoft wasn't theonlycompany that was creating programming. Computer makers did, too, although sometimes it was just simple binary. The problem was, computer makers often wrote programs that only worked for specific machines. They couldn't be used on other devices. Microsoft's big idea was to make programming that worked onmanymodels and could be sold separately. The notion that software itself had value was novel — so much so that Gates had towrite a letterto fellow hobbyists begging them to stop pirating it. \"As the majority of hobbyists must be aware, most of you steal your software,\" Gates wrote in 1976. \"Hardware must be paid for, but software is something to share. Who cares if the people who worked on it get paid?\" According to Lazowska, this was a seminal moment for the fledgling software industry. \"The notion that software had value really stems from that letter that Bill wrote to hobbyists,\" he said. \"Of course, these days we think softwareisthe value, in many ways. That's where the creativity arises more than anywhere else. That's one of the many things Microsoft brought to the world. It'sthesoftware industry.\" Back in the 1970s, the new industry was facing a big limitation: a small pool of customers. Computers mainly belonged to kit hobbyists — the early adopters who Gates was trying to persuade to become paying customers — or to the academic and business institutions that could afford much more powerful room-sized mainframes. \"When Microsoft was launched, digital technology was in universities and major companies in multimillion dollar computers, locked in big air conditioned rooms,\" Lazowska said. But Gates and Allen had a moonshot idea: To put a computer on every desk. Running Microsoft software, of course. \"Now, digital technology is absolutely everywhere, and that's the transformation,\" said Lazowska. Today, he says, computing is so omnipresent — it's the phone in your pocket, the watch on your wrist, the laptop you use for everything — that we barely think about it. \"In many ways, it's the vision of Bill and Paul that drove that transformation,\" he said. Most people learned of Microsoft's next big innovation because it came preinstalled on the first home computers IBM rolled out in the early 80s. It was called the Microsoft Disk Operating System — MS-DOS, for short. In a shrewd business move, Gates and Allen made sure they could license MS-DOS toanycomputer manufacturer, not just IBM. That non-exclusivity deal helped Microsoft software take over the world. MS-DOS was groundbreaking, but it wasn't exactly user-friendly by today's standards. At a recent vintage computer festival in Seattle, Michael Brutman booted it up on an early PC. \"The DOS environment is very minimal,\" he said.Reallyminimal. Just a black screen where you type in commands listed in a two-inch thick manual, which he also had on display. Still, the advent of the PC — short for personal computer — meant that ordinary people were learning how to type those commands. Even if they didn't work for a major research university or corporation, they might encounter a PC in their school or office. \" If you used an IBM PC, Microsoft was there,\" Brutman said. Microsoft's next step into the desktop world was even bigger. EnterWindows. Instead of typing commands, Windows allowed users to navigate by pointing and clicking on colorful, intuitively-named icons. Microsoft didn't invent the graphic operating system, but it did make it cheaper and more widely available — and that really helped personal computers take off. For University of Washington tech historian and author Margaret O'Mara, two things come to mind when she thinks back on Microsoft's greatest hits: \" I immediately think of Windows and Office,\" she said. \"I think of the system that by the end of the 1990s was running on nearly every single desktop computer in the world.\" That system introduced household names we still use today: Word, PowerPoint, Excel. The idea that applications could be used across industries and parts of society was something new. \"Software was a tool you could use in your home, in your school and in your office,\" O'Mara said. \"These were no longer separate things.\" By now, Microsoft's moonshot was a success. The companydidget a PC on every desk — running Microsoft software. Now it needed a new frontier. Microsoft was a software company, but by the early 2000s, its top rivals were scoring big wins in hardware. Apple built its devices in-house, giving the company more control and a product that was often sleeker and easier to use. ItsiPodandiPhonewere the superstars of the mobile technology world. Microsoft's attempts to compete — likethe Zune, its 2006 ill-fated answer to the iPod — didn't pan out. Likewise, the Windows Phone andthe Kin, Microsoft's 2010 forays into smartphones, were a bust. But one of the company's big hardware reinvention efforts paid off. Microsoft branched out to become a gaming company, driven by the wild success of theXboxvideo game console, which debuted in 2001. Hit games likeHalogave it unique appeal, and the idea to let gamers play together over the internet on Xbox Live set the gaming system apart. Today, the company is reinventing itself yet again. Microsoft Azure, its cloud computing platform, has been a big revenue driver. The company uses its vast network of data centers to sell technology services to other businesses, many of which are adopting artificial intelligence applications and need cloud computing to run them. Microsoft, too, is betting heavily on artificial intelligence. With its partner OpenAI, Microsoft hasbuilt ChatGPT into its Bing search engine. Microsoft is also increasingly outfitting Windows and Office products with Copilot, its in-house AI software. \"The company's ability to reinvent itself is remarkable, and that's pretty unusual,\" Lazowska said. \"Many companies just keep riding the same horse and don't change — and eventually fade away.\" Full disclosure: Microsoft is a financial supporter of NPR, but we cover them like any other company.",
        "summary": "Microsoft, founded by childhood friends Bill Gates and Paul Allen, revolutionized the personal computing industry by putting a computer on every desk and in every home. The company's journey started with the development of a programming language for the Altair 8800 computer in the 1970s. Microsoft's impact on digital technology has been profound, shaping the way we interact with technology today.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.8
        },
        "tags": [
            "microsoft",
            "apple",
            "openai"
        ],
        "timestamp": "2025-04-04 09:00:00",
        "headline_tags": [
            "microsoft"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/30/nx-s1-5382294/sundar-pichai-google-antitrust-testimony",
        "source": "npr",
        "headline": "In court, CEO Sundar Pichai defends Google against the DOJ's 'extraordinary' proposals",
        "content": "Alphabet CEO Sundar Pichai testified in federal court Wednesday that a Justice Department proposal that would force Google to share its search data, including with competitors, would be a \"de facto divestiture\" of the company's search engine, which took decades of investment and innovation to build. He called the Justice Department's proposal \"so far-reaching, so extraordinary\" that it feels as though the government is asking for a sell-off of the company's core intellectual property. He said it's unclear how Google could go on to fund innovation if its work is to be given away at marginal cost. Pichai, 52, addressed the court from the witness box wearing a neat, dark suit during the second week of theremedies trialthat will determine which penalties U.S. District Judge Amit Mehta will levy against the nearly $2 trillion company. Almost a year ago, Mehta ruled that Google hadacted illegally to maintain a monopolyon the search engine market. When it filed its original case in 2020, the Justice Department took aim at Google's contracts with device makers like Apple and Samsung, which made the company's search engine the default on new phones. The department argued that this unfairly boxed out competitors, and it's asking Mehta to rule that Google must stop paying for exclusive default placements. The government also wants Google tospin off its Chrome browser, arguing the world's most popular browser powers the tech company's advertising business by harvesting data from user activity on Chrome and Google search. Splitting this off would create more competition within the online search market, the Justice Department argues. This phase of the trial has alsofocused heavily on Google's artificial intelligence products, like its Gemini chatbot. The Justice Departmenthas arguedthat Google has created a system in which its control of search gives an advantage to its AI products, while its AI products direct more users back to Google search. This, the department argues, is a cycle that maintains the tech company's dominance and blocks competitors out of both marketplaces. And to break it, the department argues that Google should be ordered to license its search data — such as users' search terms and results — to other companies. The Justice Department wrapped its case on Tuesday afternoon, and Google is now presenting evidence and calling experts and witnesses to testify, which will include more executives from Google, Mozilla and Apple. Google maintains that it will appeal Mehta's underlying ruling once the penalty phase of the trial is over. Pichai, who joined Google in 2004, held many roles at the company before taking the top gig, including overseeing Chrome. The theme of his testimony was of little surprise, as the tech giant has long argued that the Justice Department's proposed remedies are both dangerous and \"unprecedented\" and would hurt American consumers, the economy and tech innovation. The testimony focused on how Google views the development of AI and how it is innovating the technology. \"AI is one of the most profound technologies humans will ever work on,\" Pichai said. He testified that Google has spent roughly $49 billion on AI research and development and is considered one of the top two or three companies in the world spending in this space. When Pichai took the helm of Alphabet, Google's parent company, he directed the company to become \"AI first\" and to invest deeply in this technology, believing that people are not just looking for information on the internet but seeking to get things done. AI can do that, he said. The company integrates AI into many products but first wove the technology into Google's search engine, where it led to a major improvement in the quality of search, he said. Mehta asked Pichai how he sees AI disrupting search in just a few years. AI \"will deeply transform\" Google search, Pichai replied, and the way it will evolve will be very profound. Pichai called this a \"dynamic moment\" when a number of newly developed chatbots are reaching tens of thousands of users each day. Pichai said that Google views its AI chatbot, Gemini, as a leading model in the industry but that still a \"big gap\" remains between them and what he views as the market leader:OpenAI's ChatGPT. In court, Google's lawyers have previously argued that ChatGPT and Meta's Meta AI chatbots outstrip Gemini's popularity, evidence that Google is not dominating in this marketplace. Pichai said that there is a lot of competition in this space and that ultimately \"the best product will win the marketplace.\" The Justice Department had previously called Nick Turley, OpenAI's head of product for ChatGPT, to the stand to make the company's case for why it fears that Google's monopoly on search could ultimately creep into the AI market. Turley testified that the company wants access to Google's search index and data to improve its own technology. Google's search index is basically a giant database of the pages and information on the internet. When you type a query into Google's search engine, it scans this database to return links to webpages. But AI developers can also use databases like these to train large language models, like chatbots, so that they can generate humanlike responses and engage in conversations. Turley testified that after ChatGPT became a viral hit, OpenAI tried to develop its own search index, but it was too expensive and time-consuming. Instead, he said, it sought a partnership with a third-party provider — and Google rebuffed the company. Google's attorneys are expected to call witnesses through the end of next week, and closing arguments will be made at the end of May. Mehta is expected to make a decision by August. Google is a financial supporter of NPR.",
        "summary": "Alphabet CEO Sundar Pichai defended Google in court against the Justice Department's proposals, arguing that forcing Google to share search data with competitors would essentially be a divestiture of its core search engine. The DOJ's proposals, including sharing search data and potentially spinning off Chrome, are deemed as far-reaching and extraordinary by Pichai. The trial, focusing on remedies for Google's alleged monopoly, also highlighted concerns about Google's AI products and their relationship with search. The government aims to increase competition in the online search market by challenging Google's practices.",
        "sentiment": {
            "company": "alphabet",
            "score": -0.6
        },
        "tags": [
            "apple",
            "alphabet",
            "meta",
            "openai",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris",
            "leidos"
        ],
        "timestamp": "2025-04-30 18:04:28",
        "headline_tags": [
            "alphabet"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/29/nx-s1-5379916/texas-a-m-senior-research-engineer-describes-the-kinds-of-risks-facing-power-grids",
        "source": "npr",
        "headline": "Texas A&M senior research engineer describes the kinds of risks facing power grids",
        "content": "NPR's A Martinez speaks with senior research engineer Jonathan Snodgrass at Texas A&M University about the safety of power grids after three countries in Europe experienced blackouts.",
        "summary": "Senior research engineer Jonathan Snodgrass from Texas A&M University discusses the risks facing power grids following recent blackouts in Europe, highlighting the importance of grid safety and resilience.",
        "sentiment": {
            "company": "ge",
            "score": 0.0
        },
        "tags": [
            "ge",
            "3m"
        ],
        "timestamp": "2025-04-29 08:29:43",
        "headline_tags": [
            "ge"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/29/nx-s1-5380707/amazon-satellite-rocket-spacex-bezos-musk-starlink",
        "source": "npr",
        "headline": "Amazon launches its first internet satellites to compete against SpaceX's Starlinks",
        "content": "CAPE CANAVERAL, Fla. — Amazon's first batch of internet satellites rocketed into orbit Monday, the latest entry in the mega constellation market currently dominated by SpaceX's thousands of Starlinks. The United Launch Alliance's Atlas V rocket carried up 27 of Amazon's Project Kuiper satellites, named after the frigid fringes of our solar system beyond Neptune. Once released in orbit, the satellites will eventually reach an altitude of nearly 400 miles (630 kilometers). Two test satellites were launched in 2023, also by an Atlas V. Project officials said major upgrades were made to the newest version. The latest satellites also are coated with a mirror film designed to scatter reflected sunlight in an attempt to accommodate astronomers. Stargazers oppose the fast-growing constellations of low-orbiting satellites, arguing they spoil observations. Others fear more satellite collisions. Founded by Jeff Bezos, who now runs his own rocket company, Blue Origin, Amazon aims to put more than 3,200 of these satellites into orbit to provide fast, affordable broadband service around the globe. Elon Musk's SpaceX already has launched more than 8,000 Starlinks since 2019. The company marked its 250th Starlink launch Sunday night. More than 7,000 Starlinks are still in orbit some 300-plus miles (550 kilometers) above Earth. The European-based OneWeb satellite constellation numbers in the hundreds in an even higher orbit. Amazon already has purchased dozens of rocket launches from United Launch Alliance and Blue Origin for Project Kuiper, as well as others. \"There are some things you can only learn in flight\" despite extensive testing on the ground, said Rajeev Badyal, the project's vice president. \"No matter how the mission unfolds, this is just the start of our journey,\" he said in a statement ahead of the evening liftoff. The first liftoff attempt earlier this month was nixed by bad weather. It took until now to secure another spot in the launch lineup at Cape Canaveral Space Force Station.",
        "summary": "Amazon launched its first batch of internet satellites under Project Kuiper, aiming to compete with SpaceX's Starlink constellation. The 27 satellites were carried into orbit by the United Launch Alliance's Atlas V rocket, with plans to eventually deploy over 3,200 satellites for global broadband service. Amazon's move into the satellite market intensifies the competition with SpaceX and OneWeb in providing internet services from space.",
        "sentiment": {
            "company": "amazon",
            "score": 0.8
        },
        "tags": [
            "amazon",
            "visa",
            "nextera",
            "bp",
            "boeing",
            "lockheed",
            "northrop",
            "l3harris"
        ],
        "timestamp": "2025-04-29 05:07:41",
        "headline_tags": [
            "amazon"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/24/nx-s1-5374024/microsoft-antitrust-case-google",
        "source": "npr",
        "headline": "Decades later, the Microsoft antitrust case casts a shadow over the Google trial",
        "content": "A legendary legal case looms large over the ongoing, landmarkantitrust caseinvolving Google and the U.S. government. A federal judge has ruled that the tech giant operated as a monopoly because it illegallystifled competitionin the search engine market. For the next few weeks, the judge is hearing arguments from the Justice Department and Google to decide the penalties to levy against the company. As both sides present arguments over what remedies are appropriate, the name of another tech titan keeps coming up: Microsoft. But why? A quarter-century ago, a federal judge decided a similar case inU.S. v. Microsoft,in which the federal government accused the world's leading software company at the time of trying to monopolize the personal computer market. That case established precedent forthe current Google caseand helped shape current antitrust law especially as it relates to other tech companies, legal experts told NPR. The case is almost 30 years old and yet, \"It's the key to all this. Both sides are going to try to pull parts of it to make their case,\" said Sam Weinstein, a law professor at Yeshiva University in New York. Here's a look back at that storied case and how it could shed light on how the Google case could end. The 1998 antitrust case brought against Microsoft by the U.S. Department of Justice, 20 states attorneys general and the District of Columbia finally came after years of investigations by federal agencies. Decades later,Microsoftis still considered \"the most important antitrust case for digital platforms in the last 30 years,\" said Rebecca Haw Allensworth, a professor of antitrust law at Vanderbilt University. The case centered on whether Microsoft was abusing its position as a monopoly by packaging itsInternet Explorer browserwith its Windows operating system. The DOJ claimed that companies like Netscape, the maker of a competing web browser, were aggressively being boxed out by Microsoft, widely considered the dominant tech player at the time. Microsoft \"made their own browser,\" Allensworth said. \"And they made it really hard for Netscape to distribute at scale.\" In fact, Microsoft was considered an outright \"bully\" then, Weinstein said. It executed aggressive tactics to ensure it established exclusive deals with other companies to keep Internet Explorer on certain devices and to keep other browsers off of desktops, he said. Weinstein noted that famously, the DOJ's investigationrevealed that a Microsoft executivetold Intel, another tech giant, that his organization would \"cut off Netscape's air supply\" and that in \"giving away free browsers\" Microsoft would choke off Netscape's sources of revenue. In court testimony, Paul Maritz, the former Microsoft executive accused of making that statement,denied saying this. Eventually, U.S. District Judge Thomas Penfield Jackson ordered Microsoft to be split in two – an aggressive penalty that would eventually be overturned on appeal in 2001. \"By then, a new administration had come in and the priorities of the DOJ had changed, and they settled the case without a breakup,\" Allensworth said. The DOJ and Microsoft agreed to drop plans for a breakup of the tech giant and in return Microsoft had to establish an internal antitrust technical committee and compliance program. The ruling that Microsoft was a monopoly remained unchanged. Though a breakup was averted, theMicrosoftcase established a legal precedent for how the U.S. government could pursue monopolistic tech companies, Weinstein said. The DOJ modeled its search engine antitrust complaint against Google, as well as proposed remedies, on theMicrosoftcase. By doing that \"they're essentially saying if we can make our case look like Microsoft, we can win too. And I think that worked on the liability phase,\" Weinstein said. In its original complaint, the government claimed that Google was following the Microsoft playbook in its monopolistic practices. Google continues to deny it is a monopoly and says it intends to appeal U.S. District Judge Amit Mehta'sdecisionon liability. In the first days of testimony in the remedy trial being heard at the D.C. federal court,Microsoftcomes up frequently. In court filings the government points toMicrosoftas a roadmap for how penalties should be levied against Google. Those penalties include a proposed divestiture of its Chrome web browser, for Google to stop making third-party payments to phone makers like Apple that ensure its default search position and to possibly sell Google's Android smartphone operating system. Chrome is the world's leading web browser and Android is used by more smartphone users than any other operating system. Chrome comes with the Google search engine set as the default, and Android is bundled with Google apps, including Chrome. Google says in court filings that the government's penalty proposals go beyond the conduct Judge Mehta found was monopolistic and are contrary to law established by theMicrosoftcase. But there are different schools of thought on how impactful Microsoft's penalties actually were. The eventual settlement between the DOJ and Microsoft was \"effective in opening the door to new competitors like Apple and Google,\" Weinstein said. Without the Microsoft case, some could argue companies as big and successful as Apple or Google could never emerge, he said. The other view is that Microsoft got off light, he said. And knowing all of this history still makes it hard to predict what might happen in the Google case. \"It's hard to know what's gonna happen here,\" Weinstein said.",
        "summary": "The ongoing landmark antitrust case involving Google and the U.S. government has drawn parallels to the historic U.S. v. Microsoft case from a quarter-century ago. Legal experts suggest that the Microsoft case set a precedent that could impact the current Google trial and shape antitrust law for tech companies. The Microsoft case, which revolved around allegations of monopolistic practices related to its Windows operating system and Internet Explorer browser, is still considered a crucial antitrust case in the digital platform landscape. The current case against Google involves accusations of stifling competition in the search engine market, echoing themes from the Microsoft case.",
        "sentiment": {
            "company": "microsoft",
            "score": 0.2
        },
        "tags": [
            "microsoft",
            "apple",
            "alphabet",
            "dow",
            "broadcom"
        ],
        "timestamp": "2025-04-24 09:01:00",
        "headline_tags": [
            "microsoft",
            "alphabet"
        ]
    },
    {
        "url": "https://www.npr.org/2025/04/23/nx-s1-5373560/apple-meta-eu-tech-fines",
        "source": "npr",
        "headline": "The European Union hits Apple and Meta with 700 million euros in fines",
        "content": "LONDON — European Union watchdogs fined Apple and Meta hundreds of millions of euros Wednesday as they stepped up enforcement of the 27-nation bloc's digital competition rules. The European Commission imposed a 500 million euro ($571 million) fine on Apple for preventing app makers from pointing users to cheaper options outside its App Store. The commission, which is the EU's executive arm, also fined Meta Platforms 200 million euros because it forced Facebook and Instagram users to choose between seeing personalized ads or paying to avoid them. The punishments were smaller than the blockbuster multibillion-euro fines that the commission has previously slapped on Big Tech companies in antitrust cases. Apple and Meta have to comply with the decisions within 60 days or risk unspecified \"periodic penalty payments,\" the commission said. The decisions were expected to come in March, but the self-imposed deadline slipped amid an escalating trans-Atlantic trade war with U.S. President Donald Trump, who has repeatedly complained about regulations from Brussels affecting American companies. The penalties were the first issued under the EU's Digital Markets Act, also known as the DMA. It's a sweeping rule book that amounts to a set of do's and don'ts designed to give consumers and businesses more choice and prevent Big Tech \"gatekeepers\" from cornering digital markets. The DMA seeks to ensure \"that citizens have full control over when and how their data is used online, and businesses can freely communicate with their own customers,\" Henna Virkkunen, the commission's executive vice president for tech sovereignty, said in a statement. \"The decisions adopted today find that both Apple and Meta have taken away this free choice from their users and are required to change their behavior,\" Virkkunen said. Both companies indicated they would appeal. Apple accused the commission of \"unfairly targeting\" the iPhone maker, and said it \"continues to move the goalposts\" despite the company's efforts to comply with the rules. Meta Chief Global Affairs Officer Joel Kaplan said in a statement that the \"Commission is attempting to handicap successful American businesses while allowing Chinese and European companies to operate under different standards.\" In a press briefing in Brussels, commission spokespeople sought to tamp down concerns that the penalties would inflame trade tensions. \"We don't care who owns a company. We don't care where the company is located,\" commission spokesperson Thomas Regnier told reporters. \"We are totally agnostic on that front.\" \"And be it a Chinese company, be an American company, or be it a European company, you will have to play by the rules in the European Union.\" In the App Store case, the Commission had accused the iPhone maker of imposing unfair rules preventing app developers from freely steering consumers to other channels. Among the DMA's provisions are requirements to let developers inform customers of cheaper purchasing options and direct them to those offers. The commission said it ordered Apple to remove technical and commercial restrictions that prevent developers from steering users to other channels, and to end \"noncompliant\" conduct. Apple said it has \"spent hundreds of thousands of engineering hours and made dozens of changes to comply with this law, none of which our users have asked for.\" \"Despite countless meetings, the Commission continues to move the goalposts every step of the way,\" the company said. The EU's Meta investigation centered on the company's strategy to comply with strict European data privacy rules by giving users the option of paying for ad-free versions of Facebook and Instagram. Users could pay at least 10 euros ($11.40) a month to avoid being targeted by ads based on their personal data. The U.S. tech giant rolled out the option after the European Union's top court ruled Meta must first get consent before showing ads to users. Regulators took issue with Meta's model, saying it doesn't allow users to exercise their right to \"freely consent\" to allowing their personal data from its various services, which also including Facebook Marketplace, WhatsApp, and Messenger, to be combined for personalized ads. Meta rolled out a third option in November giving Facebook and Instagram users in Europe the choice to see fewer personalized ads if they don't want to pay for an ad-free subscription. The commission said it's \"currently assessing\" this option and continues to hold talks with Meta, and has asked the company to provide evidence of the new option's impact. \"This isn't just about a fine; the Commission forcing us to change our business model effectively imposes a multibillion-dollar tariff on Meta while requiring us to offer an inferior service,\" Kaplan said. \"And by unfairly restricting personalized advertising the European Commission is also hurting European businesses and economies.\" The EU has already sanctioned Apple under the DMA, but it didn't involve a fine. The bloc took action earlier this year to compel the company to open up its iPhone and iPad operating systems by outlining the steps it must take to work better with competing technologies.",
        "summary": "The European Union fined Apple 500 million euros for restricting app makers from directing users to cheaper options outside of its App Store. Meta Platforms was fined 200 million euros for forcing Facebook and Instagram users to choose between personalized ads or paying to avoid them. Both companies must comply with the decisions within 60 days or face penalty payments. The fines were the first under the EU's Digital Markets Act, aimed at promoting consumer choice and preventing Big Tech from dominating digital markets.",
        "sentiment": {
            "company": "apple",
            "score": -0.6
        },
        "tags": [
            "apple",
            "meta"
        ],
        "timestamp": "2025-04-23 16:47:43",
        "headline_tags": [
            "apple",
            "meta"
        ]
    }
]