[
    {
        "url": "https://www.npr.org/2024/11/19/1214051393/the-indicator-from-planet-money-how-to-shop-during-a-crisis-11-19-2024",
        "headline": "How to shop during a crisis",
        "content": "Events like the recent dock worker's strike and hurricanes sparked panic buying among American shoppers. Today, a logistics expert helps us craft a shopper's guide for how to navigate a supply chain crisis. For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter ."
    },
    {
        "url": "https://www.npr.org/2024/11/19/nx-s1-5188416/development-of-elon-musks-rocket-to-mars-will-likely-take-off-under-trump",
        "headline": "Development of Elon Musk's rocket to Mars will likely take off under Trump",
        "content": "Later today, Elon Musk's company SpaceX is set to conduct another test of the largest rocket ever built. If all goes as planned, sometime after 5 PM ET, the giant rocket, known as Starship, will lift off from its launch pad in Boca Chica, Texas. Starship is set to fly part way around the world before landing in the Southern Indian Ocean. Meanwhile, its super-heavy booster will attempt to return to the Texas launch site, where two robotic arms attached to the launch tower will try to grab it in mid-air. It will be the sixth test launch of the giant rocket, and its second in as many months. The tests are the latest sign that SpaceX intends to rapidly accelerate Starship's development. Next year, the company has said it would like to conduct as many as 25 launches. Up until now, environmental requirements have held back SpaceX. Under the current environmental assessment, the Federal Aviation Administration limits SpaceX to five launches per year. And earlier this year, the FAA delayed licensing of a flight after the Environmental Protection Agency fined SpaceX for violating the Clean Water Act . But with President Trump's election, those sorts of regulatory hold-ups may become a thing of the past. At a rally last month in Tempe, Arizona, Trump boasted that American astronauts would soon be headed to Mars: \"Get that spaceship going, Elon,\" he said. Trump wasn't explicitly referencing the Starship program, but many expect SpaceX will be given a green light to speed testing of the rocket. \"I think the biggest difference in the next year is on the regulatory side,\" says Lori Garver, a former Deputy Administrator of NASA under Barack Obama. \"The FAA and the EPA will not be raising flags as they have been these last couple of years.\" SpaceX is already a major contractor for the U.S. government. It's been paid billions to launch satellites, and for other services, like building a network of spy satellites . NASA has awarded around $4 billion explicitly for Starship's development. The space agency would like to use as a lunar lander. Starship is also at the heart of Elon Musk's dreams of making humanity a multiplanetary species. He hopes the giant rocket will radically lower the cost of launching people and equipment into space. Musk has said he wants to see Starships traveling to Mars with the aim of creating a self-sustaining colony. Starship's development has cost SpaceX billions and \"is probably absorbing cash rather than generating it at this point in time,\" says Tim Farrar, president of TMF Associates, which analyzes the satellite industry. Nevertheless, he says, Starship is central to SpaceX's plans for the future. \"The promise of Starship is something that is pretty important for SpaceX in terms of convincing investors to keep pouring in money at ever-increasing valuations,\" he says. Fulfilling the promise of Starship comes with environmental costs. The Boca Chica launch site is located in the middle of state and federally protected wetlands. Biologists have documented that the sound and heat from launches damage the eggs of nesting birds. Documents from the EPA and an application to Texas regulators suggest that each launch also discharges tens of thousands of gallons of water contaminated with chemicals from the launch into the local environment. SpaceX denies the water poses any serious harm, and it maintains that it is a good environmental steward: \"The narrative that we operate free of, or in defiance of, environmental regulation is demonstrably false,\" the company said in a statement in September . \"SpaceX is committed to minimizing impact and enhancing the surrounding environment where possible.\" But environmental groups disagree. The FAA is currently being sued by the Center for Biological Diversity and local environmental groups for failing to conduct an adequate environmental impact statement before allowing SpaceX to launch Starship even once from the site. Jared Margolis, a senior lawyer leading the suit says that if regulators do less in a new Trump administration, the courts could end up playing a larger role. \"We're not afraid of confronting the Trump administration,\" Margolis says. \"We're not afraid of making sure that environmental laws are being complied with. That's what we do.\""
    },
    {
        "url": "https://www.npr.org/sections/planet-money/2024/11/19/g-s1-34449/americas-first-major-immigration-crackdown-and-the-making-and-breaking-of-the-west",
        "headline": "America's first major immigration crackdown and the making and breaking of the West",
        "content": "The Chinese Exclusion Act of 1882 is widely considered to be the first major immigration clampdown in American history. It's a riveting tale that parallels today and may provide insights into the economic consequences of immigration restrictions and mass deportations. This is Part 1 of that story, which explains how Chinese immigrants became a crucial workforce in the American West and why, despite their sacrifices and contributions creating the transcontinental railroad, the railroad's completion may have actually contributed to a populist backlash that sealed their fates. Donner Memorial State Park in Truckee, California, is a place where natural beauty clashes with historic horror like maybe nowhere else on Earth. The park has a stunning alpine lake and inspiring views of the craggy, granite peaks of the Sierra Nevada. It's an awesome place to swim, boat, windsurf, hike, snowshoe, ski, picnic — you name it. It also just so happens to be the gruesome site where, in the winter of 1846-47, a snowbound Donner Party resorted to the most infamous incident of cannibalism in American history. The first time my wife and I visited Donner Memorial State Park together, we expected that the reminders of cannibalism would be the most disturbing part of an otherwise pleasant stroll around Donner Lake. We were wrong. Walking about halfway around the lake, we reached a beach area called China Cove. We peered across emerald waters for a beautiful view of granite-crowned Donner Peak. China Cove seemed like an odd name for this area. But then, on our walk out, my wife spotted a placard pointing to why. In the mountains just above the lake, there's a series of now-abandoned tunnels that, for well over a century, enabled the transcontinental railroad to cross the imposing Sierra Nevada. It was by far one of the most — if not the most — difficult stretches of the railroad to build. The mountains here are steep and made of solid granite. And, after Americans began to dream of a railroad that could link the Atlantic with the Pacific, surveyors determined that the train tracks would have to go literally right through them. The Pacific Railway Act, which was signed into law by President Abraham Lincoln in 1862, funded the creation of the transcontinental railroad. The federal government awarded contracts to two railroad companies. One, Union Pacific Railroad, would build from the east and the other, Central Pacific Railroad, would build from the west. Each company was paid in federal subsidies and land grants based on the miles of track they laid. This incentivized building track as quickly as possible because, as the companies built toward each other, one company's loss of a mile was the other's gain. The race was on. The Central Pacific Railroad had a much harder job. It had to build a railroad through the Sierra Nevada, with its sheer cliffs, hard granite, and monster snowstorms. And the company had to recruit workers on the still relatively unpopulated West Coast. Central Pacific Railroad first tried to recruit white workers to do the job. But many Americans were fighting in the Civil War and those Westerners who weren't fighting apparently believed they had better economic options, including trying to strike it rich in Nevada's booming silver mines. The work of building a railroad was brutal and turnover was high. The company found itself in a frantic search for a large and cheap labor force to help do the work in record time. Meanwhile, a small population of people had begun to arrive in the American West from the Far East, specifically the war-torn Guangdong province in Southern China. These thousands of Chinese immigrants were first attracted to Northern California for the same reasons that many white Americans and Europeans were: the lore of riches in the foothills of the Sierra Nevada after the discovery of gold in 1848 sent shockwaves around the world. Almost as soon as the Chinese came to America, they were targeted with discrimination, hostility, and violence. First, it was at the local and state levels. Beginning as early as 1849 , California mining counties began passing laws that sought to restrict the rights of the Chinese to mine. In 1850 and 1852, the California State Legislature passed laws taxing foreign miners (any foreigner who was considered a \"free white person\" was exempt). These were only some of the first shots in a barrage of discriminatory laws and community actions that would make life harder for Chinese immigrants. So, in the 1860s, Charlie Crocker, one of the executives and founders of Central Pacific Railroad, caused some controversy when he floated the idea of hiring Chinese workers to help build the railroad. Despite being recent migrants themselves — California had only recently become part of the United States after a war with Mexico — many white workers were unhappy seeing other foreigners getting jobs and seizing opportunities. Racist notions about Chinese people infected American perceptions of their value as community members and human beings. They also infected business executives' views of their capabilities as workers. At one point, for example, a railroad executive questioned whether the Chinese had the strength and skills to do masonry. Crocker reportedly replied , \"Did they not build the Chinese Wall, the biggest piece of masonry in the world?\" (Today, up near Donner Summit above the lake, there's a 150-foot tall retaining wall still standing that Chinese workers built for the transcontinental railroad. Locals have named it \"the China Wall.\") Central Pacific Railroad ended up deciding to hire Chinese workers, and the company turned to a Chinese labor contractor named Hung Wah to help with recruitment. Wah was based in Auburn, California, a mining town that sits in the foothills of the Sierra Nevada, along the planned railroad route. In 1863, Wah advertised in an Auburn newspaper that he could \"furnish any number of Chinese laborers to work on Rail Roads, Wagon Roads, or Mining Claims\" and could do so \"at the lowest cash rates.\" This ad apparently caught the attention of railroad executives. Between 1865 and 1869, the Central Pacific Railroad would employ about 20,000 Chinese immigrants in total — as much as 90% of their workforce at the peak of construction — to build the western section of the transcontinental railroad. Although these workers would prove themselves to be incredibly talented, brave, and productive, the company didn't treat them well. It paid them less than their white counterparts. It forced them to sleep in tents while white workers got to sleep in warmer box cars. And it enlisted them to do the most dangerous jobs. The section of the railroad that towers above Donner Lake, through Donner Pass, was especially difficult and perilous to build. One tunnel in particular, the Summit Tunnel, required workers to dig by hand, using primitive tools and explosives, through nearly 1,700 feet of solid granite. Roland Hsu is the former research director of Stanford University's Chinese Railroad Workers in North America Project, which tapped dozens of scholars from multiple disciplines to analyze and document the contributions of Chinese immigrants to the creation of the transcontinental railroad. Hsu says that, when constructing the tunnels, four Chinese workers would ram a long iron bar into the granite. Another would hit the bar with a sledgehammer. Next they would twist and hammer the bar again, arduously boring a hole into the rock. Once the hole was deep enough, they would pack it with explosives, light them, and run for their lives. \"That would break a layer of granite, and then they'd come back and — by hand — carry out all the debris.\" Inch by inch, it would take workers over two painstaking years to bore Summit Tunnel through Donner Peak — and Central Pacific Railroad, racing to complete the project, insisted they work around the clock and through the winters. These would be some of the snowiest winters on record. It was hard work. And, while the poor treatment they experienced might have led other workers to quit, the Chinese immigrants had fewer options than other workers. That said, they still refused to be mere cogs in their railroad company's machine. In June 1867, in what proved to be the biggest organized labor strike in the nation , Chinese workers stopped working on the railroad in a fight for better pay, reduced hours (from 11 to 10 hours a day), and better working conditions. Fearing that if he gave them an inch they'd take a mile, Crocker declared he would not meet their demands. And, after about a week of labor strife, Crocker turned to intimidation efforts, including cutting off the supply of food and other provisions to the camps of Chinese workers. The company ultimately coerced the laborers to return to work. Despite the mostly unsuccessful strike, historians note that the company did end up increasing their pay in coming months. Countless Chinese workers died constructing Summit and other tunnels in the mountains above Donner Lake. They died in explosions. They died falling. They died freezing to death in the elements at altitude during brutal snowstorms and subzero cold spells. They died in avalanches of rock and snow. \"And one thing we do know is that those who died in the avalanches, their bodies were left at the base towards what's now Donner Lake until the spring,\" Hsu says. \"Because the company was not gonna go in and try to dig them out or even see if they were worth rescuing.\" We lack solid estimates for the exact number of Chinese laborers who died building the transcontinental railroad, but, Hsu says, evidence suggests it was as high as 1,200. For perspective, 42 people died in the Donner Party, which now has a lake, a mountain, a pass, a state park, and more named in their memory. The transcontinental railroad was completed in 1869. It was a marvel of modern engineering and technological innovation, slashing the time it took to cross the United States from many months to a mere week. It literally united the nation. Not only did the railroad reduce the time and cost of making the journey, it also helped ensure that there would be no more tragedies like the Donner Party. There's no doubt that the railroad would ultimately be a gigantic engine that powered economic growth in the West. But, as with many other new technological waves in history, excitement about locomotives was accompanied by a speculative mania. And, when the spell was broken and the economy came crashing down, life would get much worse for Chinese immigrants. Railroad investors believed that the sky was the limit with the transcontinental and other railroads. They took on massive amounts of debt, buying railroad bonds and gobbling up real estate they believed would increase in value near train stops. This debt proved to be a ticking time bomb. What followed was a financial crisis known as \"The Panic of 1873,\" which led to what some historians call \"the first Great Depression,\" or \"the Long Depression.\" Nationally, the unemployment rate skyrocketed to 14 percent. The economy remained bad for many years. Nancy Qian, an economist at the Northwestern University Kellogg School of Management, says this harsh recession was worse in the West — and one reason, ironically, was the transcontinental railroad. \"One of the ironies of integrating the East and West of the United States with the transcontinental railroad is that the West had to now compete with the East,\" Qian says. \"The East was more developed than the West. This made it very difficult for manufacturing and agriculture in the West.\" Like so many other times in history, economic turmoil led to scapegoating, populist foment, and racial violence. With many white people now looking for gainful employment, Qian says that Western voters and populist politicians began to blame Chinese immigrants for taking jobs. They began to gravitate to the idea that, \"If we kick out the Chinese, then the rest of us will have more jobs, more opportunities.\" Ground zero for this movement to kick the Chinese out of America would be none other than the home to what is now Donner Memorial State Park: Truckee, California. Many of the Chinese immigrants who built the railroad moved there after its completion. In fact, they helped make Truckee's \"Chinatown\" one of the largest in the nation. But soon that would dramatically change. Next week in the Planet Money newsletter: the movement to exclude and expel Chinese immigrants from the United States, and a new study that shows how Chinese exclusion affected the American economy. Subscribe here ."
    },
    {
        "url": "https://www.npr.org/2024/11/19/nx-s1-5181482/how-will-a-2nd-trump-presidency-affect-your-financial-life",
        "headline": "How will a 2nd Trump presidency affect your financial life?",
        "content": "A second Trump term might mean a lower tax bill, but it could have drastic consequences for the national budget. We take a look at the impact on taxes and Social Security."
    },
    {
        "url": "https://www.npr.org/2024/11/18/g-s1-34704/pete-hegseth-paid-accuser-career-scrutiny-defense",
        "headline": "Defense pick Peter Hegseth paid accuser to protect his career, his lawyer confirms",
        "content": "An attorney for Pete Hegseth, the longtime Fox News host and President-elect Donald Trump's nominee for defense secretary, confirmed to NPR that Hegseth had paid a woman who accused him of sexual assault in order to prevent her from filing a lawsuit that could damage his career. Hegseth, 44, left Fox News last week after his pending nomination was announced, the network said. Hegseth has denied the woman's allegations. The incident took place in 2017. The Washington Post reported Saturday that Hegseth's lawyer, Timothy Parlatore, said in a statement that Hegseth had reached a settlement with his accuser, which included paying her an unknown amount of money in exchange for her signing a nondisclosure agreement. This arrangement was intended to stop her from filing a lawsuit and to protect Hegseth's position at Fox News, the Pos t reported. Parlatore told NPR on Monday that the information attributed to him by the Post was accurate. According to the Post article , a friend of the woman had shared information about the incident in a memo sent to the Trump transition team last week. NPR has not independently confirmed the contents of the memo. \"President Trump is nominating high-caliber and extremely qualified candidates to serve in his Administration,\" Trump Communications Director Steven Cheung said in a statement to NPR. Hegseth's nomination will go forward, Cheung said. \"Mr. Hegseth has vigorously denied any and all accusations, and no charges were filed,\" he said. \"We look forward to his confirmation as United States Secretary of Defense so he can get started on Day One to Make America Safe and Great Again.\" Trump has himself been convicted of falsifying business records connected to hush money payments , to adult-film star Stormy Daniels, a case he claims is politically motivated. In 2017, Hegseth was named in an investigation by the Monterey Police Department concerning a reported sexual assault at a golf resort in California. According to a statement from city officials, Hegseth acknowledges having a sexual encounter with the woman but insists it was consensual. The incident occurred in the early hours of Oct. 8 at 1 Old Golf Course Road, which is the address of Hyatt Regency Monterey Hotel and Spa. Police say the woman reported an injury to her right thigh. Their news release does not disclose the alleged victim's name or age; however, she was 30 at the time and worked for the California Federation of Republican Women, assisting with logistics while Hegseth spoke at their conference. She was staying at the hotel with her husband. Hegseth's relationship status at the time was complicated: in 2017, his second wife filed for a divorce \"around the same time\" he and his current wife had a baby, according to The Washington Examiner . In his statement to the Post , Parlatore says that Hegseth had been drinking at the hotel bar and was intoxicated when he went to his hotel room with the woman. According to the Post , the memo from the woman's friend said that the woman took Hegseth to the room after being informed that he was being a nuisance to other women. A few days later, she contacted the police to report a sexual assault. After the woman hired an attorney a couple of years later to consider a lawsuit, both parties reached an agreement. Parlatore noted in his statement to the Post that the MeToo movement was gaining momentum at the time, and he told CBS News that Hegseth would have faced \"an immediate horror storm\" had he been publicly accused of sexual assault, a quote that Parlatore confirmed to NPR. The incident in Monterey occurred about a year after Fox News settled with former Fox & Friends co-host Gretchen Carlson for $20 million over her sexual harassment claims against the network's former chairman, Roger Ailes. Between early 2017 and 2020, the network experienced several high-profile departures linked to misconduct allegations, including  hosts Bill O'Reilly and Eric Bolling , Washington correspondent James Rosen and news host Ed Henry . When Hegseth pending nomination emerged last week, the selection seemingly surprised several Republican lawmakers; as NPR reported, his name was not on the known shortlist of potential nominees. But it continued a pattern of Trump's placing loyalists and Fox News personalities in prominent positions . Trump's pick has put Hegseth, who lives in Tennessee with his wife and seven children, under intense scrutiny. Prominent Democrats and military experts have raised questions that range from the meaning of his tattoos and political ethos to whether Hegseth is qualified to oversee the country's largest employer. The Defense Department has \"more than 2.1 million Military Service members and over 770 thousand civilian employees,\" according to a 2020 fiscal report . Hegseth is a Minnesota native who served as an officer in the Army National Guard, leaving service as a major in 2021 after deployments to Iraq and Afghanistan, according to his official biography . He earned a master's degree in public policy from Harvard University in 2013. Those questioning Hegseth's qualifications include Rep. Betty McCollum, D-Minn., the ranking member of the House Appropriations Subcommittee on Defense. \"I have great respect for anyone who has served our nation in the U.S. Armed Forces. However, not everyone who has worn the uniform is qualified to lead the Department of Defense,\" McCollum said in a statement , adding that she is concerned that Hegseth \"is ill-prepared to serve as Secretary of Defense.\" If confirmed, Hegseth would lead a U.S. military that has been trying to reduce the alarming rates of sexual assaults from military academies to overseas deployments . In a notable shift, the Defense Department implemented a change earlier this year that grants independent military lawyers the authority to handle sexual assault cases, removing these matters from the chains of command of either the accused or the victim. This change to the military justice system was backed by the current defense secretary Lloyd Austin."
    },
    {
        "url": "https://www.npr.org/2024/11/18/nx-s1-5195224/spirit-airlines-bankruptcy-protection",
        "headline": "Spirit Airlines files for bankruptcy protection but plans to keep flying",
        "content": "WASHINGTON — After years of financial losses and a failed merger attempt, Spirit Airlines filed for Chapter 11 bankruptcy protection on Monday. The low-cost carrier announced it has reached a deal with its bondholders to restructure its debts — and expects to continue flying as normal during the bankruptcy process. The airline says it will continue to honor all tickets, credits and loyalty points. \"The most important thing to know is that you can continue to book and fly now and in the future,\" the Florida-based carrier said in an open letter to its customers . Spirit is the first major U.S. airline to file for Chapter 11 since 2011. Still, the move did not come as a surprise since the company hasn't posted a full-year profit since 2019. Spirit, the nation's seventh-largest carrier, tried to merge with JetBlue, the sixth-largest. But the deal was blocked by a federal judge in January after the Department of Justice and several state attorneys general sued to stop it. Since then, Spirit has been shrinking its operations and selling some of its planes in an effort to cut costs and raise cash. \"We expect to complete this process in the first quarter of 2025 and emerge even better positioned to deliver the best value in the sky,\" the airline said."
    },
    {
        "url": "https://www.npr.org/2024/11/18/nx-s1-5192918/spacex-amazon-nlrb-labor-board-elon-musk",
        "headline": "Accused of violating worker rights, SpaceX and Amazon go after labor board",
        "content": "In the nearly four years that Joe Biden has been president, the National Labor Relations Board has taken an assertive — some say overly aggressive — approach to protecting workers' rights to organize and collectively bargain. Now, SpaceX and Amazon are at the forefront of a corporate-led effort to monumentally change the labor agency. On Monday, attorneys for the two companies will try to convince a panel of judges at the Fifth Circuit Court of Appeals that the labor agency, created by Congress in 1935, is unconstitutional. Their lawsuits are among more than two dozen challenges brought by companies who say the NLRB's structure gives it unchecked power to shape and enforce labor law . A ruling in favor of the companies could make it much harder for workers to form unions and take collective action in pursuit of better wages and working conditions. That would be an enormous setback for labor groups, who have enjoyed unprecedented support from the Biden administration, and a win for companies that have spent considerable amounts of resources over the past four years trying to keep unions out of their workplaces. Complicating matters is the fact that President-elect Donald Trump has named SpaceX founder and CEO Elon Musk to co-lead a new commission focused on dismantling government bureaucracy, slashing spending and jobs. Whether the NLRB is one of the agencies Musk will advise on remains unclear. Ultimately, these cases could make their way to the Supreme Court. The lawsuits brought by Amazon and SpaceX came after the NLRB issued complaints of its own. Agency investigations found the companies had violated the rights of their employees. At Amazon, the issue was the company's refusal to collectively bargain with the Amazon Labor Union. Workers at Amazon's Staten Island, N.Y., warehouse voted to unionize in 2022. At SpaceX, the complaint involved eight employees who said they were fired in retaliation for speaking critically of Musk. Both companies argue that the labor agency's structure violates the separation of powers. \"The NLRB routinely exercises authority to prosecute alleged violators of federal labor law, define the legal standards that govern the prosecutions, and weigh the facts necessary to find a violation — with only limited judicial review by Article III courts,\" attorneys for SpaceX wrote in a court filing. The companies also find fault with the president's inability to fire NLRB board members, who serve five-year terms, and in SpaceX's case, its administrative law judges. Additionally, they argue the NLRB's system for adjudicating cases denies them the right to a trial by jury. NLRB General Counsel Jennifer Abruzzo, a Biden appointee, calls the lawsuits a distraction, pointing to the agency's 90-year history of governing labor-management relations. \"We are trying to hold violators of our statute accountable,\" she said at the National Press Club in October. \"It would be chaos if the agency was not allowed to perform its functions and do it properly.\" Workers' advocates are bracing for a slowdown in labor law enforcement in a second Trump administration. For starters, Trump is expected to fire Abruzzo immediately, exercising power he does hold. (Biden fired Trump's appointee to that position on his first day in office.) Since 2021, Abruzzo, who acts as the NLRB's prosecutor, has taken a broad view of the protections labor law offers private-sector employees. She has worked to remove barriers to organizing, most recently winning a board ruling outlawing \"captive audience\" meetings, or mandatory meetings at which employers try to dissuade workers from unionizing. Trump is expected to replace Abruzzo with someone friendly to employers, who will set a new tone for enforcement. Last time around, Trump's pick for the job was Peter Robb, a management-side labor attorney who served as lead counsel for President Ronald Reagan during the air traffic controllers' strike . In the SpaceX and Amazon cases, all expectations are that a Trump-appointed general counsel will not fight any ruling favorable to the companies. However, similar lawsuits filed elsewhere in the country could result in conflicting court decisions."
    },
    {
        "url": "https://www.npr.org/2024/11/18/1213978431/cop29-trump-manufacturing-home-building",
        "headline": "A fraught climate change conference, how are US home builders doing, and more",
        "content": "There is a LOT of economic news happening at the moment (it all happens, so very much of it, all the time), so we wanted to give you an idea of what we here at The Indicator are keeping tabs on. Today on the show, we look ahead to: countries coughing up money for climate change at COP29, how confident are home builders feeling right now, and ... is US manufacturing REALLY in decline? Related Episodes: A countdown to climate action Why aren't more people taking on the trades? Do polluters pay, or do they get paid? For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter ."
    },
    {
        "url": "https://www.npr.org/2024/11/17/nx-s1-5194470/carrots-recall-e-coli-organic",
        "headline": "E. coli outbreak linked to organic carrots sickens people in 18 states",
        "content": "One person has died and at least 38 people have become ill following an E. coli outbreak linked to organic carrots, according to federal health officials. The Centers for Disease Control and Prevention said Sunday that cases emerged between Sept. 6 and Oct. 28 across 18 states, with Washington, Minnesota and New York reporting the highest number of cases. The CDC warned that the outbreak may have reached additional states and the actual number of infected individuals is likely much higher than reported. \"This is because many people recover without medical care and are not tested for E. coli.,\" the agency said in a statement . Investigations indicate that Grimmway Farms was the common supplier of the organic carrots consumed by individuals before they got sick, according to the CDC. On Saturday, Grimmway Farms — which is one of the world's largest producers of carrots — initiated a recall for multiple sizes and brands of its organic baby and whole carrots. That includes baby organic carrots with best-if-used-by dates that ranged from Sept. 11 to Nov. 12 and whole organic carrots that were sold in stores around Aug. 14 to Oct. 23. The recall applies to carrots sold at Trader Joe's, Wegmans, Sprouts, 365 from Whole Foods, Good & Gather from Target, Marketside from Walmart, GreenWise from Publix, Simple Truth from Kroger, and more. A full list is available on the FDA website . Grimmway Farms, based in Bakersfield, Calif., said the recalled items are likely no longer sold in grocery stores, but they may be in customers' refrigerators or freezers. The company urged that customers with recalled carrots should discard them and sanitize any surfaces they touched. Grimmway Farms added that the implicated farms are out of production. The CDC said E. coli infections can cause diarrhea, urinary tract infections, pneumonia, sepsis, and other illnesses. Symptoms usually show up three to four days after the bacteria is consumed. Most people recover on their own after five to seven days. However, the infection can sometimes result in a serious health condition called hemolytic uremic syndrome (HUS), which can lead to kidney failure, permanent health problems, and even death. The Food and Drug Administration said the recalled products may have been contaminated with the Shiga toxin-producing type of E. coli. So far, of the 38 cases reviewed by the CDC, none have developed HUS."
    },
    {
        "url": "https://www.npr.org/2024/11/17/nx-s1-5193064/fcc-chair-brendan-carr-trump",
        "headline": "Trump taps FCC's Brendan Carr to lead the agency",
        "content": "President-elect Donald Trump has picked Brendan Carr, a veteran Republican member of the Federal Communications Commission, to lead the agency that regulates broadcasting, telecommunications, broadband and other related industries. For much of his career, Carr was seen as a relatively conventional Republican with a pro-corporate outlook. More recently, however, Carr has embraced Trumpian themes about social media, tech and television companies. \"Commissioner Carr is a warrior for Free Speech, and has fought against the regulatory Lawfare that has stifled Americans' Freedoms, and held back our Economy,\" Trump said in a statement on Sunday. \"He will end the regulatory onslaught that has been crippling America's Job Creators and Innovators, and ensure that the FCC delivers for rural America.\" The FCC mostly stays out of the public spotlight, but roars back into public view with controversies over television and radio broadcasts. While it's an independent agency overseen by Congress, Trump has made clear he would like to bring it under tighter White House control and use it to punish TV networks that have fact-checked him or otherwise covered him in a way that sparks his ire. Carr is a previous general counsel of the FCC who is in his third term as a commissioner. Allies and adversaries alike describe him to NPR as a smart, personable and highly qualified figure. Carr is fully qualified for the job, says Andrew Jay Schwartzman, a longtime non-profit and public-interest telecommunications lawyer who is now senior counselor at the Benton Institute for Broadband & Society. But, Schwartzman says, Carr has conducted an \"unusually public campaign\" for the FCC chairmanship. Carr has been \"appearing non-stop on Fox News and other outlets with an uncharacteristically partisan message on pending FCC and, notably, non-FCC, issues,\" Schwartzman notes. Many of Trump's other picks for administration positions also have been frequent guests of Fox News. Carr also wrote the FCC section of Project 2025 , the agenda that the conservative Heritage Foundation sketched out for a second Trump term. Trump disavowed it during the campaign but its themes have dovetailed with his public pronouncements since the election. (A call by House Democrats for Carr to be investigated for engaging in partisan activity over the report did not result in formal action. Carr said he had secured approval from FCC ethics officials to do so in his personal capacity.) Carr likely would pursue a deregulatory agenda. That may include further relaxing or stripping away rules inhibiting consolidation of media ownership, many of which were dropped after the U.S. Supreme Court rulings in 2021. Earlier this month, Carr used the social network X to attack Apple, Facebook, Google and Microsoft for playing \"central roles in the censorship cartel ,\" which he said \"must be dismantled.\" The billionaire Elon Musk — who owns X, advises Trump and has backed Carr's prospects for the FCC chairmanship — reposted his claims and announcement. Carr has backed federal legislation that would punish social media companies that block or suspend users for their \"viewpoints,\" an allegation that Musk and other conservatives have lodged against the tech giants. Carr also supported a law passed by Congress to ban TikTok. \"I just don't see a path forward where we can allow this app to continue to operate in its current form,\" he told NPR in 2022 .  Trump originally supported the ban too. But he reversed his position on the Chinese-owned app after meeting a major donor with a stake in its parent company. Carr has also backed Trump's call for licenses to be stripped from all three major broadcast networks for coverage choices that he has denounced. Carr slammed NBC for inviting Vice President Kamala Harris onto Saturday Night Live for a skit just days before Election Day. Carr argued that might have violated federal rules that seek to ensure candidates receive an opportunity for equal time on broadcasters, with an exception for legitimate news coverage. \"We need to keep every single remedy on the table,\" Carr told Fox News' Maria Bartiromo. \"One of the remedies the FCC has, ultimately, would be license revocation, if we find that it's egregious. And we'll see what they have to say about this. But it needs to deter this kind of conduct.. The whole purpose of this rule is to give people a fair shot.\" Equal-time rules kick in only if an opposing candidate formally lodges a complaint or request with the offending broadcaster if another candidate appears on a show. The Trump campaign told NPR it accepted NBC's unprompted offer the next day to run a minute-long video of Trump during a NASCAR broadcast and a post-game NFL show. Trump taped the video after a rally that Sunday. Broadcast networks are not licensed by the federal government. Individual stations are. But the big three networks – NBC, ABC and CBS – own 80 stations among them. Each station is a profit center, and a pressure point, for the networks. Trump has already sued CBS News for its treatment of a 60 Minutes interview with Harris."
    },
    {
        "url": "https://www.npr.org/2024/11/19/nx-s1-5189643/commerce-treasury-secretary-howard-lutnick-trump-cantor-fitzgerald",
        "headline": "Trump picks Wall Street investor Howard Lutnick as Commerce Secretary",
        "content": "President-elect Donald Trump picked Howard Lutnick, a billionaire investor and veteran Wall Street CEO, as his next Commerce Secretary. Trump, in a statement on Tuesday, also said Lutnick would \"lead our Tariff and Trade agenda, with additional direct responsibility for the Office of the United States Trade Representative.\" At Commerce, he will be responsible for enforcing the sweeping tariffs that Trump campaigned on — and for which Lutnick has expressed fervent, public support. Lutnick , who rebuilt the investment bank Cantor Fitzgerald after the Sept. 11 attacks that killed almost 700 employees, had been little known outside of Wall Street. But he rocketed to prominence — and power — this fall, after Trump named him co-chair of his transition team in August. In recent days, Lutnick had been seen as a top contender to run Trump's Treasury Department, in what has turned into a messy and public battle for the critical role. As a leader of Trump's transition Lutnick is responsible for hiring thousands of federal employees. But he's now joining a Cabinet that is committed to firing many more, as Trump's incoming administration promises to slash federal agencies and spending. (Trump has already appointed Tesla CEO Elon Musk to co-lead what he's calling a \"Department of Government Efficiency.\") And Lutnick seems enthusiastic about the cost-cutting possibilities. \"How much do you think we can rip out of this wasted, $6.5 trillion Harris-Biden budget?\" Lutnick asked Musk , his fellow billionaire Trump super-supporter , on stage at a rally in Madison Square Garden last month. When Musk replied with an estimate of \"at least $2 trillion,\" Lutnick raised his arm and let out a guttural whoop: \"Yeeahhh!\" Lutnick first rose to national prominence during tragedy: In 2001, Cantor Fitzgerald was headquartered near the top of the north tower of the World Trade Center. When terrorists flew a passenger jet into the building on Sept. 11, all 658 Cantor employees who were already at their desks had no way to escape before the tower collapsed. Lutnick's brother, Gary, was among them. \"If we are going to go to work, we're going to do it to take care of our friends' families,\" Lutnick told his remaining employees that evening, he recounted to NPR in 2016. \"We went from being a great company that was making a million dollars a day to a company that was losing a million dollars a day.\" Today, Cantor has several businesses, including a cryptocurrency operation . Lutnick has continued to oversee them while co-chairing Trump's transition team – an arrangement that has drawn questions about how he is navigating federal conflict-of-interest guidelines. Lutnick has denied commingling his roles. He splits his time between his CEO responsibilities – which he performs from 6:30 am to 9 am, and then from 4 pm to 10:30 pm – and volunteering for the Trump team, The Wall Street Journal reported in October. Lutnick has previously donated to politicians of both parties, including Hillary Clinton's 2016 presidential campaign, according to OpenSecrets.org. But in recent years he has evolved into a major Republican donor, who donated millions to Trump's campaign and hosted a $15 million fundraiser at his home in the Hamptons this summer. He has promised to stack the next Trump administration with loyalists. And he has loudly echoed many of Trump's financial policy proposals, including his support for tariffs, tax cuts, and cryptocurrency (where, like Trump , Lutnick also has business interests). During the Madison Square Garden rally last month, Lutnick described his vision for transforming the United States economy — by going back 125 years, to 1900. \"When was America great? At the turn of the century, our economy was rocking,\" he declared . \"We had no income tax, and all we had was tariffs.\" As Commerce Secretary, Lutnick would oversee a sweeping federal bureaucracy that includes the National Weather Service, the Census Bureau and the agency charged with calculating the nation's Gross Domestic Product. Typically, the Secretary is also a roving salesman for U.S. exports — a job that could be complicated if Trump's threat to slap tariffs on all imported products sparks a trade war with foreign governments. The Commerce Department plays a key role in enforcing tariffs and in some cases granting exemptions from the import taxes. Project 2025 — a planning document drafted by Trump allies — calls for dismantling the parent agency of the weather service, NOAA,  and either eliminating or privatizing its functions or turning them over to the states. While Trump has sought to deny a connection, there is plenty of overlap between Project 2025 and his agenda. Wilbur Ross, who served as Commerce Secretary during the first Trump administration, came under scrutiny for bucking scientists in his department when they ran afoul of the president. Ross reportedly threatened to fire officials who oversee the National Weather Service after forecasters tried to correct an erroneous hurricane warning from Trump. Ross also tried to include a question about citizenship on the 2020 census, despite warnings from government experts that it could jeopardize an accurate count.  That move was ultimately blocked by the U.S. Supreme Court."
    }
]