[
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5309725/jeff-bezos-washington-post-opinion-section",
        "headline": "Jeff Bezos' revamp of 'Washington Post' opinions leads editor to quit",
        "date": "2025-02-26",
        "content": "The Washington Post 's billionaire owner, Jeff Bezos, announced a sweeping new libertarian vision for the paper's opinion sections on Wednesday, just four months after his decision to kill a presidential endorsement of Kamala Harris triggered hundreds of thousands of subscribers to cancel. Post Opinions Editor David Shipley, whom Bezos recruited from Bloomberg Opinions in 2022, chose to resign rather than stay to oversee the paper's revamped sections. \"We are going to be writing every day in support and defense of two pillars: personal liberties and free markets,\" Bezos wrote in a memo to staffers announcing the changes. \"We'll cover other topics too of course, but viewpoints opposing those pillars will be left to be published by others.\" Newspaper op-ed sections have incorporated opposing views for years. The term \"op-ed\" is literally an abbreviation for pieces running \"opposite the editorial pages\" that often conflicted with a publisher's editorial line. But Bezos characterized that practice as outdated. \"There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views,\" Bezos said. \"Today, the internet does that job.\" At an hour-long meeting with opinion writers, Shipley said he did not know what lay ahead, according to an attendee who spoke on condition of anonymity because they did not have permission to speak publicly. Shipley said he had wanted a \"broader, pluralistic place,\" but that Bezos sought \"a focused [opinion] report.\" Bezos justified his decision in the memo to staffers. \"I am of America and for America, and proud to be so,\" he wrote. \"And a big part of America's success has been freedom in the economic realm and everywhere else.\" The decision sparked fresh shock and dismay at the paper. After senior news editors raised concerns at a meeting Wednesday, Executive Editor Matt Murray reassured them that Bezos had given no indication that he wanted to interfere with news coverage, according to two people with direct knowledge. A spokesperson for the Post confirmed his remarks. Later in the day, Murray sent a memo to the newsroom to underscore the point: \"The independent and unbiased work of The Post's newsroom remains unchanged, and we will continue to pursue engaging impactful journalism without fear or favor.\" (Murray and Bezos did not reply to requests for comment.) Post Associate Editor David Maraniss, a legendary journalist whose association with the newspaper stretches back more than four decades, wrote on Bluesky that he would never write for it again as long as Bezos owns it. \"One pernicious step after another, Bezos encroached on the Post editorial policy,\" Maraniss wrote. \"Today he seized it fully. The old Washington Post is gone.\" One writer for the opinions section told NPR he was \"heartsick,\" adding, \"leadership matters.\" NPR spoke to six people with direct knowledge of events for this article. They were given the ability to speak anonymously because they were not authorized to speak about internal matters at the paper. Shipley did not respond to requests for comment. According to a person with direct knowledge, Shipley told Bezos that the new approach would violate the Post 's promise of holding power to account. Bezos stood by the newspaper's dogged reporting on the first Trump administration. In that period, the Post adopted the motto \"Democracy Dies in Darkness.\" It won Pulitzer Prizes for coverage of the Jan. 6 attack on the U.S. Capitol and, earlier, of Russian interference in the 2016 presidential election. More recently, Bezos' decision in October to kill the Harris editorial sparked a furor inside and outside the paper, leading editorial writers to resign and more than 300,000 people to cancel their digital subscriptions in a matter of days. (The Post says it has been able to win some subscribers back and garner some new subscribers in the opening weeks of Trump's second term.) As a practical matter, Shipley argued to Bezos, the Wall Street Journal 's highly pro-markets pages have had a similar policy for decades. As with the decision not to publish the endorsement of Harris, Shipley's arguments fell on deaf ears. In his memo to staff, Bezos praised Shipley and wrote that he offered the editor the chance to lead the reformed sections. \"I suggested to him if the answer wasn't 'hell yes,' then it had to be 'no,'\" Bezos wrote. The Post has aggressively covered the new administration. But Bezos appears to have embraced the president's return to power. Bezos personally paid $1 million toward Trump's inaugural fund. He and his fiancée Lauren Sánchez traveled to Trump's Florida estate, Mar-a-Lago, to socialize with the Trumps. And, along with other digital chieftains, Bezos sat behind the president as he was sworn in for a second term. Shipley's two-and-a-half years have brought acclaim for the section, with two Pulitzer Prizes and two Loeb Awards. But his standing was deeply undercut by Bezos's recent decisions, especially over the Harris endorsement. When Shipley decided to withhold a cartoon from the Pulitzer-winning staffer Ann Telnaes about Bezos from publication, he told colleagues he believed he was making a decision on the merits, not pulling his punches. The cartoon depicted Bezos abasing himself along with other tech titans before Trump. \"Not every editorial judgment is a reflection of a malign force,\" Shipley said in a statement shared at the time with NPR. \"My decision was guided by the fact that we had just published a column on the same topic as the cartoon and had already scheduled another column — this one a satire — for publication. The only bias was against repetition.\" Shipley told colleagues privately that he understood, given the moment, it might be hard to credit his actual motivations. The paper has bled veteran talent from both the opinion and news sides since the news broke about the killed editorial. Post journalists left for the Atlantic , the New York Times , the Wall Street Journal , and CNN among other outlets. But Post Publisher and Chief Executive Will Lewis celebrated the change in direction on Wednesday. Lewis previously served for six years in the same role at the Journal , which is owned by Trump ally and conservative media magnate Rupert Murdoch. He has advocated for a similar approach at the Post . Bezos hired Lewis, in significant part, due to his belief the British journalist could build better bridges to Trump and to conservatives. As well as serving Murdoch as an executive for a decade, Lewis was previously editor of the conservative Telegraph in the U.K. and later served as a consultant for Tory Prime Minister Boris Johnson. \"I am very excited about this new clarity and transparency, and cannot wait to see it brought to life in our opinion section. Every Day,\" Lewis said in a note to staff. \"This is not about siding with any political party. This is about being crystal clear about what we stand for as a newspaper. Doing this is a critical part of serving as a premier news publication across America and for all Americans.\""
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5309756/as-elon-musk-continues-sweeping-cuts-to-the-us-government-people-are-really-scared",
        "headline": "As Elon Musk continues sweeping cuts to the US government: 'People are really scared'",
        "date": "2025-02-26",
        "content": "DOGE has eliminated thousands of federal jobs and canceled more than 1,000 contracts. Harvard professor Elizabeth Linos warns, \"We're seeing harms that are not going to be easily undone.\""
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5309785/duolingo-owl-mascot-lives",
        "headline": "Duolingo's owl mascot is alive after all. What did it gain from faking his death?",
        "date": "2025-02-26",
        "content": "Call it a miracle, or a marketing ploy: Duo the owl is back from the dead. Two weeks after announcing the murder of its sassy green mascot, the language-learning platform Duolingo now says he's fine — and that he orchestrated the entire thing. \"Faking my death was the test and you all passed,\" it captioned a video posted to social media on Monday, with a montage suggesting that users brought him back by completing their daily language lessons. y’all really think i’d let a cybertruck take me out? #duolingohasrisen pic.twitter.com/ndGA4F9kGB Duo — full name Duo Keyshauna Renee Lingo, born 1000 B.C., according to one official death announcement — has been the face of the company since its launch in 2011. His extremely insistent — sometimes threateningly-so — lesson reminders and snarky social media presence have made him an online sensation in recent years, whether he's hopping on the latest viral choreography, beefing with Duolingo's legal team or pining after pop star Dua Lipa. Duo's intrigue reached entirely new heights earlier this month after the company announced his death on Feb. 11 and said authorities were investigating the cause. \"He probably died waiting for you to do your lesson, but what do we know,\" it wrote. It released a series of mournful and mysterious social media posts in the days that followed, including videos of Duo being fatally hit by a Tesla cybertruck and other Duolingo mascots giving him a funeral — and then them being killed off, too. Then came the hopeful messages, encouraging users to complete daily lessons and quests in the app to \"bring Duo back.\" As fans — including dozens of companies and brands — paid tribute to Duo, many started to wonder if his death would end up being short-lived. \"Killing the owl off is a big move to get attention,\" Matt Williams, a visiting clinical professor at the Mason School of Business at the College of William & Mary, told NPR earlier this month. \"Smart money says he's going to get resurrected in some way.\" The question was, how — and when — would that happen? On Feb. 17, the company directed users to a website called bringback.duolingo.com, showing a goal of 50 billion XP, or \"experience points,\" which users earn every time they complete a task in the app. Exactly a week later, Duo returned. It started with a video of his resurrection : Duo (or at least a person disguised as him) climbs out of the coffin in which he had been laid to rest just weeks earlier, hops out of a truck bed and walks down the street as if nothing has happened. \"Y'all really think i'd let a cybertruck take me out? #duolingohasrisen,\" reads the caption. The second video pairs flashes of animation with upbeat rap music. It appears to show Duo growing in an egg as users rack up XP points, then hatching with purple wings and celebrating alongside other revived characters. The bring back Duolingo website shows that users around the world collectively earned 50,921,342,438 XP points. The U.S. brought in the most, 6.18 billion, followed by Germany, Brazil and China, according to a ranking on the website, which now reads: \"Duo is saved!\" On Tuesday, Duo finally pulled back the curtain on his fake and untimely demise, in a video that opens with him unzipping and crawling out of his own coffin on a sunny beach. It was all by design because I’m a mastermind pic.twitter.com/DdVigBjyMj \"I've always had two main goals: get people to do their lesson and get Dua Lipa to notice me,\" he says. \"Neither was working. I had to do something drastic. So I thought, why not kill one green bird with two stones?\" The narrator explains that while he has accumulated many enemies over the years, he figured it would be easiest to frame a software engineer named Jimmy. \"Now I know the death video looked incredibly realistic, but it was all edited,\" he admits. \"The cybertruck was mainly there for dramatic effect, and perhaps some social commentary .\" He went on to say his friends — fellow Duolingo characters, which include several humans and a bear — were being asked too many questions and were \"too nice to lie,\" so he made them fake their deaths, too. He also admits to wanting to see \"how many of you would bother to bring me back to life.\" The campaign was a success, he says, because it revealed \"who the real ones were\" and, \"most importantly,\" got Dua Lipa (who publicly mourned the owl) to notice him. \"I guess you could say I put the 'fun' in 'funeral,' \" he concludes, as the video shows him lounging on a beach chair with a drink in hand, and skipping carefree-ly across the sand. \"So yeah, please just do your lesson. Because next time it won't be a fake death.\" Social media reactions to Duo's resurrection and confession were mixed . Many commenters cheered his return, while others wondered what it was all for. Duolingo did not respond to NPR's request for comment. Williams — the former CEO of the Martin Agency, whose creations include the GEICO Gecko — told NPR earlier this month that a lot was riding on how the company chose to bring Duo back. He warned that if the storyline felt too goofy, or inconsistent with Duo's personality, it might alienate some fans — as was the case with Planters when it killed off Mr. Peanut only to reincarnate him as Baby Nut in a 2020 Super Bowl ad. On Wednesday, after watching the saga play out, Williams told NPR he sees Duolingo's campaign as a success. \"By using the Owl's resurrection as an incentive for more users to do their lessons, Duolingo spiked engagement with their product (obviously an important business metric),\" he told NPR over email. \"And they did it in a way that's completely consistent with the Owl's character — after all, the Owl's entire persona was about cajoling users to do their lessons. That's a win for the business and the brand.\" Duo has answered some questions but also raised new ones. For instance, Williams wonders where the story will go next, and how long Duolingo will be able to keep the momentum, especially given most peoples' short attention spans. For now, who — as an owl might say — knows?"
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5308659/federal-employees-musk-trump-chaos",
        "headline": "A pattern emerges in Elon Musk's federal shakeup: 'Break first, ask questions later'",
        "date": "2025-02-26",
        "content": "Stability used to be a hallmark of working for the federal government. Since Jan. 20, it's been quite the opposite. As President Trump acts on his campaign promise to dismantle government bureaucracy and root out waste and fraud, federal workers have complained of mass chaos and confusion while lawsuits challenging the Trump administration's moves pile up. Five weeks in, there's an emerging pattern in how the administration moves to target federal employees, and it looks something like this: This process occurred with both the \"Fork in the Road\" resignation offer, which mirrored an offer Musk made to employees at Twitter in 2022, and the \"What did you do last week?\" email, a question Musk also put to then-Twitter's CEO before buying the company in 2022. \"It's been very eerie watching what's been happening … where he rolls out the same Twitter playbook now with the federal government,\" Shannon Liss-Riordan, an attorney who has sued Musk on behalf of Twitter employees, told NPR after the \"Fork\" offer went out . Both directives were sent from the email address hr@opm.gov, which didn't exist before Jan. 20. Lawsuits are challenging whether OPM even has the authority to send such communications. Meanwhile, Trump has cheered Musk's work and encouraged him to go further. \"Elon is doing a great job, but I would like to see him get more aggressive,\" Trump wrote on his social media site Truth Social. The president's words ignore the fact that Musk himself has no authority to tell federal agencies what to do. In a court filing earlier this month, the White House stated that Musk is a \"Senior Advisor to the President,\" and like other senior advisers, \"has no actual or formal authority to make government decisions himself.\" Still, that doesn't mean Musk — with the ear of the president and a giant megaphone — lacks power. When Musk posted on his social media site X that federal employees could lose their jobs if they didn't respond to the \"What did you do last week?\" email, that threat became part of the narrative, even though the actual email that went to federal employees made no mention of it, and prior OPM guidance stated that responses to mass emails were voluntary . While some agency leaders swiftly issued guidance telling their employees not to respond, others including at the Treasury Department and the Environmental Protection Agency expressly instructed their employees to respond before the deadline, reinforcing Musk's stance that a response was required. Then late Monday, OPM issued new guidance formalizing the transfer of responsibility for the \"What did you do last week?\" request from OPM and Musk to the agencies, telling agency leaders to collect responses to the email and decide what to do with employees who didn't respond. \"It is agency leadership's decision as to what actions are taken,\" the memo stated. Where this playbook — agencies carrying out directives coming from OPM and championed by Musk — might hit a roadblock is in federal court. Last week, in response to the Trump administration's mass firings of probationary employees, labor unions sued the Trump administration , claiming that federal agencies themselves had no plans to fire employees but did so only at the direction of OPM. Their complaint points to a federal statute that states that the head of each executive department \"may prescribe regulations for the government of his department, the conduct of its employees, the distribution and performance of its business.\" In other words, the unions argue, OPM has no business telling other agencies how to manage their employees. \"OPM has, in my mind, vastly exceeded not only its authority, but any past precedent for exercising its authority,\" says Michelle Bercovici, a partner with the Alden Law Group who filed a different complaint over Trump's firing of probationary employees. \"It's definitely break first, ask questions later.\" In its opposition brief, the Trump administration denied that it had created a \"mass termination program,\" only noting that OPM had asked agencies to review probationers based on how their performance was advancing the agencies' mission. The administration insists that agencies made their own decisions about which employees to terminate and which to keep. U.S. District Judge William Alsup of the Northern District of California will hear arguments in the unions' case on Thursday. Now, unions and attorneys are bracing for far deeper cuts, as Trump moves to the next phase of the dismantling. Trump's Feb. 11 executive order directs agencies to prioritize cutting \"all offices that perform functions not mandated by statute or other law\" through a process called a reduction in force. That process moved forward a step Wednesday, with OPM and the Office of Management and Budget sending out official guidance to agencies, saying they have until March 13 to develop \"Agency Reorganization Plans.\" Those plans could mean tens of thousands or even hundreds of thousands of federal employees lose their jobs. Have information you want to share about ongoing changes across the federal government? NPR's Andrea Hsu can be contacted through encrypted communications on Signal at andreahsu.08."
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5309758/npr-diversity-officer-keith-woods-retires-dei",
        "headline": "NPR's chief diversity officer to retire, with DEI in the political spotlight",
        "date": "2025-02-26",
        "content": "NPR Chief Diversity Officer Keith Woods announced Wednesday that he would retire after a 46-year career in journalism and 15 years at the public broadcaster, even as the issue he has championed for decades takes center stage in political discourse. Woods, who is 66 years old, presented the decision as his own.  He told colleagues he had started preparing for his retirement in 2023. He put it off after Hurricane Helene destroyed his home in Tampa, Florida last year. \"After more than four decades in journalism, I'm happy to finally be able to say the words, 'I'm retiring,'\" Woods said in a statement released by the network. \"Though the attacks on the work of diversity, equity and inclusion have taken some of the joy out of this moment.\" Woods' retirement, effective May 2, comes as the federal government and some companies back away from stated commitments to diversity, equity and inclusion. PBS shuttered its DEI office earlier this month, ousting two staffers, although it says it remains committed to telling the stories of all Americans. Because it receives federal funding, PBS said its lawyers had concluded that the move was required to stay in compliance with an executive order from President Trump. In January, he directed federal agencies to terminate all \"equity-related\" grants or contracts. Another order required federal contractors to stipulate that they don't promote such measures. A federal judge has since largely blocked Trump's orders . But Trump and his chief adviser on slashing government programs, billionaire entrepreneur Elon Musk, have called for all federal funding for NPR, PBS and public broadcasting to be eliminated. Republicans in Congress have submitted bills to do that. (NPR typically receives about 1% of its funds from federal sources annually, and about 3% indirectly from stations; PBS receives 16%, according to a spokesperson for the television system.) In a memo, the network's chief executive, Katherine Maher, praised Woods and told staffers and station executives that NPR would not veer from its dedication to diversity. \"NPR remains committed to supporting a diverse workforce, a welcoming workplace, and journalism that serves an audience that is representative of the American public,\" Maher wrote. After Woods leaves, NPR Vice President for Diversity, Equity & Inclusion Whitney Maddox and a deputy now report to the network's chief operating officer. Woods came to NPR after long stretches at the New Orleans Times-Picayune and the Poynter Institute, a journalism school in St. Petersburg, Fla. He is credited with securing funding for NPR's long-running podcast Code Switch and pushing NPR journalists to broaden the sources represented in their reporting. He also worked with public radio stations across the country. He found a firm ally in former NPR Chief Executive John Lansing , who died last year. Lansing declared diversity to be the network's North Star, both as a moral proposition and a business strategy. NPR increased the numbers of people of color in its ranks, though its audiences did not notably grow or shift. (NPR's digital audiences tend to be much younger and more diverse than its broadcast audiences.) In an essay last year that foreshadowed his own departure from the network, former NPR senior business editor Uri Berliner argued that Lansing's approach to diversity shut out ideological diversity at the network. That critique appears to serve as one of the springboards for U.S. House hearings that are expected to focus on NPR and PBS late next month. Woods took pains to say at a staff meeting today that the timing of his departure had nothing to do with the political moment. \"I might be doing virtual cartwheels right now, but for the context of my announcement,\" Woods said, citing \"a withering assault on the values of diversity, equity, inclusion; corporate capitulation all around us; and the treatment of diversity, equity and inclusion as a virus whose carriers must be eradicated. It makes this look like something it is not.\" Disclosure: This story was reported and written by NPR Media Correspondent David Folkenflik and edited by Deputy Business Editor Emily Kopp and Managing Editor Vickie Walton-James. Under NPR's protocol for reporting on itself, no corporate official or news executive reviewed this story before it was posted publicly."
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5296916/what-if-im-missing-form-attorneys-answer-tax-questions-npr-audience",
        "headline": "What if I'm missing a form? Attorneys answer tax questions from NPR's audience",
        "date": "2025-02-26",
        "content": "For many people, filing taxes to the Internal Revenue Service is a befuddling process. There's a lot of jargon. The forms can be confusing to fill out. And there can be financial and legal penalties if you make a mistake. That's why New York-based tax attorneys Hana Boruchov and Leo Gabovich are here to help. Over the past few weeks, Life Kit has been gathering tax questions from our audience for them to answer. Some of you wondered how to handle taxes if you work remotely. Some asked what to do if you have missing tax forms. Others asked a classic question: Do I really need an accountant? Our experts weigh in on six queries. For more advice, listen to our podcast episode in the player above. This interview has been edited for length and clarity. Gabovich: If you've just got a W-2, even if you have a few common deductions because you've got kids or property taxes, there's no reason to pay an accountant hundreds of dollars. The software today is so intelligent and easy to use. You could really just spend half an hour and get it done for yourself. Where I highly recommend an accountant is if you have your own business, are a freelancer or just want to have someone who's knowledgeable to guide you and set you up for success. Boruchov: Look at their qualifications — make sure they are licensed. We've had situations where people had returns done by someone who they thought was a certified public accountant, but they were in fact a nonaccredited individual. Gabovich: Enrolled agents are a great resource for people who want peace of mind. They are individuals who are qualified to be tax preparers and can represent people before the IRS. They generally charge less than a CPA. Gabovich: There's a wonderful resource known as the Taxpayer Advocate Service [an independent organization within the IRS]. If you have an issue, they will assign an advocate to you who will call you or send you a letter and let you know what's going on. They can even issue orders to basically say, \"Hey, IRS, you need to help out a taxpayer.\" Generally, you fill out a straightforward form to describe what your issue is and what you want them to do about it. They will walk you through the process and tell you which forms to fill out. If you don't know how to do it, they will help you fill out the form. Gabovich: You're supposed to report it. Without a 1099 present, the IRS is not made aware of that transaction. You can take the risk of not reporting it, but if you get audited, you'd still have to pay the tax on that $150 [plus interest and penalties]. Gabovich: It depends on where your company is headquartered. New York is particularly aggressive about it. If you are working out of state for a New York employer purely for your benefit, you still have to pay those New York state income taxes. But [many states offer credits if you are double taxed]. If you're trying to separate yourself from being taxed by the state you work in, you'd have to show why your income is not necessarily sourced from business in that state. Boruchov: There are options. You can apply for a payment plan, which the IRS calls an installment agreement . You divide how much you owe by a certain number of months, with 72 months being the maximum term. If you can't afford to pay on a payment plan, you can do what's called a partial pay installment agreement . You don't pay what you actually owe, but what you can afford to pay. Another option is what's called an offer in compromise . It's a deal with the government where you say, \"OK, I owe $50,000. There's no way I can pay for it.\" So you actually compromise on not just the tax, but the interest and the penalty. There's also an option called currently not collectible [if you can't pay both your taxes and your basic living expenses]. The amount is still owed, but you're not making payments. Each state has their own statute of limitations, but it's 10 years federally. For more advice, listen to our episode in the player above. This episode was produced by Margaret Cirino. The digital story was edited by Clare Marie Schneider. The visual editor is Beck Harlan. We'd love to hear from you. Leave us a voicemail at 202-216-9823, or email us at LifeKit@npr.org . Listen to Life Kit on Apple Podcasts and Spotify , and sign up for our newsletter . Follow us on Instagram: @nprlifekit ."
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5308628/trump-white-house-press-access-voa",
        "headline": "Trump White House seeks tighter grip on message with new limits on press",
        "date": "2025-02-26",
        "content": "In the White House briefing room Tuesday, the Trump administration announced its latest steps to tighten its grip on the message it sends out and the news coverage it receives. No longer would the White House Correspondents' Association, made up of news outlets that cover the White House, determine how they will share coverage of President Trump at major events where space is limited. Press secretary Karoline Leavitt told the assembled reporters the White House would make that determination instead. Leavitt said the media association previously had \"dictated\" who was able to report directly on Trump and with this move, she was returning \"power to the people.\" \"Legacy outlets who have participated in the press pool for decades will still be allowed to join – fear not,\" Leavitt said from the White House lectern. \"We will also be offering the privilege to well-deserving outlets who have never been allowed to share in this awesome responsibility.\" The television pool will not be affected, despite the president's differences with many major networks; before entering electoral politics, Trump was a frequent subject of tabloid and television attention and then a reality TV star. Press outlets \"pool\" their resources when coverage by all would be impractical; a selection of print, video, radio, online and photo news organizations alternate in doing the reporting. The Trump administration already has barred The Associated Press, a mainstay of those pools, from covering major events because it has not changed its guidance for calling the body of water between Mexico and Florida the Gulf of America, rather than the Gulf of Mexico. \"In free countries, like the United States is, leaders don't get to pick who covers them day in and day out,\" Politico reporter Eugene Daniels, the head of the White House Correspondents Association, told NPR's Ari Shapiro Tuesday evening on All Things Considered. Leavitt already has invited once-fringe figures from far-right outlets into the press room to ask questions. They include reporters for the conspiracy-minded Gateway Pundit, Steve Bannon's podcast and Lindell TV, started by the MyPillow magnate Mike Lindell . While ideological journalists have attended White House briefings for decades, she has amplified their role. \"It's surreal to watch these so-called new media people asking softball, ludicrous questions to Trump and Leavitt,\" another White House reporter said, speaking on condition of anonymity for fear of repercussions from a boss or the administration. \"I never thought I'd see plants in press briefings of the highest seat of American power.\" The AP filed a lawsuit over the ban, saying the White House violated its First Amendment free speech rights and its Fifth Amendment procedural rights, as it had no opportunity to appeal the decision internally. At a hearing on Monday, U.S. District Court Judge Trevor McFadden, a Trump appointee, pushed Justice Department lawyers to reconsider the administration's stance toward the AP. Yet the judge also questioned why the correspondents' association had such discretion over who participated. The White House appears to have either taken inspiration or refuge from the judge's words - with Leavitt's buoyant announcement the very next day. She was flanked by television screens showing a map of the Southeastern U.S., each stamped with the word \"VICTORY\" in all capital letters. It showed the Gulf of Mexico marked as the Gulf of America, Trump's preferred term. The AP's refusal to change its Stylebook to reflect the president's preference, expressed in an executive order on his first day in office, led to the ban, Trump and Leavitt have said. Judge McFadden suggested that sounded like viewpoint discrimination, something the courts have found violates the First Amendment. Yet he declined the news agency's request for an emergency decree to force the administration to back off the ban. Instead, he set a hearing for March 20. Meanwhile, the president's chief regulator of broadcast media has instigated investigations of each of the major broadcast outlets – ABC, CBS, NBC, NPR and PBS – save Rupert Murdoch's Fox, which is a corporate sister of the pro-Trump Fox News Channel. In 2016, Murdoch struck an alliance of convenience with Trump. It briefly flagged, until last year when Trump once more dominated the Republican primaries. The president, in his private capacity, has filed many lawsuits against media and social media companies. The owners of ABC, Facebook, and X have each paid millions of dollars to settle lawsuits he filed against them. Paramount, CBS's corporate parent, which is seeking government approval of a sale, is weighing whether to follow their example in Trump's $20 billion suit over its interview with Kamala Harris last year. Legal observers almost uniformly say the president has no merit to his case. The administration is operating something of a pincer movement, applying pressure to all possible vulnerabilities. \"Having served as a Moscow correspondent in the early days of Putin's reign, this reminds me of how the Kremlin took over its own press pool and made sure that only compliant journalists were given access,\" Peter Baker, the chief White House correspondent for the New York Times , tweeted Tuesday afternoon. \"The message is clear,\" Baker continued. \"Given that the White House has already kicked one news organization out of the pool because of coverage it does not like, it is making certain everyone else knows that the rest of us can be barred too if the president does not like our questions or stories.\" Other veteran reporters also reacted with alarm. \"This move does not give the power back to the people - it gives power to the White House,\" Jacqui Heinrich, who covers Trump for Fox News, tweeted after Leavitt announced the White House would pick which reporters could serve in press pools. \"Our job is to advocate for the MOST access possible.\" The pressure on the press dovetails with Trump's efforts to clamp down on independent checks on his power within the executive branch. Among the myriad government officials he has dismissed are agency inspectors general and Special Counsel Hampton Dellinger, who investigates federal employees' complaints against the government . He's fired senior military lawyers, whom Defense Secretary Pete Hegseth – a former Fox star – said could be \"roadblocks\" to the White House's agenda. Under Hegseth, the Defense Department has dislodged eight news organizations from permanent work stations at the Pentagon, including NPR, and invited in seven conservative and right-wing news outlets to replace them (along with one liberal outfit, HuffPost). A Reuters defense correspondent tweeted that Hegseth was traveling to visit Guantanamo Bay to visit the new U.S.-run detention center for immigrants without a single reporter who routinely covers the military. Pentagon social media accounts painstakingly documented his comings and goings. The  \"DOD rapid response\" social media account taunted CNN after it departed its small work space and mocked the news media last night: \"Since real journalism is dead, we'll do it for you.\" Some journalists who cover the administration say they believe that veers into propaganda. And that's what is feared by many journalists over at the government-owned Voice of America, who were pressured intensely during Trump's first term. His choice to lead it, Kari Lake, appeared for the first time at the international network yesterday, according to five people there. That said, it was hardly a secret: She tweeted out a picture of the network's nameplate at the entry of its Washington, D.C. headquarters . \"Let's Get To Work,\" she wrote. Lake is a former local news anchor in Phoenix who ran, unsuccessfully, for governor and then U.S. Senate from Arizona. She has denied election losses (both hers and Trump's) and become a frequent critic of the mainstream media. Voice of America (VOA), which is funded by Congress , operates in nearly 50 languages and reaches an estimated 354 million people weekly across the globe. It is a form of soft power in that it delivers news to places where the press cannot operate freely or is not financially robust, and it models how a free press operates, incorporating criticism as well as praise for each U.S. administration. Trump announced Lake's selection as though the position involves a presidential appointment. It does not; the appointment is done by the head of VOA's parent agency, the U.S. Agency for Global Media, and approved by a bipartisan board. Confirmation hearings have not yet been scheduled for Trump's pick to lead the USAGM, the right-wing media critic Brent Bozell . At the time of her selection, Lake wrote, \"Under my leadership, the VOA will excel in its mission: chronicling America's achievements worldwide.\" That's not precisely the network's stated mission. On its website, Voice of America says it's committed to \"providing comprehensive coverage of the news and telling audiences the truth.\" As she awaits her appointment at Voice of America, Lake has taken a role as an adviser to the U.S. Agency for Global Media. In recent days, she has defended the Voice of America's existence from calls for its elimination by presidential adviser Elon Musk. She took to Musk's social media platform X to do so. \"I think it's worth getting in, digging around, fixing what's wrong, bolstering what's good, & putting out an incredible product that fulfills its mission, broadcasting the American story across the globe, & spreading the ideals of freedom & liberty,\" she wrote, linking an interview she sat for with the pro-Trump outlet Epoch Times . Another new adviser to VOA's parent agency is Mora Namdar, who worked for USAGM in the first Trump administration . She also wrote the section on the agency for Project 2025, the blueprint for governing developed by the Heritage Foundation. Trump disavowed Project 2025 on the campaign trail, but now in office, he has enacted several of its proposals . In her section on the agency, Namdar wrote that Voice of America and other U.S. owned international outlets often \"parrot America's adversaries' propaganda and talking points.\" She was part of an effort by Trump appointee Michael Pack, USAGM's chief executive for seven months in 2020, to root out perceived ideological bias throughout the network. A senior White House reporter was investigated for bias; another was demoted after asking tough questions of then U.S. Secretary of State Mike Pompeo in the wake of the January 2021 siege of the U.S. Capitol. A federal judge found that Pack violated constitutional protections. A formal investigation determined that Pack had repeatedly abused the powers of his office, broke laws and regulations, and engaged in gross mismanagement. Ultimately, interviews with more than two dozen people showed that Trump's aides at the White House and USAGM wanted the network to reflect Trump's successes and to tamp down on criticisms of him - a consistent thread of recent developments."
    },
    {
        "url": "https://www.npr.org/2025/02/26/nx-s1-5273818/company-cancels-plans-to-build-offshore-wind-industry-factory-in-massachusetts",
        "headline": "Company cancels plans to build offshore wind industry factory in Massachusetts",
        "date": "2025-02-26",
        "content": "A company that planned to make undersea cables for the offshore wind industry has canceled plans to build a factory in Massachusetts. Somerset officials say it would have been a big economic boost."
    },
    {
        "url": "https://www.npr.org/2025/02/25/nx-s1-5307906/trump-probationary-employees-firing-mspb",
        "headline": "6 federal workers get their jobs back in 1st successful challenge to Trump's firings",
        "date": "2025-02-26",
        "content": "Six fired federal employees must be rehired at least through April 10, according to the Merit Systems Protection Board (MSPB), the independent federal agency that hears employee complaints against the government. The MSPB issued a 45-day stay of the terminations Tuesday evening in response to a request from the U.S. Office of Special Counsel , which had begun investigating the firings. \"I find that there are reasonable grounds to believe that each of the six agencies engaged in a prohibited personnel practice,\" stated the order from board member Raymond A. Limon. The decision comes four days after U.S. Special Counsel Hampton Dellinger argued that he had \"reasonable grounds\" to believe that federal agencies had violated federal statute in terminating six employees who were still on probationary status. The 45-day stay will allow the investigation to continue. Meanwhile, the Office of Special Counsel says it is considering ways to seek relief for a broader group of federal employees similarly fired in recent weeks. (The office is separate from the special counsels appointed by the Justice Department.) The six agencies named in the original complaint — the departments of Education, Energy, Housing and Urban Development, Agriculture, and Veterans Affairs, and the Office of Personnel Management — have five working days to provide evidence that they are complying with the order. While probationary employees lack some of the job protections afforded to career civil servants, they cannot be terminated \"at will,\" Dellinger wrote in his filing with the MSPB . Moreover, agencies must inform employees why they are being fired. None of the six had performance issues, according to the investigation. Instead, Dellinger wrote, the evidence indicates that agencies improperly used the employees' probationary status to accomplish a downsizing of the workforce, without following the proper procedures for doing so. Those fired included disabled veterans working for the departments of Education and Veterans Affairs who would receive preference in a mass layoff done legally. The Office of Special Counsel took up the case of the six fired employees after receiving a complaint, brought on their behalf by the legal advocacy group Democracy Forward and the Alden Law Group. \"These are hardworking individuals,\" said Michelle Bercovici, a partner with the Alden Law Group. \"They're people who want to make this country better.\" Democracy Forward and the Alden Law Group have amended their original complaint to include more than a dozen other federal agencies. \"We will continue to urge the Office of the Special Counsel and the MSPB to follow the law, protect all federal workers, investigate misconduct, and uphold the independence and integrity of our civil service,\" said Democracy Forward President and CEO Skye Perryman in a statement. Dellinger himself was fired abruptly by the Trump administration earlier this month. He sued, noting that under the law, the special counsel may be removed by the president \" only for inefficiency, neglect of duty, or malfeasance in office .\" A judge temporarily reinstated him while his case winds through  judicial system. Have information you want to share about ongoing changes across the federal government? NPR's Andrea Hsu can be contacted through encrypted communications on Signal at andreahsu.08."
    },
    {
        "url": "https://www.npr.org/2025/02/25/nx-s1-5287775/after-decades-in-business-party-city-declares-bankruptcy-and-closes-its-doors",
        "headline": "After decades in business, Party City declares bankruptcy and closes its doors",
        "date": "2025-02-25",
        "content": "One store laid claim to celebrations across America — Party City. That juggernaut is now bankrupt, turning off the music and shutting it all down."
    },
    {
        "url": "https://www.npr.org/2025/03/24/nx-s1-5336716/income-shopping-inflation-tariffs-purchases",
        "headline": "How are inflation or tariffs affecting your shopping and budget? NPR wants to know",
        "date": "2025-03-24",
        "content": "How are you budgeting these days? Whether you're a shopper or seller, a worker or a business owner, you likely have a lot on your mind. Mortgage and insurance rates remain high. Inflation is stubborn . President Trump has added new tariffs on Chinese imports. He's imposed, delayed, re-imposed and re-delayed new levies on goods from the United States' two other closest trading partners, Canada and Mexico . Gas prices are down, but those egg prices ... well, you know. We want to hear your thoughts and observations on how all of this has affected your spending or your plans for the future. For example, have you fast-tracked any purchases, like a car, appliance or a renovation? Or are you putting big investments off? Please fill out the form below. An NPR reporter may contact you for a story."
    },
    {
        "url": "https://www.npr.org/2025/03/24/g-s1-54251/india-china-manufacturing-us-tariffs",
        "headline": "India is hoping its manufacturing industry will profit from Trump's tariffs on China",
        "date": "2025-03-24",
        "content": "SRIPERUMBUDUR, India —  The women knocking on doors of the employment agencies that dot the roads of this industrial town are one sign of how India has profited from U.S. tensions with China. Here in the southern state of Tamil Nadu, many seek work at one company: FoxConn , which manufactures iPhones for Apple. Women make up some 70% of the Sriperumbudur plant's workforce. Twenty-one-year-old Keerthana, who only has one name, was sleepily waiting for a bus to the FoxConn dormitory housing women employees. She'd arrived in the morning on the overnight bus from her hometown. An agency immediately offered her a job at FoxConn. She said she wasn't sure what job she'd be assigned, but she was told she'd earn $170 a month, double her previous wages in a garment factory. \"I'll send the money to my father,\" she beamed. \"It will really help us.\" Such wages are life-changing for many Indian women, and for that, says former Indian government economic adviser Arvind Subramanian , \"I am unambiguously in favor of manufacturing. Because you get many, many more women getting jobs.\" Getting more women into poverty-lifting work is a key reason why India, and Tamil Nadu in particular, seeks to attract more labor-intensive manufacturing. More than 40% of women who work in India's factories do so in Tamil Nadu, although the state is home to only 6% of India's 1.4 billion people. Now India is hoping it will have a chance to lure more manufacturing to its shores amid deteriorating U.S.-China relations and as the Trump administration's tariff policies make it more expensive to do business in China. \"Prime Minister [Narendra] Modi's big bet is that as more and more companies are seeking to exit China … India is poised to play in a very big way,\" says Milan Vaishnav , who directs the South Asia program at the Carnegie Endowment for International Peace, a nonpartisan international affairs think tank. It would build on India's achievements in attracting manufacturing as the mood against China grew hostile during the first Trump administration, and through the pandemic , when concerns grew over China's dominance of global supply chains. India continued attracting manufacturing through the Biden years, as the former president kept Trump-era tariffs on some Chinese-made products and raised others . \"The fact that China was discriminated against,\" says Subramanian, \"meant that India was a good place from which to sell back to the United States.\" One company that shifted operations from China to India in 2017 was FoxConn, a decision widely seen as reflecting Apple's plans to diversify its manufacturing. Now India manufactures nearly 15% of all Apple iPhones, and is the second largest exporter after China. India hopes to nearly double its share of iPhone manufacturing to 25% in the coming years . Last year it exported over $20 billion worth of mobile phones — a 44% rise over 2023, spotlighting how rapidly this market is growing. But there's a key obstacle to India's hopes of attracting more manufacturing: Trump's China tariff policies. Indian analysts say he's been softer than expected on China, where he imposed 20% tariffs — after campaigning on imposing up to 60% tariffs. \"We haven't seen Mr. Trump as being as tough as he was expected to be,\" says Suhasini Haidar , diplomatic editor of The Hindu. Indian officials hoped \"the U.S. would get so tough on China that eventually companies would be forced to move to a country like India,\" she says. \"That promise has not played out so far.\" Ashutosh Varshney , director of the Saxena Center for Contemporary South Asia at Brown University, says Trump's relatively soft approach toward China may be due to \"Elon Musk's rising profile in the Trump power structure.\" Musk's business interests are entrenched in China. Then there are Trump's grievances with India over its trade surplus with the U.S., its largest trading partner, which was $45 billion last year. India's tariffs — which the United States Trade Representative said in its 2024 report are \"the highest of any major world economy\" — range from 45% on vegetable oils to 150% on alcoholic drinks and 100% on coffee. During his State of the Union address, Trump said reciprocal tariffs on India and other countries would begin on April 2. India may lose up to $7 billion in trade with the U.S. if those tariffs are applied, Reuters reports, citing Citigroup. But a Tamil Nadu government representative tells NPR he believes companies will continue shifting to India because of other factors — including a desire to diversify from China and to base themselves in a large consumer market. He spoke on condition of anonymity because the issue of tariffs is politically sensitive in India. But, he said, \"what hurts pipeline investment more than bad policy is uncertainty,\" referring to weeks of Trump's announcements on how, and when, tariffs would be imposed. The ways in which India might be affected are no concern for this Trump administration, says Varshney. \"American companies making more investments abroad is not what Mr. Trump wants,\" he says. \"American companies making more investments in America and foreign companies making investments in America is what he wants.\" Omkar Khandekar and Vinodh Arulappan contributed to this report."
    },
    {
        "url": "https://www.npr.org/2025/03/24/1240552680/how-specialization-can-lead-to-burn-out",
        "headline": "How specialization can lead to burn-out",
        "date": "2025-03-24",
        "content": "Workers assembling control units for tanks and aircrafts in 1943. Half of all workers are showing signs of burnout according to a survey of international workers. Burnout can come from feeling detached from your work's purpose, having too much work, or ... from specialization. Today on the show, we speak with Shigehiro Oishi, author of Life in Three Dimensions: How Curiosity, Exploration, and Experience Make a Fuller, Better Life . Related episodes: Is endless vacation a scam? ( Apple / Spotify ) Why we work so much For sponsor-free episodes of The Indicator from Planet Money, subscribe to Planet Money+ via Apple Podcasts or at plus.npr.org . Fact-checking by Sierra Juarez . Music by Drop Electric . Find us: TikTok , Instagram , Facebook , Newsletter ."
    },
    {
        "url": "https://www.npr.org/2025/03/23/nx-s1-5338006/max-frankel-new-york-times-editor-dead",
        "headline": "Max Frankel, former New York Times top editor, dies at 94",
        "date": "2025-03-23",
        "content": "Former New York Times executive editor Max Frankel, a journalist who had integral roles with the paper for nearly half a century, died on Sunday in his New York City home, the newspaper reported. He was 94. His tenure as executive editor between 1986 and 1994 led to the paper covering more city and sports news. According to a Times obituary , he also ushered in an era where diverse voices were included in the newsroom. He retired at the end of his executive editorship. Frankel joined the Times in 1957 as a reporter covering the Soviet Union. He was charged with making sense of everyday people and their experiences under communism. \"Everything that was going on in Russia at that moment was of enormous interest, even going to the market or going to the movie house,\" Frankel told NPR's Daniel Zwerdling in 1999 . He mentioned how even though his reporting trip introduced him to the markets and the movie houses, his early days reporting in the Soviet Union acquainted him with leader Nikita Khrushchev more than anyone else. Khrushchev \"made it a point of showing up every two or three nights at an embassy party,\" where foreign correspondents would pepper him with questions, Frankel said. Frankel's experiences covering tough and compelling leaders didn't stop in Eastern Europe. He then went on to write stories about Fidel Castro's Cuba. In 1973, Frankel earned the Pulitzer Prize in international reporting for his coverage of President Richard Nixon's historic trip to China. He was born in Gera, Germany, on April 3, 1930, according to the Times . His family fled Nazi forces and landed in the United States in 1940. In a 1999 interview with Diane Rehm, Frankel discussed what it felt like to immigrate from his European home and to find his \"tribe\" among Jewish people in the States. \"I come here and even in the midst of all this freedom, I'm expected to fight the battle for my tribe,\" Frankel told Rehm in 1999. \"And when Israel gets in trouble, I'm expected to stand up for them whether they're right or wrong.\" In speaking with Rehm, Frankel revealed his views on objectivity in journalism. \"The ethic of the business is objectivity and fairness to all, but the inevitable experience that we have — the childhood loves and dangers and risks — they all go into your capacity to perceive, your capacity to judge,\" he said. His 1999 memoir, The Times of My Life and My Life with the Times , features Frankel reckoning with how his own experiences might color his journalism. In the newsroom, he said he aimed to move away from the \"stenographic notes of what the president said\" and instead encouraged analysis. He did not encourage journalists to take a stance on what they believe or who they might vote for, he told Rehm. After retirement, Frankel continued to write. In 2019, the Times published a Frankel opinion piece titled \"The Real Trump-Russia Quid Pro Quo,\" where he alleged that the Trump campaign and associates of Russian President Vladimir Putin \"had an overarching deal: the quid of help in the campaign against Hillary Clinton for the quo of a new pro-Russian foreign policy, starting with relief from the Obama administration's burdensome economic sanctions.\" The Trump reelection campaign sued the Times for defamation in 2020. The Times fought the suit and it was dismissed in 2021 . Frankel married twice in his life, to Tobia Brown in the 1950s and to Joyce Purnick in the late 1980s, according to his Times obituary. He is survived by his children David Frankel, Margot Frankel and Jonathan Frankel."
    },
    {
        "url": "https://www.npr.org/2025/03/23/nx-s1-4794375/does-your-resume-need-a-makeover-life-kit-is-here-to-help",
        "headline": "Does your resume need a makeover? Life Kit is here to help.",
        "date": "2025-03-23",
        "content": "LIfe Kit has tips on how to improve your resume."
    },
    {
        "url": "https://www.npr.org/2025/03/22/nx-s1-5337416/trump-f47-fighter-jet-boeing",
        "headline": "Trump says Boeing will build the new generation of fighter jets, the F-47",
        "date": "2025-03-22",
        "content": "President Trump has announced that Boeing will build the U.S. Air Force's next generation of fighter jets. \"They will have unprecedented power,\" Trump said on Friday, adding that \"America's enemies will never see [them] coming.\" Trump is the 47th U.S. president and the jet is being called the F-47. \"The generals picked a title, and it's a beautiful number,\" Trump told reporters from the Oval Office. \"Nothing in the world comes even close to it.\" Known as the Next Generation Air Dominance, or NGAD, the F-47 will join a legacy of high-performance jets, though little is known about its exact specifications, appearance or capabilities. Trump teased that the sixth-generation fighter aircraft would be \"virtually unseeable\" on radar. Although details on the contract's cost remain unclear, early estimates suggest development costs will exceed $20 billion, according to The Associated Press, while the final price tag would be in the hundreds of billions, The War Zone reported. \"We've given an order for a lot. We can't tell you the price,\" Trump said. The announcement is a big win for Boeing, which has struggled to recover from a series of public relations crises and operational setbacks. The company's reputation has taken a hit after 737 Max crashes in 2018 and 2019, a door plug blowout in 2024, and longstanding problems with its KC-46 refueling tanker program. The F-47 will be built at a Boeing manufacturing space in St. Louis, according to St. Louis Public Radio . Boeing's stock rose by about 5% on Friday, shortly after Trump's announcement. Its largest competitor, Lockheed Martin, saw its shares drop nearly 7%. Lockheed Martin produces the F-35 jet, which still forms the backbone of the Air Force's air combat capabilities. But the F-35's have faced criticism — notably from Trump ally Elon Musk , who has called the F-35 an \"expensive & complex jack of all trades, master of none.\" Musk has instead called on the U.S. Department of Defense to invest more in drone technology in lieu of stealth jets. Secretary of Defense Pete Hegseth said the new warplanes would send a strong message about America's commitment to remaining a global leader in military aviation. The new fighter jet, he said, \"sends a very clear, direct message to our allies that we're not going anywhere.\""
    },
    {
        "url": "https://www.npr.org/2025/03/22/nx-s1-5336770/newsmax-ceo-ruddy-election-fraud-claims-dominion-court-hearing",
        "headline": "Court hearing centers on Newsmax CEO's role in spreading election-fraud claims",
        "date": "2025-03-22",
        "content": "WILMINGTON, Del. — Following the 2020 election, allies of President Trump found a warm reception on conservative media outlets for now-debunked claims about election fraud. More than four years later, lawyers are still sparring over the role cable news executives like Newsmax's Christopher Ruddy played in broadcasting those claims, just as the company prepares to go public . Ruddy's name was mentioned nearly as much as Newsmax itself during a day-long hearing Friday in a defamation case brought by Dominion Voting Systems against the conservative network. Dominion, a voting technology company, reached a $787.5 million settlement with Fox News in 2023 over similarly false claims on its airwaves. This case hinges on the same basic allegations: That Newsmax hosts not only welcomed guests on their shows who peddled false claims of voter fraud, but that they supported those claims knowing they were false and did so to increase ratings. Conspiracy theory-laden claims about voter fraud and corruption at Dominion ushered it into a \"slow death,\" Dominion attorney Eve Levin, because clients no longer wanted to work with it. Newsmax argues, much like Fox did, that Dominion's claims are \"calling for censorship\" and that its hosts were reporting on one of the biggest news stories of the moment. Sitting in the front row of the sparsely attended hearing, Ruddy watched intently as Dominion's lawyers displayed images of his emails and texts, and statements he and other Newsmax employees gave under oath. They outlined Ruddy's hands-on role in the cable network's coverage — and doubts that he and others had about their on-air guests. \"Sidney [Powell] needs to check into a hospital,\" Ruddy said about a member of Trump's legal team who became pivotal to the spread of conspiracy theories about Dominion and voter fraud following Trump's 2020 election loss. (Powell has since pleaded guilty to charges of election interference in Georgia.) Dominion lawyers outlined other instances of Ruddy repeatedly pushing for guests like Powell to come on the network — and when Newsmax shows couldn't book her, they aired clips originally broadcast by Fox. Dominion lawyers argued that internally, Newsmax executives and staff knew guests like Powell, commentator Dick Morris and MyPillow CEO Mike Lindell were \"anything but reliable.\" Yet Newsmax \"implored them to come on,\" Dominion lawyer Davida Brook said in court. She also showed on screen an excerpt of a quote sent from top Newsmax executive Gary Kanofsky, senior vice president of news and operations, to Executive Vice President of Programming and Content Elliot Jacobson. \"Simply giving them a microphone to spew more anti-election rhetoric and advance their claims without being properly equipped to question the legitimacy or factual accuracy of their assertions may be fun, but it's terrible journalism,\" Kanofsky said. \"How long are we going to have to play along with election fraud?\" Newsmax host Bob Sellers asked showrunner Jerry Burke in another excerpt shown in court. Those were just some of the yet-unheard pieces of evidence brought to light in the case suggesting intimate involvement of Newsmax's top executives and talent in programming decisions. Many of the legal documents filed in the case have been heavily redacted or filed under seal. Outside the courtroom, Ruddy told NPR that Newsmax's coverage has always been balanced, and that there were over \"5,000 times\" more incidents of \"balanced\" coverage than the dozen-and-a-half segments at the heart of this lawsuit. \"It's very selective what they've been showing in court,\" he said. \"My view was that even though I had personal doubts about where it was all going, I didn't have the power to subpoena, but I felt like, let's get both sides.\" Newsmax's attorneys on Friday argued that show hosts were solely responsible for their own statements on air and, in one case, a social media post . They say executives, including Ruddy, weren't responsible for writing, editing or delivering any of the content that aired on any of those segments. They argued that anchors like Newsmax star Greg Kelly are opinion hosts with opinion shows. As such, they are free to give their opinions under the First Amendment. Newsmax licenses another show that entertained election conspiracies, the Howie Carr Show; its employees are not involved in their production, the lawyers added. Newsmax attorneys also made a technical argument that Dominion has sued the wrong company. Newsmax Broadcasting LLC, attorneys said, is the company that published all of the segments on the cable news channel, not its Newsmax Media Inc. parent company. The court held the hearing on Friday to determine whether the case will go before a jury, or whether the judge will rule on some of the key arguments ahead of trial. A jury trial is scheduled to begin next month. Newsmax recently settled another defamation suit brought by voting tech company Smartmatic USA before that case made it to trial. The cable channel agreed to pay out $40 million to settle that case. In recent filings with the U.S. Securities and Exchange Commission , Newsmax said it will vigorously defend its case against Dominion, but that a loss in the case could hit the company's finances hard. Dominion's claims are estimated to be upwards of $1.6 billion against the company. Historically, it has been difficult for plaintiffs suing news outlets for defamation to win. They must prove that the outlet spread defamatory statements with \"actual malice\" — that is, that it either knew what it was broadcasting was false and harmful, or had grounds to know it and acted with \"willful disregard\" of the truth. Judge Eric M. Davis, who also presided over the other two voting systems cases in Delaware, is expected to issue a written ruling in the coming days or weeks. In Dominion's case against Fox, Davis denied both sides' requests for summary judgment — with a few exceptions in Dominion's favor. Those exceptions, however, dealt a huge blow to Fox: Davis's ruling outlined that the conspiracy theories linked to the 2020 election, were in fact, false. \"The evidence developed in this civil proceeding demonstrates that [it] is CRYSTAL clear that none of the Statements relating to Dominion about the 2020 election are true,\" Davis wrote in 2023 ."
    },
    {
        "url": "https://www.npr.org/2025/03/21/nx-s1-5336351/voice-of-america-trump-lawsuit-kari-lake-voa",
        "headline": "Voice of America staff sue Trump administration for shutting down network",
        "date": "2025-03-21",
        "content": "Six Voice of America journalists sued Kari Lake and the Trump administration on Friday, alleging their moves to shut down the U.S.-funded network were unlawful and unconstitutional. The journalists say that the government's acts violate their First Amendment rights on free speech grounds and usurp the U.S. Congress's control of the power of the federal purse. More than 900 full-time network employees were placed on indefinite leave last weekend; 550 contractors were terminated from their jobs. Most employees at the federal parent, U.S. Agency for Global Media, were also placed on indefinite leave. The lead plaintiffs include Patsy Widakuswara, until recently Voice of America's White House bureau chief and Jessica Jerreat, its press freedom editor. Four other journalists sued anonymously as John Does. Kathryn Neeper, the director of strategy and performance assessment at the U.S. Agency for Global Media, is also a named plaintiff. She was also placed on leave. Few Voice of America journalists are known inside the U.S.; the network is prohibited from broadcasting to American audiences. Nonetheless, Widakuswara made headlines twice: First in pressing Trump's then-Secretary of State Mike Pompeo in early 2021 over the siege of the U.S. Capitol and, earlier this month, in asking Irish Taoiseach Micheál Martin about \"the president's plans to expel Palestinians from Gaza\" at an appearance with President Trump at the White House. Irritated, Trump asked Widakuswara what outlet she worked for. Upon hearing the answer, he replied, \"No wonder,\" and called on another reporter. Lake is Trump's special adviser overseeing USAGM. \"Waste, fraud, and abuse run rampant in this agency and American taxpayers shouldn't have to fund it,\" Lake said in announcing the moves last weekend . The effect was to shut Voice of America down. The most recent stories on its home page and its audio headlines feed are a week old; live streaming services are unavailable. The suit, which additionally names acting USAGM Chief Executive Victor Morales as a defendant, seeks immediate reinstatement of all full-time staffers and contractors. It points to regulations and law which specify a firewall to insulate Voice of America and the other international networks funded by the agency from political tampering. Those measures are intended to ensure their professionalism. \"Tragically, Kari Lake lives in the MAGA fantasy world, but she makes decisions that have real-world consequences for hundreds of journalists,\" said David Seide, the lead attorney on the suit. Seide is senior counsel at the Government Accountability Project, a non-profit that seeks to protect the rights of whistleblowers. \"We've assembled a coalition of journalists, unions, and advocacy groups to stop and reverse the DOGE machine,\" Seide added. Among the other backers of the suit are the press-rights group Reporters Without Borders and unions representing federal employees, journalists, and foreign policy staffers. Lake gave this one-sentence reply to a request for comment for this story: \"Kari Lake does not grant interviews or interact with disreputable 'news' outlets like NPR.\" She has not responded to prior efforts seeking interviews. Morales and the agency itself did not respond. Congress has appropriated funds for the Voice of America every year since the broadcaster's founding during World War II. Lawmakers allocated additional money for the broadcaster and other federally funded networks as part of the stopgap spending measure passed last week. In addition to Voice of America, the U.S. Agency for Global Media also oversees Radio/TV Martí, which broadcasts to Cuba. The agency also disburses the money Congress allocates for privately incorporated networks — Radio Free Europe/Radio Liberty, Radio Free Asia, the Middle East Broadcasting Networks — as well as the Open Technology Fund, which propels the open-source tech undergirding Signal and other secure communication programs. The networks are intended to serve as a demonstration of soft power in places without a robust or free press. By providing news that incorporates political debate and dissent inside the U.S., the networks aim to promote and model pluralistic American ideals. According to the agency, the networks together reach more than 420 million people in 63 languages and more than 100 countries each week. They are fully funded by federal dollars. The withholding of federal dollars from the non-profit broadcasters has had immediate repercussions. Radio Free Asia on Friday furloughed three-quarters of its U.S.-based staff as it burns through the remaining money it has; Steve Capus, the chief executive of Radio Free Europe/Radio Liberty told NPR's Leila Fadel this week that without a restoration of funds, the network would face \"pretty drastic actions.\" Radio Free Europe/Radio Liberty sued Lake and the Trump administration earlier this week; the Open Tech Fund filed suit Thursday. Their suits were filed in the District of Columbia; the Voice of America plaintiffs sued in federal court in Manhattan. The lawsuits are a replay of the litigation that ensued during Trump's first term. His pick to run USAGM, Michael Pack, sought to overhaul the agency. His tenure was marked by one controversy after another ; a formal federal investigation found that he had abused his powers. Soon after taking office in mid-2020, Pack sought to deny work visas for foreign nationals employed by the network. In the newest litigation against Lake, Morales and USAGM, two of the unnamed plaintiffs are described as freelance journalists working under contract to VOA. Each is said in the lawsuit to be a foreign national authorized to work in the U.S. under a J-1 visa; their visas will expire on March 31 if their visas are not renewed and the agency is not operational once more. In that case, they would have to return to their home countries. John Doe 3 would return to a nation under rule by an authoritarian regime that has labeled Voice of America a \"subversive organization,\" according to the lawsuit; the plaintiff risks imprisonment for 15 years. John Doe 4 is described as \"a member of the LGBTQ community and is from a home country which persecutes and discriminates against LGBTQ people.\" Lake, a former local TV news anchor in Phoenix, ran twice for statewide office in Arizona as a MAGA Republican candidate. She lost both times. Last month, she became a senior adviser to the U.S. Agency for Global Media. Trump initially touted her as the next director of Voice of America but his top budget-slashing adviser, Elon Musk, and other administration officials called for the network to be shut down altogether. Lake has since embraced that charge. \"From top-to-bottom this agency is a giant rot and burden to the American taxpayer—a national security risk for this nation—and irretrievably broken,\" the agency said in its release last Saturday . \"While there are bright spots within the agency with personnel who are talented and dedicated public servants, this is the exception rather than the rule.\""
    },
    {
        "url": "https://www.npr.org/2025/03/21/g-s1-55154/life-milestone-pew-study-retirement-home-ownership-americans",
        "headline": "What's the ideal age to reach a life milestone? Many Americans say it depends",
        "date": "2025-03-21",
        "content": "What do you consider a life milestone? Maybe it's buying a home, starting a family or finally finishing that manuscript you've been working on. A new survey from the Pew Research Center released Wednesday sought to find out what Americans think are the ideal times for some of those traditional milestones to take place. Spoiler alert: it depends! From the White House to your home — get political news and analysis that matters sent straight to your inbox, with the NPR Politics newsletter . These averages are reflective of a larger cultural trend among younger Americans — they're hitting these milestones later in life than previous generations, according to a Pew analysis from 2023. The study, which looked at Census Bureau data, showed that adults under 21 were hitting major life milestones later than adults from 40 years prior. That tracks with the most recent census data , which says the median age for first-time marriage in 2024 was 30.2 years for men and 28.6 years for women. In 1974, those respective ages were 23.1 and 21.1."
    },
    {
        "url": "https://www.npr.org/2025/03/21/1239865438/change-gross-domestic-product-gdp",
        "headline": "Can we just change how we measure GDP?",
        "date": "2025-03-21",
        "content": "Howard Lutnick, US commerce secretary, speaks to reporters following President Trump's joint address to Congress on March 04, 2025 in Washington, DC. There's one statistic that rules them all when it comes to keeping track of the economy: gross domestic product (GDP). It's the sum of all final transactions, so all the goods or services bought and sold, in an economy. GDP tells us how hot the economy is running, or how cool — like if we might be heading into a recession. And it's an important tool to compare countries, policies, and politicians. It's used by the U.S. government to allocate money and by businesses to make decisions about the future. For close to a century the building blocks of GDP have been the same. Though there have been updates to the methodology behind calculating it. The U.S. Bureau of Economic Analysis, the federal agency that calculates it, is constantly tweaking their process to make GDP accurately reflect the changing economy. Now the BEA's boss, Commerce Secretary Howard Lutnick, has proposed a much bigger change: taking government spending out of GDP. On today's show, can the U.S. change how it measures GDP? We talk with a former head of the BEA — about what he thinks they're likely to do now, and about the pressure he faced while trying to compile GDP for nearly two decades. Turns out, people have always been trying to bend it to make whatever grand project they're working on look better. For more: This episode of Planet Money was produced by Emma Peaslee and edited by Jess Jiang. It was fact checked by Sierra Juarez and engineered by Robert Rodriguez. Alex Goldmark is our executive producer. Find more Planet Money : Facebook / Instagram / TikTok / Our weekly Newsletter . Listen free at these links: Apple Podcasts , Spotify , the NPR app or anywhere you get podcasts. Help support Planet Money and hear our bonus episodes by subscribing to Planet Money + in Apple Podcasts or at plus.npr.org/planetmoney . Music: NPR Source Audio- \"Backstreet Boogie,\" \"We Gave Up Too Soon,\" and \"I Won't Give Up\""
    }
]